{"text": "Aboshan was the ruler of the cephalid Mer Empire that controlled a large portion of Dominaria 's oceans after the Phyrexian Invasion . Aboshan came to power due to a pact he made with Laquatus , who helped him replace the royal merfolk family and take their magical powers. He also secured his rule by marrying Empress Llawan to create a military alliance between his faction and her father's faction, but Aboshan became suspicious of her and so had her exiled to a border section of the empire. During his reign, Aboshan became increasingly paranoid about plots against him. He disliked air-breathers and the creatures of the deep ocean and so persecuted them, which in turn led to actual plots being made against him, which therefore increased his paranoia and so created a vicious cycle of persecution and assassination attempts. Many of the persecuted individuals fled to the southern court of Llawan, which led to her becoming a real threat to Aboshan. Amongst the few people Aboshan did trust was Ambassador Laquatus . Therefore, when the ambassador returned to the Imperial palace in pursuit of Captain Satas and the Mirari , Aboshan decided to place the merman in charge of rooting out conspirators. Aboshan was unaware that Laquatus was probably the biggest conspirator against him and so gladly allowed the merman to arrest and execute various rival courtiers based on false evidence. Whilst this was going on, Aboshan withdrew further from public life, remaining almost permanently inside his bedchamber except when he wanted to rant to the court about treachery and execute a random person. However, Aboshan eventually tired of his seclusion and decided to visit the royal treasury to inspect the magical devices held there. He transformed into a legged, air-breathing form and searched for an artifact that could grant him the power to secure his empire. He eventually found such a device - the Mirari. As he gazed into the orb, Aboshan was transfixed by visions of a world entirely covered with water and so he poured mana into the Mirari to make the vision a reality. This caused an enormous wave to sweep over the coast of Otaria, flooding a third of the continent. However, as with Kirtar before him, Aboshan's spell went out of control, devastating the palace and causing Aboshan to shift uncontrollably between his gilled and lunged form. He retained enough awareness to call his guards when Laquatus tried to take the orb from him but soon died as the Mirari consumed him. Associated cards: Quoted or referred to:"}