{"text": "Ajani Goldmane ( Phyrexian : DFaUnEED , IPA : [ʔəʤɒniʔ] ) is a leonin planeswalker from Naya , Alara . He was part of the Gatewatch , but was later compleated by the phyrexians into becoming a sleeper agent . At the end of New Phyrexia's Invasion of the Multiverse , he was un- compleated . Ajani is a large one-eyed albino cat warrior , torn between his leonin ferocity and his sense of justice. He believes the strong should protect the weak, and that tyrants must be toppled at all costs. He cares for his allies, taking a mentor-like role for them, and doing his best to help them through their time of trouble. He is a large figure, standing 6'6\" tall and weighing 250 lbs. He has strong feline face and white fur covering his entire body. A scar runs through his left eye socket. Ajani's beliefs have evolved over the years. When his spark first manifested (over the loss of his brother), he believed that channeling his rage toward avenging his fallen loved one was the correct path. He let his seething rage drive him forward, ignoring how his actions affected those around him. However, spending time with Elspeth morphed these views and, ultimately with her death, showed him that his fury wasn't the correct path to inner peace. His specialty is magic of the purification of body and soul: spells that heal and strengthen his allies, and spells that evoke the inner, spiritual essence of others. Ajani is primarily white -aligned but secondarily green . He formerly had access to red mana but lost access to it after learning that rage doesn't bring peace. As Ajani planeswalks, he disappears in a golden light storm. After being compleated, he wore a cybernetic eye in place of his blinded eye and had black wires and cables under his skin. The skin on one of his arms was burned away by Jaya Ballard . He wore a suit of metallic red and white armor that appeared to have grown out of his body and carried a massive double-headed axe, the blades reversed in Norn's honor. Though the Mirrans were unable to remove the Phyrexian metal before his uncompleation, the metal was purified during the ritual, turning to gold. As a Phyrexian , Ajani's inherent beliefs and goals were twisted to align with those of his new masters. Under their influence, Ajani felt he was part of a pride once more, welcomed and accepted by a community that valued him. Phyrexia opened his eyes to the danger that \"differences\" could cause. Teamwork, he realized, was about aligning perspectives into a single point of view. By removing differences, everyone could be together as part of a single Phyrexian pride. In Phyrexia, everyone was together and equal. He never realized before becoming part of Phyrexia how much his values aligned with theirs, and he was eager to help his friends by bringing them into the fold. As a minion of Elesh Norn , Ajani had a habit of quoting passages from the Argent Etchings , the scripture of Norn's Machine Orthodoxy. Ajani's rage as a flame avatar Ajani was born as an albino Nacatl , a stigma among his people described as \"white as death\", and so spent much of his youth as an outcast. It is unknown what happened to Ajani's parents, but it appears the only one to care for him was his older brother Jazal . Jazal gained a great deal of prestige among his peers despite Ajani's status among the pride, and soon Jazal rose to kha of the Qasal Valley pride. Jazal accepted the position in hopes that Ajani would be accepted and honored as he had been. However, Ajani was barely tolerated, a fact that Ajani eventually came to accept as appropriate treatment. However, Ajani had at least one friend, the tribe shaman Zaliki. Ajani's rage as a Lightning Helix Ajani was unique among his kin, not only for his bone-white fur but also due to his unique abilities to manipulate the various magics of the soul. He could see deep into other beings, and see the very essence of their spirits. He could call that essence forth and manifest it in a multitude of ways and, despite his pariah status, he was considered the best healer in his tribe. This earned him none of the prestige that Jazal thought it should, but Ajani once more just accepted that as his self-worth to keep trouble from his brother. As the Festival of Marisi , the annual celebration of the Breaking of the Coil neared, Ajani was attacked by a group of humans, an unusual event in itself, but foreboding as Jazal discovered that they had been sent after Ajani himself, and not merely the Nacatl. Ajani sought to repay his brother for his heroic defense and began a hunt for the feast celebration. Secretly he was hoping to gain the pride's respect, but when he brought down a Godsire his kill was stolen by the worst of his persecutors, Tenoch . Ajani was savagely beaten by the rival leonin, a punishment that escalated after the white cat clumsily revealed his ability to see into the souls of others. He was left to drag himself back to the feast, keeping his peace for the sake of his brother and the tribe. That night, after the revelries had died down, a dark figure stole through the sleeping pride. They dropped a vessel of dark magic into the fire and shades burst forth to attack the tribe. During the attack, Jazal was slain in his lair with his black axe, the dark twin to Ajani's own. Gripping Jazal's body, Ajani heard Jazal's voice and when he opened his eye, he was no longer on Naya . Ajani seeks revenge for his brother's death Ajani found himself on Jund where he met Sarkhan Vol , who protected him from the dragon Karrthus and listened to the neophyte walker recount his tale. Sarkhan advised him to take hold of his anger and use it, to use his newfound gift as a walker to track down his brother's murderer and showed him how to planeswalk back to Naya. He found himself wandering the Qasali Valley, eventually finding his way to the ruins of Antali where he encountered a strange apparition that set him on his quest for vengeance. Ajani interrupts Nicol Bolas' plans in Alara Back in Jazal's lair, he found the remnants of his brother's axe. He used the other axe head to create a new weapon that symbolized his plans for revenge. Of Jazal's body, there was no trace aside from the blood scattered all across the floor. He found what had become of Jazal in the pride center, where Jazal had been cremated. He spread Jazal's ashes across his body, and stalked off to confront Tenoch, suspecting him responsible for a mysterious object found in the fire. He found Tenoch overlooking a cliff and after a brief argument, in which Tenoch admitted he respected Ajani, Ajani threatened the other Nacatl by dangling him over the cliff edge. As Ajani let go, Tenoch dragged him over the ledge. Tenoch's clothing snagged on the cliff, and although Ajani grabbed hold of his foot, the rival leonin dislodged him. Taking serious injuries in the fall, and with no other option, he vanished into the Blind Eternities. Ajani woke up in the care of Elspeth Tirel on Bant . After two weeks and the ministrations of the Bant balmgivers, Ajani left after warning Elspeth of the coming conflict. When he returned to Naya, he confronted Tenoch's mother, who revealed that Marisi had something to do with the attack on the pride. While confronting the legendary hero, they were interrupted by Mayael and Marisi pointed Ajani to seek the dragon Nicol Bolas . Knowing of only one place to find dragons, Ajani began a walk to Jund... only to find that Jund no longer existed. The Conflux had begun. After a rough landing, Ajani found himself in the presence of Kresh and Clan Nel Toth who swore to help Ajani find his vengeance and slay the dragon. A lengthy sojourn took them to the borders of Grixis where Kresh settled his grudge against Rakka-Mar, though it was Ajani who finished her off with a bolt of rage. To Ajani's surprise, Zaliki and Mayael found him on the edge of Grixis and looked to him to lead them against a horde of dragons led by Sarkhan Vol. During this important crux, Ajani finally found Jazal's murderer. Zaliki was the one responsible for his brother's death but had been manipulated into doing so by Marisi. As Marisi had been slain by Zaliki, Ajani's quest for revenge would go unanswered, except that Bolas chose that moment to confront the assembled armies. In front of all the armies of Naya and Jund, Bolas consumed the mana of the Maelstrom, and in a desperate attempt to stop Bolas, Ajani severed everyone's mana bonds and absorbed the last tiny bit of the Maelstrom that Bolas hadn't. Using that power, he called up an effigy of Bolas's soul and used it to banish Bolas from Alara. In the aftermath of the conflux wars, Ajani was offered the position of Kha and the respect of his entire pride, the one thing he had desired above all else. He was not the same being that he had been through and chose to leave Naya instead, entrusting Zaliki with the responsibilities of being the Kha. Ever after, Ajani was never left out of Bolas's plans. He'd devise special stratagems to occupy the leonin while Bolas's other schemes progressed. The battle during the conflux of Alara had inspired a hesitancy in Bolas that he had for few others. Ajani's debt Sometime after the conflux, Ajani once again sought out Elspeth, starting with those who last saw her. He finally found the errant knight in the gladiator pits of Urborg facing off against another heavily armored planeswalker . Ajani stopped Elspeth from delivering a death blow when she saw a symbol on the other walker's arm. He escorted her back to her residence and beseeched her to return, that she could do more good on Alara than fighting for the money in the pits, treating herself so badly. She rebuked his offer, stating that it was pointless and that eventually, Grixis would overrun Bant's golden plains, that Bant itself was already gone. Dismayed, Ajani acquiesced to her refusal, stating simply that her lack of hope saddened him. As a final kindness, before his departure, Ajani returned Elspeth's armor, which she had left on Bant. Ajani helps Elspeth on his journey to defeat Xenagos After some time, Ajani found he could not bear to leave Elspeth to pursue her destructive behavior and so he tracked her to the plane of Theros . He had been here before and was well acquainted with Brimaz , who to his surprise had risen to become king. Around the campfires, he learned much of what had been going on, including Elspeth's role in what had happened and the injustice done to her. As a favor to him, Brimaz ordered his warriors to find her and after a brief search, the pair were reunited at Tethmos. Ajani could see that her trials had badly hurt her, but he could not get her to speak of what had happened. Instead, she swore they would set things right, and Ajani agreed to stay at her side. To do so, they would have to travel to the mysterious temple of Kruphix at the edge of the world. They traveled by river from the Nessian forest to the Siren's Shipyard, seeking the legendary mariner Callephe. Standing amidst the shattered wreckage of ships, Ajani called up the legendary sunken ship known as The Monsoon , and to their surprise, Callephe appeared as soon as her ship had risen from the deep. Ajani mourns the death of his friend Elspeth She agreed to take them to the edge of the world, but that turned out to be a lie. Kiora revealed her deception as soon as they reached the sunken city of Arixmethes. Thassa confronted them, intending to deal with the lying merfolk, but not before sending the pair on their way, wishing them luck. They arrived at the edge of the world, and the god Kruphix allowed them to pass to the gateway of Nykthos, the shrine of Nyx. To gain entry to Nyx, one of them had to undergo an ordeal sent from the gods, and Ajani urged Elspeth to take Thassa's ordeal, but she pulled away from him at the last moment and gained entry from Erebos . He cursed his friend as a fool but set to the task at hand. They confronted Xenagos and the pair battled the god until at last Elspeth struck him down. However, the battle had taken its toll, and Nylea warned the pair that they must escape before Erebos or Heliod found them. They nearly escaped before Heliod appeared and used her weapon to murder Elspeth. Ajani took his dying friend back to Theros and prepared to fight the agents of Erebos that were coming to claim his friend, but Brimaz's warriors ambushed him, pulling him away for his good as his friend died. Ajani woke up back in Tethmos, where Theros' leonin healed him. After sparring with Brimaz, Ajani, unsure of what to do next, decided to find a cause to fight for. He remembered how Heliod struck down Elspeth and decides to make people stop believing in him. He traveled to Heliod's temple in Meletis, where he reveals Heliod's murder of Elspeth. Once his message of turning away from the gods had taken hold, Ajani returned to Oreskos. There he told his message to Brimaz and the dozen or so leonin present that the gods are creations of belief. With that, he earned his place amongst the leonin of Theros. Ajani now wears Elspeth's cloak to honor her memory. Oath of Ajani - “Until all have found their place, I will keep watch.” Ajani fights alongside the Renegades Ajani left Theros, assured that his words had taken root enough to grow without him. He planeswalked from Kamigawa to the house of his old companion Tamiyo . Ajani stayed with her to mourn Elspeth's fate, to heal amidst the company of friends. During his stay, he learned of the crimes of Tezzeret 's Infinite Consortium on Kamigawa and also informed Tamiyo that Elspeth had seen Tezzeret alive on New Phyrexia . Ajani prepared to track him down and bring him to justice. After a month, the leonin had learned that Tezzeret had assumed a position on the plane of Kaladesh . On Kaladesh, Ajani established contact with the Renegades with Renegade Prime and Oviya Pashiri. Upon arriving at Oviya's home, he learned that she had been taken into custody for being a Renegade. Meeting with the Renegade agent \"Shadowblayde\", an elven lifesmith, Ajani learned where Renegade Prime had been captured and of Tezzeret's involvement. The Renegades tracked Oviya to the Dhund, where Ajani found a cell filled with poisonous gas. Scaring the guardsman away, he forced the chamber door open, finding Oviya as well as Nissa and Chandra . The four quickly escaped before any more guards could arrive. After the events of the Consulate crackdown, Ajani continued to aid the Renegades. Following Chandra's duel with Baral in the streets of Ghirapur, he took great care in healing Oviya and Chandra's injuries, as both had been critically wounded in the battle. Once the Renegades had secured victory in the Revolt and brought sweeping change to the Consulate, Ajani found it an honor to be welcomed into the ranks of the Gatewatch . He took his oath for protecting the innocent from tyrants and helping all beings find their place. Though he now stood among them, Ajani objected to the Gatewatch's plans to immediately confront Nicol Bolas on the plane of Amonkhet. He pleaded with them to reconsider and wait for more allies, citing the possible collateral damage and Bolas' immense potential for advantage at the seat of his power. Ajani asked the Gatewatch to regroup on Dominaria and recruited Jhoira and her Weatherlight crew to help in an undisclosed venture. After learning that only Gideon and Liliana had arrived, and that they had been distracted by their quest against Belzenlok , the Leonin warrior left the plane again, to recruit more planeswalkers to join their fight against Bolas. Ajani fights as the Interplanar Beacon is lit Ajani traveled with the Gatewatch to Ravnica for the final confrontation with Bolas, and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . He bolstered the anti-Bolas forces by creating Aetherial copies of his leonin allies from Naya and Theros, and he rallied the trapped planeswalkers against Bolas, inspiring courage in them and boosting their morale. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Ajani, Huatli , Jiang Yanggu , and Mu Yanling volunteered to help protect and rescue civilians. With the help of Vraska and the Golgari Swarm , they were able to evacuate many civilians to the tunnels beneath the city, where they would be safe from the Dreadhorde. Ajani survived the battle and was present during the Planewide Celebration that followed. Ajani participated in the memorial service for Gideon on Theros . Afterward, he traveled to Femeref on Dominaria where he strategized with Karn and the Gatewatch on how to deal with the threat of New Phyrexian expansion. There, he reunited with Elspeth. Ajani told his friend that he had discovered the name of her home plane and that somehow, that plane survived a Phyrexian invasion. At his request, Elspeth left for the plane to learn the secret of its survival. Ajani compleated. Ajani was sent by Jhoira to rescue Karn from the Caves of Koilos . The two attended the Keldon-Benalish peace summit in Oyster Bay . After Ajani was informed of Tamiyo's compleation by Teferi and multiple Benalish knights were revealed to be Phyrexian sleeper agents , he split from Karn to pursue them. During this pursuit, he was captured and compleated , before being returned as a sleeper agent . At the battle of the Mana Rig , he revealed his compleation, killing Jaya Ballard , destroying the Golgothian Sylex , and helping to capture Karn. While he initially resisted his sleeper agent programming, his values quickly came to align with Phyrexia's. He felt as though finally welcomed into a pride, a longing he had since his banishment from his own, and quickly came to see teamwork as an alignment of perspective. Hating differences, he longs to welcome his friends into his new family. Ajani returned to Dominaria to prevent Teferi from traveling back in time to learn the use of Urza's Sylex . Fighting over the powerstone core of the Skyship Weatherlight , Ajani was eventually defeated and sent off a cliff. At some point, Ajani joined the Machine Orthodoxy and presided over Karn's dismantling. Tezzeret , having drawn attention to himself, excused his absence by claiming to be dirty from the Dross Pits, but Ajani simply gave him Elspeth cloak to clean himself with. Ajani underwent further compleation, losing his skin in favor of porcelain plates. After the invading planeswalkers made it to the seedcore, Ajani intercepted them. By now, his skin had been flayed and replaced by the Orthodoxy's porcelain plates. He offered to welcome his friend Elspeth to join the Phyrexians, but, failing that, accepted her death instead, so he attacked. In the fray, Elspeth pummeled him with the hilt of her blade, knocking him unconscious. Ajani being healed from his phyresis As New Phyrexia's Invasion of the Multiverse began, Ajani executed the praetor Sheoldred , decapitating her on Elesh Norn's command. Norn then sent him to Theros to subvert its Gods , privately hoping to strike a blow against Elspeth Tirel . He planned to do this by changing the people's beliefs. He succeeded in compleating at least three of Theros's gods, including Heliod . After Kaya Cassir appeared on Theros and killed Heliod, Ajani faced off with her. As Zhalfir 's forces invaded New Phyrexia, Ajani returned, badly wounded, to fight against them and the involved planeswalkers, and later Jin-Gitaxias who had betrayed Norn. He was frozen solid and brought to Zhalfir after New Phyrexia was destroyed, and using a specialized magic ritual Teferi, Karn, and Melira restored his body and purified his Phyrexian enhancements. Ajani was one of few planeswalkers who retained their sparks in the aftermath of the Invasion . After his un-compleation, he traveled to invaded planes to learn the fate of the other compleated planeswalkers, finding only Nahiri . He implored her to help him right the wrongs Phyrexia had committed, but she rebuffed him, attacking him and destroying her own spark in the process. Sometime later, Ajani traveled to Kaladesh to talk to Chandra and thank her for saving some people on his plane from monsters. He tried to console her before having to leave the girl once more. Ajani was met by Chandra on Alara after her quest for self-discovery came to an end. Lending his ever-healing aid, he talked to her about the pain he felt after losing his brother. Thanks to his wisdom, Chandra decided to return to her mother and apologize to her. Together, they planeswalked to Kaladesh, only to appear in the Consul's trashed home before Tibalt, who had Chandra's mother bound beside him. Realizing that he couldn't compete with both Chandra and Ajani on their home turf, Tibalt fled to Innistrad . Chandra and Ajani followed in pursuit and managed to overpower him. Ajani uses an axe made by combining the head of his axe with the head of his brother Jazal 's axe. After his compleation, the axe was modified to resemble Elesh Norn's faceplate. After Elspeth's death, Ajani kept his friend's cloak as a way of honoring her. After becoming compleated, Ajani gave the cloak to Tezzeret. While technically part of his phyrexianized body, the compleated machinery includes a metallic muscle structure, a red artificial eye, and, according to some artwork, wires in his hair that may contain additional eyes. These were lost after he was reverted back to non-compleated. Associated cards: Depicted in: Quoted or referred to: The circlet that appears on Ajani's shoulder is the sigil of the Qasali Pride. Ajani's pride of Leonin warriors wears a painted scar over their eyes as a marker of their allegiance. Ajani's original incarnation during design was as a white-aligned paladin known as Theseus. Ajani's magic only works on others, so his planeswalker cards mostly heal and pump . While Ajani remained white and green aligned, he was a part of the black New Phyrexian faction under Sheoldred's command during the second Phyrexian Invasion of Dominaria . After his return to New Phyrexia, his loyalty shifted to the Mother of Machines. He often cited Elesh Norn's Argent Etchings and became the praetor's favored lieutenant and most ruthless and loyal of her evangels. Ajani is the primary focus of the teaser for Dominaria United the primary antagonist of the Phyrexian arc trailer and appears in the Magic SpellSlingers trailer. Wizards of the Coast (September 18, 2013). \" Ajani Goldmane \". magicthegathering.com . Wizards of the Coast. Doug Beyer (October 24, 2007). \" Planeswalkers Unmasked \". magicthegathering.com . Wizards of the Coast. Doug Beyer (October 29, 2008). \" Ajani: Faces of a Planeswalker \". magicthegathering.com . Wizards of the Coast. Brady Dommermuth , Doug Beyer , Jenna Helland et al. (October 8, 2008). \" Flight of the White Cat \". magicthegathering.com . Wizards of the Coast. Kelly Digges (April 9, 2014). \" Ajani, Mentor of Heroes \". magicthegathering.com . Wizards of the Coast. Magic Arcana (October 07, 2008). \" Hidden Ajani \". magicthegathering.com . Wizards of the Coast."}