{"text": "Akros ( AH-krohs ), inspired by Sparta , is a polis high in the Katachton Mountains, which serves as a shield between its holdings and the rest of Theros . The Akroans are half-mythical even within their own time. They are known to be the most feared warriors of Theros. They have lived and died by the spear in the name of countless kings, hardening their armies generation after generation by fostering a culture that revolves around perfecting the body and the mind for combat. Akros is associated with white and red mana. In the age of antiquity, the humans of the region that would one day become Meletis , the largest polis on Theros, were ruled by the archon tyrant Agnomakhos . Ephara inspired and equipped the human heroes Kynaios and Tiro to overthrow Agnomakhos. They founded the polis Meletis, established its legal code, and defended it for decades. After the fall of the archons, humans and minotaurs waged a bloody war in the highlands. From that bloodshed, Elektes and six other warriors, inspired by the martial doctrine of Iroas , established the polis of Akros, with Elektes as its first king. Centuries before the polis of Olantin sunk beneath the sea, its queen left her husband for the king of Akros. Slighted and heartbroken, the Olantian king summoned his whole host of loyal spears and sails to wage war on the fortified mountain polis. What followed was a siege that stretched on for decades. Whole parts of Akros were destroyed and rebuilt in the fighting. Some heroes knew only a life of conflict, performing feats of incredible prowess for the honor of Olantin, or who awed the gods with their sleepless commitment to\ndefending the gates of Akros. Most people today know of the event from an embellished account laid down in an epic poem, The Akroan War . Magic Origins key art Around 4543 AR , the young Akroan orphan Kytheon Iora joined a gang, of which he soon became the de facto leader by age thirteen. With high ideals, he led the other boys to start stealing from the mansions of the rich, taking only what they needed to survive and giving the rest away to the poor. He was eventually caught and found himself in prison. The prison warden, a man named Hixus , taught him Hieromancy, the magic of order. His teacher recognized something within him and began teaching Kytheon of planeswalkers, one of whom had been his teacher, and the man that had given him his sural. Kytheon toiled for four years in prison. When the Kolophon came under attack by harpies and cyclopes , Gideon's teacher freed the prisoners that were willing to defend the keep. Kytheon saved the day, leading his irregulars and using his newfound hieromancy. Afterward, he was championed by the God Heliod to defeat an even greater menace, the titan of the God Erebos . Using Heliod's spear and with the help of his troops, Kytheon accomplished this. Impelled by his hubris, he then threw the spear at Erebos himself. Erebos easily changed the course of the spear, killing all the irregulars. Shocked and shamed by their deaths at his hand, Kytheon then made his first planeswalk to Bant, where he became known as Gideon Jura. When the satyr planeswalker Xenagos returned to his birthplane, he found his old hedonistic lifestyle exceedingly dull and the gods to be a farce in which he was no longer willing to participate. His ambitions had evolved into a desire for outright godhood, to join or replace the pantheon of Theros, and so he gathered a massive force of minotaurs to besiege the city of Akros. Arriving at the city, the planeswalker Elspeth Tirel found that the minotaurs had constructed a giant wall to keep reinforcements out. Queen Cymede informed them that the Akroans had captured the satyr Xenagos and that he demanded to speak to Elspeth. Xenagos told Elspeth that he knew how they could destroy the army without ever battling. At his instructions, Cymede and Daxos worked together to raise the Deyda River in their attempt to flood the minotaur encampment. As Daxos began to lose concentration, Cymede offered herself to Keranos in exchange for his assistance. Keranos came forth and transformed the river into a raging elemental that consumed the minotaurs in their encampment. Afterward, Cymede was claimed by Keranos as she transformed into a pillar of fire and crimson light and ascended into Nyx . Meanwhile, King Anax went forth in combat against Rhordon the Rageblood, an oracle of Mogis . In their battle, Anax gained the upper hand, but as Keranos provided aid to Cymede , the God of Slaughter gave a boon to Rhordon. Elspeth declared treachery as she sensed Mogis's interference. The Rageblood quickly defeated Anax by impaling the king through the stomach. Elspeth stepped forward and saved Anax, but before Elspeth could declare victory, the Rageblood threw himself into the advancing river elemental of Keranos and was washed away. Although King Anax was gravely injured, he insisted that the victory celebration continues without him. The humans were victorious but at a terrible cost. After defeating a minotaur horde sent by Mogis, the god of slaughter, the Akroans and their allies held a great victory celebration. But their merriment was short-lived, as Xenagos used the occasion to stage the final ritual that propelled him to godhood. The other gods blamed the mortals for disrupting their supremacy, and they swore vengeance against human civilization. New Phyrexia begins the invasion of Theros at Akros. Led by a Phyrexian Ajani Goldmane , the first wave of the invasion targeted temples and other places of worship. Due to the nature of faith on Theros , compleating the gods' devotees meant that the gods themselves, influenced by their new Phyrexian worshippers, succumbed and became Phyrexians as well. With Meletis being oft-mentioned as the last bastion of Therosians, Akros is presumed to have fallen as a metropolis. The Kolophon. Concept art by Adam Paquette . Arable land is scattered across small plateaus and valleys in Akros, meaning that the serf communities that farm the land are small and just as scattered. Volcanic rifts, landslides, and venomous animals make travel dangerous for anyone who doesn't know the terrain, and visitors wishing to avoid suspicion from patrolling stratians would be wise to stick to the roads. Beyond the polis stretch craggy hills and mountains broken by narrow stretches of arable plains. It is a nearly impassable landscape, save for a few roads hewn through passes. Residents claim that only a fool would attempt to invade the heartlands of Akros, yet Akroans obsessively guard against invasion nonetheless. Beyond its thick walls, the streets of Akros are dotted with towering statues of heroes. Red-tiled roofs soar over square-topped sandstone columns, and holy sites dedicated to Iroas, Purphoros, and Keranos, among the other gods, are many. The architecture is formidable, spare, and militaristic, thick with sharp, angular shapes. Within the city of Akros: The Kolophon is a huge, many-tiered structure perched on a cliff, which drops into a deep canyon carved by the Deyda River. The central fortress and seat of Akroan power. At the innermost part of the Kolophon rests the hall of the Akroan king. Here, scouts and couriers give reports from outposts that stretch to the furthest reaches of the Akroan territories. Few have ever dared to attack the Kolophon, and no attack has ever breached its walls. The uppermost tier of the city, perched on a rocky outcropping at the southwestern corner of the Kolophon, is the great citadel. The Oromai (the \"watchers\" who maintain order and defend the Kolophon) are quartered within the citadel's imposing walls, and the monarch's palace is built atop it. Temples of Iroas, Heliod, and Keranos also adorn the top of the citadel, the latter commissioned by the late Queen Cymede, built with an open roof to give her a clear view of stormy skies. The Temple of Triumph at the heart of the walled city is the huge stadium that hosts Theros's greatest sporting event, the Iroan Games. A grand temple of Iroas stands beside it, serving as the venue for award ceremonies. A wide plaza connects the stadium to the city's outer gates, offering plenty of room for celebration around the annual games. When the stadium isn't hosting the actual Iroan Games, it is still used daily for training and lesser athletic events. Many of the buildings surrounding the stadium are dedicated to serving it: smaller training facilities, providers of athletic gear, stables, and other shops. The Colossus of Akros , an enormous golem of bronze and iron, overlooks the path leading to the polis of Akros. Though it is rarely called on to defend the polis, the sight of its towering form is enough to ease the minds of the populace. In truly desperate times, priests of Purphoros work their magic to call the colossus to life, whereupon the earth rumbles as it steps down from its twin plinths to place itself before the threat. Deathbellow Canyon . The Deyda River . The river next to which Akros is built. It has very high cliffs for banks and rough waters. It takes less than an hour to sail from the mouth of the Deyda to the Harbor of Meleltis. The Great River Road . A Road that runs along the Deyda out to sea. It is situated such that when heading towards the sea, the river is on one's left. It takes under two days to walk between the sea and Akros along the road. The Katachton Mountains , which serve as a shield between Akros and the rest of Theros The Court of Orestes , which lies along the Khystonos River. The Khystonos River , whose headwaters reside in the mountains. Visible from Akros, Mount Velus is an energetically active volcano. The fiery mountain serves as nothing less than Purphoros's home in the mortal world. While the volcano has only erupted a few times since Akros's founding, those minor catastrophes were enough to demonstrate that a major eruption might destroy the entire region. Akroans regularly leave offerings at the foot of the volcano, and rigorously dissuade travelers from venturing up to the sacred peak, hoping to avert the great explosion they fear is coming. While some adventurers have climbed to the volcano's caldera, met Purphoros, and lived, the god's anger isn't the only danger. A red dragon called Thraxes makes his home in the halls of Purphoros's first residence, which the god abandoned to create a larger and more ornate home deeper in the volcano. Purphoros's forge lies in the deepest part of Mount Velus, near a vast lava pool. The massive iron forge is surrounded by the finest ores, metals, and gems. Some of the greatest treasures Purphoros ever crafted are contained in the god's residence, a forge palace warded by an enormous, gilded iron door. Occasionally these doors crack open, admitting a curious anvil-wrought creature into the world or burst wide, unleashing some manifestation of Purphoros's fury. Mount Vesios , also known as the Little Sister, is a smaller volcano that resembles Mount Velus and erupts concurrently with Velus. A monastery on its western slope houses scholars and spellcasters who study the volcano, believing that through it, they might be able to control the eruptions of Mount Velus. Numerous oreads and Akroan flamespeakers offer their omens from the volcano's heights. The Pool of Lyth is a great rock outcropping that looks vaguely like a satyr's face. The stones weep a steady flow of water, which spreads into a serene, sky-blue pond. Said to grant visions of the drinker's greatest desires, the pond is filled with a poison of Pharika and guarded by harpies . Willows grow along the pond's shore. One-Eyed Pass . An Akroan pass that is known for its abundance of cyclopes , leading to the Ashlands. Akroan Stratians funnel their enemies into the pass, using the cyclopes who aggressively defend their territory as gauntlet of certain death. Pharagax Bridge . A huge stone bridge that is the only gateway to the polis from the west. Some claim that the massive chasm it spans leads to the Underworld and that foul creatures emerge from its depths. Stratians consider it a high honor to be assigned to guard the bridge. Shrine Peak , a mountain shrine to Keranos . The Titan's Stairs , stone \"stairs\" seemingly carved into the granite cliffs that protect Akros and haunted at all times by eerie, whistling winds, provide natural access to the polis. Stratians have guarded this strange formation for centuries and have used it as a staging ground for invading the lowlands. Tynthal , a city with a coliseum located nearby. There are a few temples in Akros dedicated to the major gods — mainly Purphoros and Iroas — but due to the Stratian duties of many Akroans, the major temples are located afield, in mountainous places. As the city's former ruler, Anax , began a turn from Iroas to Purphoros, the city itself saw a matching trend in art. Swords and armor are decorated. Pottery, clothing, wall paintings, and weaving show ancient Akroan patterns and symbolism handed down for generations. The Akroans believe that the gods are best worshiped at the places closest to Nyx — mountain peaks. Small temples and shrines are found throughout Akroan territory. Some are tucked in caves or nestled in crevices or canyons, while others are bare altars exposed to the elements. Prominent spellcasters, the flamespeakers are reclusive priests of Purphoros who revere nature spirits and who inhabit the volcanoes and cracks in the great mountains of Akros. The ancient practice is viewed as primitive but powerful, and Akroans of any background might risk making a pilgrimage into the mountains to be blessed by Flamespeakers or to receive a prophecy from them. During training, every Stratian is warned about the threat of Mogis , because during battle when the god can slip into the hearts of warriors, making them crave ever more blood and pain. Those who are overcome by such desires flee the polis to find enclaves of those who worship Mogis. Not all who worship the twisted god are cannibals, but all crave rage and bloodlust — and some, known as Androphages (man-eaters) do crave human flesh as the minotaurs do. Akroan arena. Concept art by Adam Paquette . Because of their warrior culture and discipline, the god Iroas favors the Akroans. The Iroan Games are held every year in the withering heat of the summer to weed out pretenders and to allow only the hardiest of athletes to prevail. Athletes and soldiers from all across Theros compete for the wreath that signifies the highest achievement in physical prowess. The Magic Creative Team (April 02, 2014). \" Planeswalker's Guide to Journey into Nyx \". magicthegathering.com . Wizards of the Coast. The central podium where athletes receive awards is also the main temple of Iroas. During the Iroan Games, everyone is welcome in the stadium. Satyrs flock to the city to witness the competition, and some take up permanent residence, celebrating the outcome of one year's games until it's time to start watching the next. File:AkroanConcepts2.jpg|Akroan soldiers. Concept art by Adam Paquette . Citizenship is limited to those whose parents were both citizens of the polis. Citizens of other poleis, and their children, aren't permitted to participate in the government of the polis. In Akros, citizens must meet one additional requirement: they must serve in the army. The majority of Akros's inhabitants aren't members of its martial elite. The famed warriors of Akros have the means to devote their lives to studying and training in the ways of war because they rest atop a rigid social structure of serfs and servants that largely dwell beyond the Kolophon's walls. At the apex of Akroan society is the lektoi , the large warrior class of Akros. Members of this class claim descent from the seven warriors who first established the Kolophon after the fall of the archons. Though the families now number more than seven, each one uses an animal associated with one of the seven warriors as its symbol, either the ram, lion, horse, boar, badger, bull, or hart. The ram, associated with Akros's first king, Elektes, is commonly used as a symbol for the lektoi as a whole and for Akroan strength, determination, and resilience. It is a popular theme in clothing, jewelry, and weapon ornamentation, and some lektoi even wear their hair braided into stylized ram horns. Although the lektoi claim descent from heroes, membership in this noble class isn't strictly hereditary. Anyone can earn a place among them by claiming a victory in the annual Iroan Games. More commonly, members of lektoi families lose their place of privilege if they fail to fulfill their obligation to serve in the Akroan military. The Akroan military is formed of wandering bands of warriors (drawn from the lektoi families) known as Stratians . They train relentlessly and possess unflinching resolve. These warrior bands are entirely self-sufficient, relying on hunting and plunder to feed their numbers and to train the young soldiers in the field. Their tasks are to search for monsters that have strayed into Akroan territory and to protect travelers. Stratian forces are divided into three types of duty and armed appropriately for the task before them: Alamon (wanderers) are the forces that are always on the move about the borders of the kingdom of Akros. They are armed and armored for speed and agility, allowing them to move stealthily and strike unexpectedly. The Alamon soldiers spend most of their time patrolling Akros's outlying areas, centering their patrols around scattered outposts. These serve as staging grounds for Alamon and Lukos units to prepare as they venture out to raid or guard against monsters and invaders. They are also the forces who find new domains for conquering. Lukos (wolves) are the heavily armored, elite Akroan forces called in after the Alamon have spotted a target and have begun attacking it in their guerrilla style of assault. The Lukos march in and take over the village, capturing slaves to haul plunder back to the Kolophon. Oromai (watchers) are the forces that never stray far from the Kolophon, protecting the fortress from invaders. The Oromai also keep the large population of serfs in check while the main part of the Akroan army is away for long periods. Akroan hoplite units include: Spears of lroas Iron Fangs Arrows of Anax The Unbroken Anvil of Purphoros Skewering Squad Shield of Akros Cymede's Heart Lektoi who complete their military service with honor often retire to the Kolophon or their family estates and go about the leisurely life of aristocrats. Their households are run by a class of servants made up of lektoi who were unable or unwilling to undertake a military career. These servants lack citizenship's full privileges but retain a position of some honor thanks to their class. Below these servants, at the bottom of Akros's social hierarchy, are the serfs. Comprising the vast majority of Akros's population, the serfs largely reside outside the protection of the Kolophon, laboring to grow the staple crops that support Akros's citizens and its trade. A relatively small number of serfs are skilled artisans who manage to build a more prosperous life for themselves with their crafts. But even these wealthier serfs can't own the land they live on, and they enjoy few rights or legal protections. Akros maintains a standoffish and often hostile stance toward its neighbors, particularly the minotaurs of Phoberos, the leonin of Oreskos, and the centaurs of the Pheres band. Members of those peoples rarely find a warm welcome in Akroan territory. However, Akroans respect prowess, loyalty, and self-sacrifice, and might welcome any who embody such virtues. Some stratians also seek to learn the martial practices of other peoples and might invite individuals or small communities to Akros to learn their ways. During the Iroan Games, everyone is welcome in the stadium. The Akroans revere the majesty of large dragons and fashion their helm crests to resemble a dragon's dorsal crest, believing that the creatures embody the drive for power and dominion. Akroans sometimes settle near a red dragon's lair, forging tenuous alliances by making sacrifices of cattle or prisoners to gain its favor and protection. Akros is ruled by a hereditary monarch who is advised by a council of elders elected by and from among the citizenry. Traditionally, the monarch was drawn from the lineage of lektoi. The monarchy passes from parent to eldest child, but any sibling or first cousin of the heir can challenge this succession and claim the throne by besting the heir in single combat. After King Anax 's death and Queen Cymede 's disappearance, the king's niece, Taranika , acts as regent. The return of Anax as a mindless demigod and champion of Purphoros and Cymede's ascension to Nyx and later compleation has complicated the succession significantly. Trade between Akros and Meletis is constant and productive. Caravans make the two-day journey between the poleis at least once a week, carrying fine Akroan metalwork and pottery to Meletis, and Meletian fabric, stonework, and fish northward. Both poleis mint coins of copper, silver, and gold, with the equivalent value. Setessa trades with the other poleis as well, but less extensively. Its Abora Market, just inside the city gates, is open to outsiders only on certain days, and Setessan merchants prefer to barter goods rather than accept the currency. Despite these restrictions, Setessan food, woodwork, and trained falcons are highly valued in the other poleis. Anax , former king of Akros, husband of Cymede , and later demigod and champion of Purphoros . Cymede , former queen of Akros and wife of Anax . Though she ascended to Nyx , she was later compleated during New Phyrexia's Invasion of the Multiverse . Elektes , first king of Akros. Gnostro , a chimera that inhabits the Katachton Mountains. Hixus , prison warden and mentor of Kytheon. Kytheon Iora , the white-aligned planeswalker later known as Gideon Jura. Taranika , the polis's regent. Tymaret , the Returned king of Odunos. Later chosen by Erebos as his demigod and champion. Referred to:"}