{"text": "Akroma was a sentient illusion , created by Ixidor on Dominaria in the image of his lost wife, Nivea , who was killed by Phage in her premier pit fight. After Ixidor had been abandoned in the desert because of his extreme gambling debts to the Cabal , he wallowed in his grief over his lost love. So strong was his heartache, that when his shaping abilities manifested, they took the form of Akroma at the cost of Ixidor's right arm. She was crafted in his dream and made of his flesh. Ixidor gave her but one objective, to avenge Nivea, no matter the cost. She flew forth from Locus seeking Phage. Almost immediately, Akroma made her way to Aphetto , where celebrations were taking place for the recent completion of the Grand Coliseum . In the arena itself, the pit fights were taking place with a spectacular match between Phage and her brother, the barbarian Kamahl . As the fight raged on, Akroma knew that her hopes of Phage dying in combat were coming to an end. Apparently, Kamahl would neither hurt nor kill his fallen sister in the hopes that she would see the error of her ways and return to her old self. Akroma was left with no choice but to kill Phage with her own hands. The bright cheers of the crowds fell silent as Akroma alighted in the sands of the arena, and Phage at once received a taste of her own medicine, as Akroma's touch acted as anathema to her. Unfortunately, Kamahl interfered, and Akroma had to flee, grievously wounded, and maimed as her legs fell victim to Phage's touch. Akroma returned to Ixidor, weeping in immense pain. Ixidor forgave her for what she saw as her failure and decided to not only heal her but to enhance her. However, they would first need a being to serve as her new legs. Ixidor found the perfect answer and used his powers to dream a jaguar into existence which he killed immediately. Ixidor imagined Akroma full and healthy, and as he opened his eyes, Akroma's legs were replaced by those of the jaguar. She became, in effect, a centaur -angel and was filled with a new strength, as well as certain other feline tendencies. As she became accustomed to her new form, Ixidor told her that war would be inevitable, and true to his prediction, a dual force of the Cabal and the Krosan forest was marching upon Ixidor's lands. Ixidor began to create as many beings as possible, and Akroma led them into battle against the combined forces. The battle ripped the lands apart but Akroma's forces appeared to be winning. That is, at least until they encountered Phage. All at once, the tides of battle turned as every being that Phage had ever killed was reincarnated as deathwurms which burst forth from Phage's body. When every wurm had left, she became Jeska once again. The last deathwurm, the soul of Nivea, sought out Ixidor, swallowed him, and escaped as Akroma watched helplessly. To prevent the wurms from destroying the very fabric of the world, Jeska absorbed all the darkness back into her, all but the one that had taken Ixidor. Akroma, Angel of Fury by Daren Bader Left without a leader, Akroma assumed the responsibilities of spreading Ixidor's message, effectively founding a religion around him. Using her angelic and heavenly appearance, she turned the natives of the surrounding plains to her cause. Thousands joined her side through her promises of hope and honor. Though she was pleased with the developments in Locus, Akroma still bore her rage against the Cabal and Phage. Weeks later, she received a very interesting message. Apparently, some of the survivors of the Nightmare War had found a city in central Otaria. They'd begun to inhabit it, naming it \" Sanctum \". Led by Zagorka , the Sanctum had been receiving numerous citizens over the past months. One of these refugees was her hated nemesis Phage, who to all appearances had denounced the Cabal. However, Akroma was not fooled by her ruse. As she had learned from Braids earlier, The Patriarch had intended to use Phage as a vessel to conceive his god Kuberr in human form. Armed with the knowledge, she flew to the Sanctum in order to confront Phage. Upon her arrival, things were not as she expected. As her rival came onto the battlements, Akroma was somewhat amazed that Phage claimed that this would not be a war of swords but a war of words. In some confusion she returned to Locus, only to discover an assassination attempt by Stonebrow , one of Kamahl's former generals. However, before he could strike Akroma, one of Ixidor's creatures converted him to her cause. Under Stonebrow's guidance, she invited a host of distant nobles to dine with her in hopes of winning them to her side in her holy war against Phage. Stonebrow was made a humble servant for the occasion and all seemed to be going well, despite Akroma's awkwardness. Just as everything seemed to be going to plan, her chief advisor told her that the guest's shoes had disappeared. As she went to investigate, she noticed a portal where their shoes had been. The portal led to the deathwurm who had escaped, and without a second thought, she jumped into the portal to confront her master. She raged against the wurm, demanding it to release her creator, but the wurm was simply too large and her attacks too weak. In one mighty gulp, the wurm swallowed Akroma. The angel found this suited her for the moment and began to search the wurm's vast digestive tract. The acid ate away at her flesh, destroying her feet and wings, but still, she persevered onward. After a long and tiresome search, Akroma finally found the crouched form of Ixidor with the glimmering form of the woman whose resemblance she bore. She tried to converse with Ixidor but it was no use. He wallowed in grief and wished to remain with the spirit of his dear Nivea. Akroma obliged to his wishes and she departed. Months soon passed and Akroma's spies had reported that strange events were happening in the Sanctum. With her healing process complete and blades replacing her feet , Akroma began the move into the Sanctum with her army, which consisted of the Southern Order and various other nations that joined her cause. If attacked, the Sanctum was not going to last the week. Within days, she arrived and she was surprised that the glyphs and statues she had seen before had become sentient and welcomed her arrival. Upon closer inspection, the glyphs directed her to a dome in the middle of the city. Eventually, she made it onto the top of the dome, and there, her rival, Phage, confronted her. The two enemies spent little time conversing and before long, a fight broke out, with the two women trading blows with one another. As the fight intensified, Akroma saw the hulking form of Kamahl wielding the Soul Reaper . Just as Kamahl swung his axe at them, Akroma noticed the form of Zagorka jumping from one of the surrounding towers into the dome. The Soul Reaper sliced through all three women, killing them almost instantaneously. As the explosion that was triggered by the impact engulfed her body in a blinding light, Akroma finally died in peace, knowing that Ixidor had been avenged at last. As she died, a new goddess rose. Karona had been born. An alternate reality version of Akroma appeared in the set Planar Chaos . The alternate Akroma is a being composed of red magic, as opposed to white brought about from her creator, Ixidor, was black in this reality, rather than blue. She was made without Ixidor's sacrifice of his arm, and bears an alternate title matching her personality: Akroma, Angel of Fury . Associated cards: Depicted in: Quoted or referred to:"}