{"text": "Angel is a creature type used for humanoid beings with large, sometimes feathered, wings on their backs. Often worshiped as divine beings, angels are manifestations of predominantly white mana (the original description of Serra angels imply that their bodies are constructs inhabited by holy spirits ), though some have been corrupted with black mana, and angels from various planes have boasted traits from each of the other colors. Almost all known angels are female, intentionally so, though Amonkhet 's appear to be male and male angels also exist in Kaldheim and in Capenna . They have the capacity for interplanar telepathic communication of sorts, though the only instance of this was regarding the Phyrexian threat. Angels can produce the magical salve known as halo ; while this abilitiy originated with Capennan angels, it spread throughout the multiverse when New Phyrexia's Invasion of the Multiverse connected the planes. The first creature to bear the type was Serra Angel from Alpha . Angel is the iconic creature for the color white. While angels are normally confined to specific Shards of the sundered plane, the Conflux has led to the creation of Maelstrom Archangels that wield the power of all five kinds of mana. In the Shard of Alara called Bant , there are angels who are thought to be ultimate representations of its society's ideals. Though they’re mortal, angels are not born the way humans are.  Long ago, a council of archmages put a complex enchantment on Bant, allowing mortals who died on the shard to reform as angels. As long as any mortal conformed tightly to Bant's ideals, the light of their soul would transubstantiate into an angelic state. Once a soul has transcended, an angel's body is comprised of \"meta-sigils,\" the physical manifestations of world-magic drawn from the essence of the land and sky. Angels embody the largest ideals, such as justice and truth. But they also embody the smallest concepts of beauty and perfection that many of the grounded races take for granted: the path of a crystalline stream flowing through a meadow, or the windswept silhouette of a tree against the dusky sky. The most revered angel in Bant history was named Asha . History tells that she sacrificed herself to defeat the half- demon /half- dragon abomination Malfegor (though in reality, she simply banished him to the Shard of Grixis ). Though she has been gone for many years, she left a powerful sigil that, until the Conflux , maintained safety and peace among her people. The faithful still pray to Asha, and some believe that she still might someday return. Angels gather at the Cathedral of Bliss, a vast temple of glowing marble and light that floats in the sky above Bant — higher than even the aven can fly. Bantian angels lend guidance to other mortals, but otherwise, they do not directly interfere with their lives. Some Mortar-caste believe Bant 's aven are related to the angels , and the aven themselves believe they are creations of the angels, though no angel confirms this. Among angels, there is a hierarchy with four different ranks: The Asura are the highest-ranked angels. There are only seven of them, which make up the Court of Orderly Contemplation . The Amesha represent the ideals that inspire Bant's knightly orders: honor, justice, truth, and courtly love. The Mahra , the angelic bureaucracy responsible for carrying out the orders of the Asura and the Amesha. Celebrants , as the lowest ranking angels, are responsible for protecting the day-to-day lives and ideals of mortals. Asura [ | ] The Asura are the highest-ranked angels. There are only seven of them, which make up the Court of Orderly Contemplation . Only one has been revealed via the cards, Jenara who is the Asura of War. Amesha [ | ] The Amesha represent ideals, such as honor or justice. Mahra [ | ] The Mahra carry out the orders of the Asura and the Amesha. Celebrant [ | ] Celebrants, as the lowest ranking angels, are responsible for protecting the lives and ideals of mortals. Following the Conflux , some Angels have accepted Etherium parts, becoming Filigree Angels . They have pledged themselves to the Noble Work of infusing all life with Etherium. Amonkhet is a rarity, a world with male angels. Whatever their original forms might have been, they have been twisted into distorted reflections of Nicol Bolas . Their limbs are long and thin, with elongated shins and forearms. Their huge wings are adorned with white and black feathers. Light shines through their joints and chests as if from an internal fire, and their eyes glow with a gold or orange light. They can be embalmed into zombies . Bolas's angels are his personal agents during his absence from Amonkhet. Their mission, which they pursue with unwavering devotion, is to keep Naktamun free of dissenting voices. They seemingly act as servants of the gods and bind dissenters in special sarcophagi, called Tombs of Disgrace, which leave the prisoners’ hands exposed. The sarcophagi line the streets of Naktamun for all to look upon in what is known as a Display of Doubt. When the display concludes, the angels carry the dissenters through the Hekma and into the desert beyond where they are left to be consumed by the Curse of Wandering. In the Hour of Devastation their true loyalty with the God-Pharaoh came to light, as they joined his hordes in laying waste to the plane. On Arcavios, angels are seemingly artificial in nature and are found among the ruins of the plane. On the plane of Capenna , angels seem to be born of mortals, rather than beings of pure mana. They cooperated with demons to stave off a Phyrexian incursion, creating the city of New Capenna . However, after its completion the demons betrayed the angels, imprisoning them in stone and leeching halo from their bodies. Giada was revealed to be the last free angel. The people of the plane still worshipped the angels devotedly, hoping they would save them from the demons and halo shortage. After the events of Streets of New Capenna , the Angels began waking up from their stasis. Some of them are male. They span all five colors of mana, although they are still most strongly associated with white. During New Phyrexia's Invasion of the Multiverse , the angels helped repelling Atraxa's invasion of Capenna and then went to various other invaded planes to bring their help and Halo to those in need. Finishing the fight on New Phyrexia, those that traveled to the plane could not return after its multiversal switch. Copper-Leaf Angels were artificial angels created by Latulla to aid in the Keldon war effort against Jamuraa . However, they did not play a significant role in the Keldon invasion and likely fell into disuse following their creator's downfall. Duler angels were created by the Sages of Lat-Nam and were inspired by legends about Serra angels. They were created by mutating humans , giving them wings. As such, the Duler Angels are both male and female, are naturally born and can grow old. Their purpose was to guard the School of Lat-Nam and its secrets. Fallen Angels were Serra angels, crowned with a Horned Halo , who were under the command of an Angel Keeper . Fallen angels tended to require sacrifices to remain strong. These were very powerful creatures, used by wizards as a means to gain more power. According to a Dominarian fable, an angel who dies as a fallen angel dies forever. The most famous fallen angel was Trine , while Selenia was one of the most influential in the narrative. Another was controlled by the wizard Dreygar in the western Domains . Angels who were summoned and bound to carry out acts against their nature lost their celestial nature and became material beings. Unlike other angels, they have dull feathers and highly predatory features. This process takes some time to happen, but with each act, they fall further from what they once were. The Valkyrie of the Ice Age escorted dead warriors to the Halls of Valor in the afterlife. Sometimes they raised them to fight and die again instead. On Fiora , angels are acting as magisters. Innistrad's angels were born from a shared essence in the \"dawn times\" of that plane, and the leaders of its four flights considered each other sisters. Much later, roughly 3560 AR , Sorin Markov created the archangel Avacyn to maintain an equilibrium between humans and the monsters that preyed on them. Innistrad's native angels were unable to sense Avacyn as they did each other, but followed her out of respect for her power and confidence. Led by Gisela , these angels were associated with the sun. Once a year, during the Harvest Moon season, the sun will not dip below the horizon for two full days. Known as the Feast of Goldnight, this is the holiest day for the humans. These were the most battle oriented among the flights, also overseeing the training of cathars . They sided with Avacyn in turning against humanity. Led by Bruna , these angels personified the Blessed Sleep , and were associated with the Hunter's Moon season. They created and mantained the magical wards that protected cities and holy sites and prevented the desecration of dead humans. They too sided with Avacyn and turned en masse against humanity. Led by Sigarda , these angels symbolized birth, rebirth and purity, and were associated with the New Moon season. Their magic is said to ward humans against harm in life (as opposed to the Alabaster host, which wards against harm in death). They were the only flight to side with humanity against Avacyn, avoiding corruption. One thousand years ago, these angels were led by Liesa . They associated with monsters such as vampires , witches , devils and even demons , ostensibly learning about them in order to defeat them more handily, which made them distrusted and disliked by other angels. Liesa eventually crossed the line by forming an alliance with a demon lord, earning the condemnation of her sisters and Avacyn, who declared her a heretic and destroyed the entire flight, forbidding the very mention of her name ever since. A new flight created after Avacyn's descent into madness due to her corruption by Emrakul . These angels wield a spear made from a shard of the Helvault , and serve as Avacyn's honor guard, aiding her in her genocidal rampage against humanity. After Avacyn's death at the hands of her creator Sorin , Emrakul successfully entered Innistrad and began corrupting the remaining angels into horrific abominations, forming the \"Flight of Nightmares\" led by Brisela , the twisted amalgamation of the broken bodies and minds of Bruna and Gisela that served as Emrakul's messenger. Ixalan's angels live underneath the world's surface, protecting the plane's core . Their design is based on the resplendent quetzal , the national animal of senior art director Ovidio Cartagena 's home country of Guatemala . In Kaldheim angels are known as valkyries and dwell in the realm of Starnheim , where fallen heroes rest. Older than the Skoti, the Valkyries do not serve the gods . They were formed at the beginning of time, and they do not allow their judgment to be clouded by the banal relationships, family ties, and petty squabbling that practically define the nature of the gods. This judgment is their primary purpose, though sagas describe how they occasionally enter into battle themselves for a worthy cause. Valkyries carry out their missions of judgment in pairs, with a white-aligned Shepherd and a black-aligned Reaper traveling together. Both Valkyries in a pair must agree on each fallen warrior 's fate before it can be enacted. Usually, these judgments are straightforward and there is no disagreement—both sides desire a fair fate and care little for \"winning\" a particular soul. But occasionally, a shepherd must keep a reaper from killing a coward too quickly if the shepherd thinks the person still has a chance at redemption through a courageous act later. Some sagas describe the Valkyries joining forces with the gods in some worthy battle, perhaps to slaughter a rampaging Cosmos monster, but rare indeed are the circumstances that draw Valkyries into the heat of battle. On rare occasions, Valkyries judge an entire village or clan unworthy to live, and shepherds and reapers descend together to send the whole cowardly population to Istfell . On the other hand, Valkyries readily fly to battle against demons . Demons are abhorrently unworthy by their nature, and demons who escape from Immersturm are a threat and must be dealt with speedily. Shepherds and reapers quickly join forces to kill a demon or force it back to its home realm. Mortals can't see a Valkyrie unless they wish to be seen. White-aligned Valkyries are shepherds of the worthy dead. If someone dies with courage and honor—whether in battle or not—a shepherd appears to lead them up to Starnheim and offer them a seat in the Hall of the Valkyries. Black-aligned Valkyries are reapers of the cowardly. While a shepherd will wait for the death of a worthy person, reapers intervene when they witness cowardly deeds. Often, they will simply smite the coward and escort them to the Gates of Istfell , branding them with a rune that announces their shame to all. The angels of Kaladesh are brightly coloured, four-armed entities with ornate wings. All seen angels wear a metallic, heavily ornated headpiece that obscures their eyes. They are artificial creations by inventors, considered \"perfect\" and at times even part of a \"Great Design\", and for this reason they are thought to be immune to the final stages of the Aether Cycle . Irreligious as the plane is, Kaladesh angels are not worshipped and as such do not answer prayers. They are solitary, interacting with each other in esoteric rituals. Aloof and mysterious, Angels were rarely seen on Mirrodin. Sometimes, a Platinum Angel could be seen battling against Reiver Demon over the dominance of mirran skies.  \nRevered by the Auriok , these Angels were primarily aligned with the Bringer . In the war against the growing influence of Phyrexia, numerous angels fought and died to halt the corruption. Several of these were captured and forcefully compleated . While multiple of these corrupted angels serves the Machine Orthodoxy, Elesh Norn has on one occasion cooperated with the other Praetors to create a particular powerful servant of New Phyrexia. One such angel is Atraxa , the Praetor's Voice, who had saved hundreds of humans from corruption before attracting Elesh Norn's retribution. Like all life on the plane, its Angels had metallic parts, particularly the wings. By the time of the New Phyrexians' invasion of Dominaria, Elesh Norn had a personal honor guard of compleated angels at her disposal. Within the Boros , angels are considered to be incarnations of the spirit of justice and revenge. They are considered to be the top members of the guild, whose parun Razia is an angel herself. Razia created all other Boros angels as clones, reflections, or copies of herself. They all lived in the floating hall called the Parhelion . Boros angels possess no need to drink, eat, or sleep, but can if it so pleases them. They have enhanced strength, a strong sense of duty and morality, and are supposedly incapable of lying. Boros angels can hear people calling their names from anywhere in Ravnica . The only surviving first-generation angel is Feather , who became the Guildmaster after Razia's death. Following in her progenitor's footsteps, Feather created a new lineage of angels. Feather was later replaced by one of these Angels, Aurelia , who argued that a disgraced angel can't command authority or respect. They have only two wings, unlike the original generation which had four wings. The angels of the Orzhov Syndicate are those that are dissatisfied with the way the Legion works. If an angel begins to doubt the purity of her mission and her doubts are allowed to fester into cynicism, the Church of Deals is always ready to welcome them, luring them with status, respect and power. Orzhov angels are empty voids whose only fulfillment comes from the performance of duty. They may act as executioners, commanders or pontiffs, but more often tend to carve out their own unique roles in the guild. They act without mercy, and appear only on special occasions such as high ceremonies, where they inspire awe and fear in onlookers. In the wake of Aurelia's leadership and her assaults on parts of the Ravnican population that she deemed complicit in crimes, several angels left the Boros and dedicated themselves to the protection of the guildless . There are three types of Serra Angels . All three are named after the planeswalker Serra . First, there are the souls of brave warriors who rise in the form of angels, divine creatures of pure mana (though they can also conjure bodies). Even if defeated in battle, they can't be truly killed, and their souls rise again. Interestingly, goblins have used Serra Angel skulls to make their war drums . These angels played an important role in the rebellion of Epityr against Sheoltun . The second type was brought into being by Serra on her own artificial plane, Serra's Realm , to populate her world. Their society was peaceful and harmonious until the arrival of Urza Planeswalker and the Phyrexians , the latter of whom brought with them black mana that corrupted the realm, drove away Serra and led to Radiant 's coup. The Phyrexian attacks against Serra's Realm also accelerated the plane's collapse, but Urza was able to evacuate some of the angels to Dominaria , where many still exist. The third type is created in answer to the prayers of mortals. Famous Serra Angels include Radiant , Selenia , Reya Dawnbringer and Tiana . Like the angels of many planes, the angels of Zendikar are created, not born. Manifestations of pure white mana, they both embody virtue and defend it to the death. The angels were among the first creatures that attempted to mount a resistance against the first stirring of the Eldrazi but were easily defeated. Because of this, they wear their halos down over their eyes, symbolizing their blindness to the Eldrazi's atrocities and their powerlessness to aid their world. Over time the angels' forced aloofness was incorporated into the world's religions. The \"deity\" Emeria , for example, was conceptualized as a great angelic being, an impartial refuge in a dangerous world—her halo a sign of hope, not of separation. Though most of the plane's memory of the Eldrazi faded over time, a select few greater archangels were powerful enough to resist the Eldrazi's reign and maintain their sight, their loyalty to the downtrodden, and their ability for voluntary action. Iona was one of these angels. When the Eldrazi titans and their broods were released again, the halos of oppression shattered and the angels were given the opportunity to redeem themselves. The angels fought, and mostly, they died. Opal Archangel is an enchantment that can become a 5/5 white Angel creature with flying and vigilance. Similarly, Answered Prayers can become a 3/3 Angel creature with flying."}