{"text": "Angrath is a Minotaur planeswalker of unknown origin. On the plane of Ixalan he was known as Captain Angrath for fourteen years. Angrath has a large stocky posture and a bull 's head. In battle, he wields fiery chain whips, and his body exudes extreme heat. He is driven by a feeling of restless impatience, like a caged animal awaiting its moment of freedom. This fuels his wild temper and spurs him on in an endless series of raids. His magic matches his temper, inflaming tensions among his enemies and turning them against each other. Huatli considers him aggressive, rude, and insulting. A skilled blacksmith and terrifying warrior, there is little that can stand against the minotaur's mighty blows. Once his trust and respect have been earned, he is an implacable ally, but if crossed, his rage burns as hot as his forge. Angrath is centered in both black and red mana. When creating spells, his hands become superheated, and his chain bursts into flames. When he planeswalks he disappears in a burst of flame. Captain Angrath. Angrath lived for fourteen years on Ixalan. After he got trapped by Ixalan's Binding , he found a place for himself when Captain Radcliff of the notorious Devil's Smile offered him a place in his crew. Welcomed among the other misfits and rogues of a particularly motley crew, Angrath put his physical and magical talents to good use in Captain Radcliff's raiding and pillaging. Soon it was clear that the rest of the crew loved and respected Angrath more than their captain, and the minotaur led a quick and almost bloodless mutiny that left Radcliff hanging by a gaff hook strapped to the bowsprit. Now-Captain Angrath changed the ship's name to Devil's Chains to reflect the magic of his searing-hot chains, and the crew's notoriety increased exponentially. At first glance, he seems to care more about mayhem than about treasure . In truth, he is searching for the Immortal Sun in the hope it can free him. He recognized Huatli as a fellow planeswalker and offered her assistance in leaving the plane in exchange for help, but at first, she attacked him and fled. In the race for Orazca he caught up with her again. Angrath's Fury The unlikely pair joined together to find a way to reach the city. Angrath was dismissive of Huatli's intentions to serve her emperor in finding the Immortal Sun . Telling her that the highest title of the Sun Empire did not mean freedom, while comparing her to an ant that tried to climb on the top of her anthill, declaring all of their struggles over the city as petty and short-sighted over who would define truth. As they came near the city, Angrath tried to planeswalk to Kaldheim and deduced from the length of his suspension that whatever blocked them from leaving this plane must have been near. He told Huatli that true freedom started when one realized that one was trapped. On a question about where he wanted to go first, he answered that he wanted to see his daughters. When they came near the city, they found a tomb erected later. In it, they discovered Saint Elenda , the progenitor of the vampires of the Legion of Dusk . Angrath had little care for her, instead deciding to hurry Huatli on. When she refused, he angrily struck at her and went on alone. Huatli reacted by sending a Dinosaur to trample him in the mud. Because he had to dispose of the dinosaur, Angrath was late in joining the scramble for the Immortal Sun in Orazca's Tower of Triumph. After the Immortal Sun was taken, Angrath vanished, cursing Ixalan in his passing words. He then reunited, teary-eyed, with his daughters at their family's smithy. The wanderlust of a planeswalker is hard to deny, and with his daughters safe, Angrath finds himself exploring the multiverse once more. Angrath's Rampage Angrath's happiness was short-lived: he was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . Due to his ability to use controlling magic, he could temporarily pull Eternals to his side during the fight, allowing him to amass a miniature army. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. Huatli encountered Angrath at the meeting and mocked him for getting trapped by the Immortal Sun again. At Jace 's recommendation, they decided to split up into teams to focus on specific tasks. Gideon , Aurelia , Angrath, and Huatli led a massive force of planeswalkers and Boros, Izzet, and Simic troops into battle against the God -Eternal Rhonas , who was leading a battalion of Eternals to destroy the gathered opposition. Gideon and Aurelia led the aerial units, while Angrath led the ground units. Huatli was suspicious of Angrath, keeping an eye on him to make sure he didn't betray the others, yet she also went out of her way to protect him. After Gideon killed Rhonas, Angrath was able to lead a successful charge against the remaining Eternals, forcing Bolas' forces to retreat to the dragon's citadel. Despite his initial frustration with being trapped again, Angrath was one of the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. Angrath survived the battle and was present during the Planewide Celebration that followed. When the planeswalkers discussed what to do with the Immortal Sun, Angrath wanted to destroy it because of how it trapped him twice, but was vetoed by the idea that it could help capture the planeswalkers who assisted Bolas. He also had a brief conversation with Teyo , telling the boy not to pity the dead – for their suffering is over – but rather to pity the loved ones they left behind. The R&D Narrative Team has stated that on his home plane, Angrath was a blacksmith, a family man, and had two daughters, Rumi and Jamira. Upon his spark 's ignition , he brought them presents from his planeswalking travels. Eventually, he became trapped in Ixalan, hence his desire to return home. The two daughters were later confirmed in the official storyline. Angrath previously has been on a plane that had dragons. Also, in the novel, he recognized Arlinn Kord's werewolf nature, implying that he visited either Innistrad or another plane that has werewolves. Kaldheim is not Angrath's homeplane, it just happened to be metaphysically near Ixalan so that he could conveniently show it to Huatli. Mark Rosewater has clarified that the presence of amass on Angrath, Captain of Chaos is meant to represent him using his magic to control Eternals rather than any sort of alliance with Nicol Bolas. Associated cards: Depicted in: Quoted or referred to:"}