{"text": "Anowon is the scion of a powerful vampire family from Malakir on Zendikar . Anowon is an expert on ruins, runes, and ancient languages. In his relentless search for answers, he has left a trail of corpses from Tazeem to Akoum . In settlements around Zendikar, Anowon disguised his vampire heritage and earned a reputation as a renowned mage and benevolent scholar who led expeditions from his base camp in the mountains of Akoum. With the help of his followers, he cultivated an image of himself as an expert in ruins and arcane languages — the man to go to for strange relics and hard questions. However, others speak of Anowon's treachery. Many call him a thief and a murderer. In Malakir, vampires believe that Anowon is a ruthless power-seeker, yet they view him with grudging respect. During his early years, Anowon was \"first son\" of the House Ghet , under the tutelage of Bloodchief Tenihas. The exact method of his \"birth\" is not recorded, but Anowon viewed Tenihas as a father figure and the bloodchief seemed to hold his young heir in high regard. By all accounts, Anowon was fascinated with Tenihas's extensive library, particularly ancient texts that allude to the enslavement of vampires by \"famished gods\". It was this mystery that created animosity between Anowon and Tenihas, who didn't want his young protégé to unearth things better left buried in the past. One night, Tenihas was brutally murdered in his bedroom—his retinue slaughtered, and his treasure stores plundered. The only surviving witness swore that Anowon had killed his bloodchief in a fit of rage and then vanished. Anowon didn't return to his homeland for many decades, and in the intervening years, the legend of the killing of Tenihas grew to almost mythic proportions. Anowon spent the next decades as a sell-sword, honing his skills as a mage and warrior during dangerous expeditions. He then pledged his loyalty to Bala Ged Expeditionary House for a brief period. While hiring himself out to expeditions, he deciphered archaic language variants, inked hundreds of rune-scrolls, and collected hundreds of relics. Although the circumstances are lost to memory, it was during one of these expeditions that Anowon acquired a powerful scroll now known as the Dragon's Fire. Almost immediately afterward, Anowon renounced his loyalty to the expeditionary house and disappeared from Bala Ged. A few years later, a young man calling himself Kejahar appeared at the Lighthouse in Sea Gate. He impressed the resident scholars with his magecraft and knowledge of the ancient world. He also possessed several powerful relics, which intensified the scholars' curiosity about the mysterious stranger. Based on several descriptions of the man, it's certain that this was Anowon in disguise. He soon ingratiated himself with the Lighthouse community. He traveled extensively with merfolk expeditions and spent untold hours in the Lighthouse Library, the largest collection of writings in Zendikar. During this time Anowon made a connection between the Eye of Ugin and the secret past of the vampires that Tenihas had so carefully protected.\nDespite having to deny his true nature as a vampire, this may have been one of the happiest times in Anowon's life. There are no indications of murders or thefts, and it seems that Anowon was genuinely seeking knowledge without dark motives. Then a young kor woman was killed and dumped in an alley near the Lighthouse. She was acquainted with Anowon, and he was blamed for her murder. During the interrogation by the militia, Anowon's true nature as a vampire was revealed. The townsfolk beat Anowon nearly to death and dumped his body over the seawall. How he survived the dizzying fall into the Halimar is not known. His near-death experience at Sea Gate was a turning point in Anowon's life. From then on, he stole and killed indiscriminately to accomplish his goals. Anowon now sought the Eye of the Ugin with a singularity of purpose. Yet, again and again, his quarry eluded him. From his base camp in Akoum, he gathered a rabble around him, searching endlessly for the eye and secretly killing anyone who got in his way. His widespread reputation as a ruin sage proved especially useful as adventurers would come to him for help and answers and he used their relics and knowledge to further his quest for the Eye. Anowon guides Chandra to the Eye of Ugin. One day, the young planeswalker Chandra Nalaar appeared in his camp, asking for Anowon's guidance. He refused until he discovered that she was also searching for the Eye of Ugin, claiming to have memorized a map for the Eye. He then agreed and they set off. He soon discovered that Nalaar actually possessed a physical map and so tried to kill her. At that moment, Sarkhan Vol appeared—knocking Anowon out. He awoke later in a crazed state. Jace Beleren , who was in pursuit of Chandra Nalaar, soon found the vampire feeding off his guide. Anowon attacked Jace, but the mind mage disabled him and read his mind, afterward persuading the vampire to lead him to the Eye. When the Brood Lineage were released, they found Anowon near the Eye and enslaved him like all other vampires they encounter. For three months he obeyed the Eldrazi 's orders, until he was freed by Sorin Markov and Nissa Revane on the outskirts of Turntimber forest. He then accompanied the two planeswalkers to the Eye of Ugin, studying everything around him and imparting knowledge about the history of Zendikar. When Nissa freed the Eldrazi Titans they fled together to Affa where they parted ways. Anowon was later seen stalking Nissa during the Eldrazi's destruction of Zendikar. After the destruction of Bala Ged by Ulamog , an unnamed vampire arrived to meet Nissa. The Malakir vampire informed her that Anowon had taught him all about Nissa and planeswalkers and that she was the final hope to preserve Zendikar's legacy. The seeds were for Zendikar's most prominent native plants: Kolya, red mangrove, jaddi, and bloodbriar. The last of which was extinct on the plane due to the destruction of Bala Ged. The vampire beseeched her to take the seeds and plant them on another plane. By doing so she will carry with her the last legacy of their home plane. Before the vampire left he also informed her that Anowon had been missing for some time. Anowon, the Ruin Thief In the period after the defeat of the Eldrazi, Anowon's fortunes, and his reputation, have been in steady decline. Numerous adventurers have made claims that he stole the credit for their expeditions and discoveries, not to mention stealing some of the precious finds they uncovered. With the rise of the ancient Kor Skyclaves , Anowon has dedicated himself with renewed purpose to deciphering the secrets of this lost civilization . . . and rebuilding his power and prestige. He found a new home with three adventurers whom he had joined to research the Ondu Skyclave and to eliminate the Hydra Grakmaw . Quoted or referred to: Anowon is a connoisseur of cheeses especially those made by the Kor . (The Teeth of Akoum)"}