{"text": "The Apocalypse Chime was a massively powerful artifact owned by the Tolgath . The master of Ravi gave it to her, telling her to use it in only the most sinister of times and promising her it would cleanse the world. However, her master didn't tell everything, because nobody who would have known the effects of the chime would have rung it. As the Tolgath and the Ancients fought the Great War on Ulgrotha , Ravi, hoping to stop the killing, rang the chime and destroyed both parties, resulting in the Great Destruction that formed the Dead Zone by disrupting the world's mana channels and killing almost all creatures on the plane. As instructed, Ravi hid in a magical coffin, in the Basalt Spire , to escape the effects of the Chime; however, her master never told the girl how to open the coffin. Trapped, Ravi lay in stasis, awake, unable to dream, aware of every second for centuries. Her spirit was rapidly broken, and claustrophobia set in, with madness following. After centuries, Baron Sengir found and freed her. Now called Grandmother Sengir, she still had the Apocalypse Chime when Serra and Feroz visited Castle Sengir . In her madness, she seems to have forgotten the effect of the chime, and seems to ominously contemplate the possibility to ring it again. The card is one of the three expansion hosers and has its own rules section. From the Comprehensive Rules (September 1, 2023— Wilds of Eldraine ) 206.3c One card (Apocalypse Chime) refers to permanents with a name originally printed in the Homelands™ expansion. Those names are Abbey Gargoyles; Abbey Matron; Aether Storm; Aliban’s Tower; Ambush; Ambush Party; Anaba Ancestor; Anaba Bodyguard; Anaba Shaman; Anaba Spirit Crafter; An-Havva Constable; An-Havva Inn; An-Havva Township; An-Zerrin Ruins; Apocalypse Chime; Autumn Willow; Aysen Abbey; Aysen Bureaucrats; Aysen Crusader; Aysen Highway; Baki’s Curse; Baron Sengir; Beast Walkers; Black Carriage; Broken Visage; Carapace; Castle Sengir; Cemetery Gate; Chain Stasis; Chandler; Clockwork Gnomes; Clockwork Steed; Clockwork Swarm; Coral Reef; Dark Maze; Daughter of Autumn; Death Speakers; Didgeridoo; Drudge Spell; Dry Spell; Dwarven Pony; Dwarven Sea Clan; Dwarven Trader; Ebony Rhino; Eron the Relentless; Evaporate; Faerie Noble; Feast of the Unicorn; Feroz’s Ban; Folk of An-Havva; Forget; Funeral March; Ghost Hounds; Giant Albatross; Giant Oyster; Grandmother Sengir; Greater Werewolf; Hazduhr the Abbot; Headstone; Heart Wolf; Hungry Mist; Ihsan’s Shade; Irini Sengir; Ironclaw Curse; Jinx; Joven; Joven’s Ferrets; Joven’s Tools; Koskun Falls; Koskun Keep; Labyrinth Minotaur; Leaping Lizard; Leeches; Mammoth Harness; Marjhan; Memory Lapse; Merchant Scroll; Mesa Falcon; Mystic Decree; Narwhal; Orcish Mine; Primal Order; Prophecy; Rashka the Slayer; Reef Pirates; Renewal; Retribution; Reveka, Wizard Savant; Root Spider; Roots; Roterothopter; Rysorian Badger; Samite Alchemist; Sea Sprite; Sea Troll; Sengir Autocrat; Sengir Bats; Serra Aviary; Serra Bestiary; Serra Inquisitors; Serra Paladin; Serrated Arrows; Shrink; Soraya the Falconer; Spectral Bears; Timmerian Fiends; Torture; Trade Caravan; Truce; Veldrane of Sengir; Wall of Kelp; Willow Faerie; Willow Priestess; Winter Sky; and Wizards’ School."}