{"text": "Arcavios is a plane introduced in Strixhaven: School of Mages . The plane has two suns, called Karu and Ezza . Thousands of years ago, what were once two planes of existence , two completely different worlds, merged bizarrely and uniquely. When the worlds merged, their essences overlapped, but they did not overlap perfectly. The leylines of each world, the conduits of mana , overlaid with opposing elements of mana, rather than with their match. This resulted in a particularly unique twist on the magic of the plane. Each of these magical incongruities formed a small region called a snarl , where the effects are most apparent. The five elder dragons of Arcavios were born from these snarls, and millennia later they founded Strixhaven University at the epicenter of the snarls. The period when the plane was young and none of the humanoid races yet walked the earth. Star Arch. At the birth of the plane , as the mana of two planes overlapped in conflicting ways, many forms of life adapted to the new structure, and many new forms of life were spawned. Five particularly powerful vortices of overlapping mana became luminous spheres, from which were hatched five dragons . These dragons have become emblems of the magic of the plane, living symbols of the clashing forces of the five dichotomies. The five dragons were the first to master the magic of the five enemy color combinations. When the humanoid races arose, at first the dragons were angered that mortals would try to harness the wild forces of magic, but they came to realize that only through disciplined study would magic be in safe hands. So, centuries later, the dragons would become founders of an institution devoted to the study of the five mana dichotomies, and that institution is what we now know as Strixhaven . Gravity-defying arch shapes crop up all over this plane , looking like mystical shrines or monuments. They're made from spokes of natural materials that float in an arch shape, with a precise inner curve and a rough and irregular outer arch. They can stand straight or lie at an angle; they can be small or enormous, whole or broken, grown over or mysteriously clean. Their irregular spokes evoke the radiating lines of a shining celestial star. The star arches are a mystery leftover from the Dawning Age when the plane was young and none of the humanoid races yet walked the earth. In most cases, the arches simply sit there, floating inexplicably, silent, immovable, and inert. But many have said that they've seen an arch appear to them at a critical juncture in their lives, helping them understand a lesson or answer a burning question in their mind. Some believe that each arch marks a place of great magic, such as the site of the birth of a great mage or the location of a time-lost spell. Others believe that they're connected with the Archaics in some way, some claim they've seen an arch come to life with powerful magic in their presence. Cervins feed on the mana-rich plants around the star arches, imbuing their bodies with extraordinary grace and vitality. Snarl concept Mana flows through all of Arcavios. But in certain sites, the mana becomes knotted and tangled. At and around these places, magic and spells can be at their most powerful and most dangerous. These places are known as Snarls. According to the Archaics , the Snarls are places where two conflicting sources of antagonistic mana overlapped together at the birth of the plane. Archaic concept The Archaics are a race of wise, giant, long-lived beings with an innate talent for magic. They can be seen striding through the Vastlands, exploring sources of magic with their many arms, or contemplating existence through their \"eye,\" which is a magical focus of some kind. Archaics can live for thousands of years; many are thought to have been alive since the Dawning Age. Despite their solitude, archaics carry a vast understanding of magic and the world’s history, as well as the ability to warp the fabric of the world around them. Mages seek out Archaics for their vast knowledge of history and magic, but Archaics tend to communicate in obscure allusions and cryptic metaphors. In truth, archaics are the reincarnated souls of the oracles of Strixhaven. When an oracle dies, their soul travels back through time to the explosion of magic that brought the Founder Dragons into being. In that outrush of creative force, the oracle’s soul can be caught in the tide and clad in the very substance of the world, becoming an archaic. Because their knowledge cuts across the flow of time, archaics are careful about how much they reveal to mortals and thus tend to speak in riddles. Before Strixhaven was founded, Arcavios experienced a period of tremendous violence known as the Blood Age. The wars were so terrible that they shock even Lorehold students of today. One such war happened three thousand years before any current Strixhaven students were born when the forces of Golwanda the Bloodspiller and Xandril the Executioner clashed on blood-soaked battlefields. Golwanda lead her Thunder Riders, fearless orcish cavalry, and united the steppe peoples under the seal of the Crimson Glaive, while the kor Xandril rallied the hardscrabble Hordeland fiefdoms. The Founder Dragons brought the Blood Age to an end. Founded some 700 years ago by the five spellcasting Founder Dragons, Strixhaven University is Arcavios's premier institution of magical learning, drawing promising young mages from all around the plane to study in its halls. Strixhaven is divided into five colleges, each with its distinct campus, faculty, and magical specialties. The five colleges were based on the magic mastered by each of the dragons. The mission of Strixhaven University is to discover and preserve magical knowledge, disseminate that knowledge from one generation to the next, promotes the free and open study of magic in all its forms, and enhance the lives of people throughout the plane through the use of magic. To this day, the Founder Dragons roam the plane, the five deadly sages of the skies. They no longer associate directly with Strixhaven, preferring to let the deans of the college speak in their stead. The dragons' wisdom is vast, but their tempers can be short. Mages seek them out only to learn the most elusive of secrets. A select few graduates of Strixhaven join the Dragonsguard, an elite force of mages who work with the honored Founder Dragons. The Oriq are a group of mages who seek to access Strixhaven's magical archives for their purposes. Because they need so many recruits, they often send agents across Arcavios to find susceptible people to recruit. This causes many of the citizens of the plane to be distrustful of outsiders for fear they may be affiliated with this group. Arcavios was one of the many planes affected by New Phyrexia's Invasion of the Multiverse . The prestigious school of Strixhaven nearly fell with most of the deans compleated and red sinew growth spreading throughout the college, but it was temporarily thwarted by the Invocation of the Founders that repelled the Phyrexian forces. In the aftermath of the invasion, the Lorehold college led the rebuilding of the Strixhaven campus. Most of the known plane is broken across two huge continents—the northern continent of Orrithia, commonly known as the Vastlands, and a mysterious southern continent, called Galathul. The two are linked by a land bridge called the Isthmus of Omens. Strixhaven University is situated in the northeast of Orrithia. Arcavios map. Orrithia or The Vastlands , the main continent of Arcavios (where Strixhaven is located). Strixhaven , the most elite school of mages in the multiverse, whose Colleges were founded by five elder dragons . The magical Colleges Lorehold , Prismari , Quandrix , Silverquill , and Witherbloom . The Biblioplex , exists in the center of Strixhaven with the 5 Colleges surrounding it. It is the largest library in the multiverse. It contains the Mystical Archive , a collection of spells from throughout the multiverse and all across time. Paradox Gardens Vaults of Turrau Detention Bog Chimneycomb , the mountains of central Orrithia Feradorn Grumlet Heavenfell Pranticle Peak Doradur , a location on the western coast. Home of the Burrogs . Grove of Eljor , a forest to the west of the mountains Tor-Kathorra Desert , home of the Kathorran orcs , known for their tool use and double-edged swords. The Kathorran Empire Silkmeadow Tarangrad Rundlestrom Military Academy The Snarls , places where two opposing forces of mana come together and swirl in a mashing pattern. Fernbosk , home of the trolls. It is a wild place. Ancient ruins dot the plane, most older than Strixhaven itself and many still guarded by soldiers from the Blood Age, centuries after their deaths. Zantafar , the city in which the loxodons of the plane lived before becoming nomads. Rediscovered by Quintorius Kand . The fortress of Caerdoon (or Kaerdoon ) Moragitzu-Kesh , rumored to lay beneath Strixhaven. The Kingdoms Below The Hordeland Fiefdoms The Pinzari Isles , islands before the west coast of Orrithia The Sanctuary of the Lost , a sanatorium for people affected by magic. Galathul , the mysterious second continent of Arcavios. Isthmus of Omens , the land bridge connecting Orrithia and Galathul. The inhabitants of Arcavios are vastly varied. Below are those directly seen or mentioned on the plane. The language taught by Professor of Symbology Quintorius Kand Ajani Goldmane (non-canon) Chandra Nalaar (non-canon) Isona Maive (non-canon) Kasmina Liliana Vess Lukka Nissa Revane Rowan Kenrith Tezzeret (non- canon ) Will Kenrith Associated cards: Referred to: Doug Beyer and Ari Zirulnik (April 01, 2021). \" Planeswalker's Guide to Strixhaven \". magicthegathering.com . Wizards of the Coast."}