{"text": "Arlinn Kord is a tormented werewolf planeswalker from the Kessig province of the plane of Innistrad . She is the protector of the Ulvenwald . Arlinn is a powerful mage, approximately 45 years old. She wears a single large scratched leather pauldron on her shoulder, which carries over into her wolf form. She has long red hair that is tied into a long ponytail, the tip of which is white. In her wolf form, she has a charcoal gray coat that gets progressively darker toward the ridge of her back until the fur of the ridge is jet black. Her eyes glow bright orange. Her pack mate Patience usually carried a leather pack with her clothes. Arlinn Kord is primarily green -aligned, but secondary in red mana. Werewolf form Arlinn is the daughter of a blacksmith and a baker. She grew up with brothers. Arlinn was a teenager from Avabruck when the howls of Tovolar 's Mondronen werewolf pack summoned her into the forest and she completed her First Hunt. For two years she stayed with the pack, though despite Tovolar's mentorship, she never fully embraced the violence of her werewolf nature. At one point, Tovolar urged Arlinn to join in the slaughter of a group of foresters in order to prove her mettle as a werewolf. Arlinn rejected that idea and fought Tovolar, leaving lasting scars on them both. After this confrontation, Arlinn abandoned Tovolar and his pack. Thereafter, she always fought against the change and used Avacynian charms , prayers, and fasting to ward it off as much as possible. She even studied magic in the Church of Avacyn , while successfully hiding her curse from her teachers and mentors. The same day that she became an Archmage of Goldnight she and her peers were confronted by a horde of devils at Havengul . While fighting, she couldn't contain the change any longer and she killed devils, several hierarchs and an angel alike before her spark ignited and she found herself rampaging through the woods of another plane . To her horror, she regained her senses in the morning—but not her human form. For better or worse, the experience of retaining her human mind in wolf form gave her a new appreciation for the wild spirit that shared her body. The only way she could return to her human form was to planeswalk back to Innistrad, but now she finds that she can control the transformation , in both directions, with relative ease. Upon her return to Avabruck years later, she found that her parents had been killed in a fire at her father's forge. Above all else, Arlinn was desperate to ensure the survival of her kind. She had come to think of herself as part of the pack. And in a world where Avacyn either had cursemuted or killed hundreds of werewolves, and where the angel 's church had launched a new inquisition more terrifying than anything they've done before, Arlinn feared that the lycanthropes of Innistrad could meet a very real and permanent end very soon. Arlinn, Voice of the Pack After the death of Avacyn she reunited with the mages and cathars of Goldnight to fight evil together. Later, she was seen helping Thalia and her cathars during the Battle of Thraben against Emrakul's hordes. Arlinn was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . During the invasion, the trapped planeswalkers (including Arlinn) got together with Ravnican leaders to strategize. She was one of the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. Arlinn asks Teferi for help in investigating the Moonsilver Key . Due to the presence of Emrakul (sealed) in the Moon of Innistrad , the plane has been undergoing changes in its cycle of night and day. With the length of the nights getting longer and longer, Arlinn is concerned for the safety of the humans in Innistrad . After hunting with her pack of dire wolves ( Redtooth, Streak, Patience, and Boulder ) she sets out to find Katilda , the leader of the Dawnhart Coven . Tovolar invites Arlinn to join him and other werewolves in a massive human hunt in Kessig . Upon seeing the \"army\" gathered by Tovolar and listening to his proposal, she refuses and tries to attack him, but the wolves of her pack come between her and Tovolar. Arlinn says goodbye to her wolves, who are now with Tovolar's pack, returns to Katilda and agrees to help the warlock find the the Moonsilver Key . Arlinn goes to Ravnica to ask The Gatewatch for help in finding the Moonsilver Key. She finds them and explains Innistrad's situation to Teferi , Kaya , and Chandra . The three planeswalkers agree to help Arlinn and head to Innistrad. Together with the cathar Adeline they decide to go to Thraben to investigate. Arlinn, Teferi, Chandra, Kaya, Adeline and a group of Cathars will search Thraben for clues to the whereabouts of the Moonsilver Key . In Thraben, Kaya finds an old book showing that the Key was given to an ancestor of the Betzold family by a warlock . Arlinn and Adeline knew a bishop named Worrin Betzold and belongs to this family. They end up finding him among the zombie army that Liliana Vess dropped in the midst of the ruins of Thraben (after the sealing of Emrakul ). Bishop Worrin Betzold became a zombie during the events of The Travails and now \"preaches prayers\" in the ruins of a church. The party enters Thraben pushing their way through the undead until they reach Worrin. Even dead, Worrin seems to recognize his old friend Arlinn, who interrogates him asking about the Key, but she can only get the name Dennick . In an act of mercy she kills her friend so he can rest in peace. After that, the group heads to Gavony , the birthplace of the Betzold family. There they get the information that the bishop's son, Dennick Betzold , is in the family mansion, but that the place is haunted. Arriving at the mansion Kaya enters alone and murders the ghosts that haunt the place, so that her companions can enter the mansion. After conversing with the spirit of the late Dennick, they discover that the Key was given by the boy's great-grandfather to a vampire , Sorin Markov , as a way to protect the Key. Now the group head to Markov Manor and question Sorin about the whereabouts of the Key. Arlinn inquires that the humans need protection as darkness grows once more over Innistrad, but Sorin isn't worried about this issue. Upon mentioning Avacyn , Sorin grows enraged and attacks Arlinn, who in her werewolf form manages to stop the attack with little damage to her. Again she mentions Avacyn and is attacked again, but this time Sigarda appears and stops the attack. The angel appears in answer to a prayer made by Arlinn before the group enters the Manor. Sigarda tells Arlinn and her group to look for the Key in Sorin's quarters as she confronts the vampire, giving the group time to go to the Key. In Sorin's quarters they find the Key over a statue of Avacyn, beheaded by Sorin, beneath a painting of Sorin with his grandfather Edgar Markov . Arlinn takes the Key. Arlinn helps defend the Celestus from Tovolar's attack. After Arlinn and her party returned to the Celestus with the Key, Tovolar and his army launched an attack on the Harvesttide festival . Protection spells briefly prevented the werewolves from entering the Celestus. Meanwhile Arlinn told Kaya to take the key to Katilda and her witches. After the magical protections fell, Teferi cast a spell to delay the sunset, which also stopped the werewolves' transformations into their wolf forms. Cathars, witches and planeswalkers fought the werewolves to protect the humans . Arlinn confronted Tovolar by hitting him several times with weapons and her hands. Tovolar called Arlinn's wolves , which caused her to get distracted and knocked down. Tovolar told her he wasn't going to kill her. When Teferi's spell could no longer delay the sunset, the werewolves completed their transformation, including Arlinn. Arlinn and Tovolar fought and both got severe wounds. Arlinn's wolf pack join Tovolar, except for Patience who stayed apart. During the fight, the alpha kept seducing the planeswalker into abandoning the humans and joining the pack. Arlinn feigned surrender, but then overpowered the unsuspecting Tovolar with a deathgrip in his chest. Crushed by her final betrayal, Tovolar surrendered and retreat with the rest of the pack. The survivors of the Harvesttide Massacre stayed behind. After the fight against Tovolar, Chandra and Adeline led Arlinn to the center of Celestus. There, the witches were performing the ritual and ask Arlinn to complete it with them. Just as Katilda was about to complete the ritual, Olivia Voldaren appeared and caught the witch in the air. Olivia  threatened to kill Katilda if Arlinn did not deliver the Key that Katilda dropped. The other witches say that only Katilda can complete the ritual. Deciding quickly, Arlinn threw the Key to the vampire, and Olivia hurled Katilda's body to the ground. To prevent Katilda from getting hurt, Arlinn threw herself in front of the witch, breaking her fall and watched Olivia leave with the Key. Thus, the Eternal Night began. After the Harvesttide festival ritual failed, Arlinn, along with a group of people from Innistrad and Adeline , the planeswalkers Kaya , Chandra Nalaar , and Teferi decide to help humans in distress across Innistrad. That is until Arlinn decided to return to Markov Manor and ask Sorin Markov for help. In the crypt of the Manor, the group encountered Sorin who says that Olivia Voldaren \"stole\" his grandfather . They formed a pact with Sorin and travelled together to the wedding of Olivia and Edgar Markov at the Voldaren estate. When they arrived, all but Sorin were forbidden entrance. Invading Olivia Voldaren 's wedding. When the invitation wards were dispelled, she charged into the Voldaren Estate, along with the rest of the Gatewatch. Confronting Olivia Voldaren for the Key, she found herself outmatched by the vampire's bladework and suffered multiple deep injuries. Goaded by Olivia, she transformed into her wolf form and managed to overpower the Olivia's sword, but was consumed by instinctual rage. Distracted in shredding vampiric portraits, she was impaled from behind by Olivia's hand. Having lost consciousness, Arlinn began to dream of being with her pack but realized that she was now alone. As if called to return, she awoke to find that Tovolar and her packmates had arrived to help. Although she made clear to Tovolar that nothing had changed between them, Arlinn accepted his help to track down Olivia. They found her talking with Edgar Markov who was pleading with her to end their plans. Tovolar lashed out at Edgar but was restrained by Arlinn, and Olivia was given an opportunity to make things right. Olivia dropped the Moonsilver Key and left with Edgar through one of the broken windows, barely escaping from the jaws of Tovolar. With Teferi’s assistance, Arlinn and the Gatewatch hastened their return to the Celestus to complete the ritual. Along the way, Arlinn reluctantly talked with Katilda about Tovolar and understood that a reckoning would one day come. After the balance between night and day was restored, Arlinn followed up with her friends to say goodbye. Before Teferi’s departure, he urged Arlinn to be on guard against the return of an old enemy, the Phyrexians . As the Kessig woods called to her, Arlinn was once again happy in the company of her pack. After the Second Phyrexian Invasion of Dominaria , Arlinn Kord and Sorin Markov worked together to prepare Innistrad's defenses against the encroaching Phyrexian Multiverse threat. Amonkhet (non- canon ) Dominaria (non- canon ) Innistrad Ravnica Associated cards: Depicted in: Quoted or referred to: ↑ Arlinn Kord ↑ a b Chris Gleeson (October 18, 2017). \" The Art of Winona Nelson \". magicthegathering.com . Wizards of the Coast. ↑ a b c K. Arsenault Rivera (September 02, 2021). \" Episode 1: The Witch of the Woods \". magicthegathering.com . Wizards of the Coast. ↑ a b c d e K. Arsenault Rivera (September 8, 2021). \" Episode 2: The Motives of the Wolf \". magicthegathering.com . Wizards of the Coast. ↑ a b K. Arsenault Rivera (November 17, 2021). \" Episode 4: The Wedding Crashers \". magicthegathering.com . Wizards of the Coast. ↑ a b K. Arsenault Rivera (September 22, 2021). \" Episode 4: Harvestide \". magicthegathering.com . Wizards of the Coast. ↑ Kimberly J. Kreines (March 2, 2016). \" Under the Silver Moon \". magicthegathering.com . Wizards of the Coast. ↑ Kimberly J. Kreines (June 8, 2016). \" The Archmage of Goldnight \". magicthegathering.com . Wizards of the Coast. ↑ a b Greg Weisman (April 2019). \" War of the Spark: Ravnica \". Del Rey. ↑ a b K. Arsenault Rivera (September 15, 2021). \" Episode 3: The Fall of the House of Betzold \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (September 29, 2021). \" Episode 5: Night Closes 'Round \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (October 28, 2021). \" Episode 1: Tithes and Invitations \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (November 03, 2021). \" Episode 2: The Dolorous Weight of Pleasantries \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (November 24, 2021). \" Episode 5: Till Death Do Us Part \". magicthegathering.com . Wizards of the Coast. ↑ Seanan McGuire (October 26, 2022). \" The Brother's War - Chapter 5: Exodus \". Magicthegathering.com. ↑ a b c d e f g h i j k l MacKay, Jed. (2021). Magic . Vol 1, iss 9. ↑ a b c d e f g h i MacKay, Jed. (2022). Magic . Iss 19. ↑ Seanan McGuire (2022). Magic: Ajani Goldmane . Wizards of the Coast."}