{"text": "Ashiok ( ASH-ee-ock ) is a nightmare planeswalker of unknown gender and origin. Ashiok is a being of strange and terrible beauty. They have long, slender fingers with long, talon-like claws for fingernails. Their mouth contains two rows of pointed teeth. While the bottom half of their head resembles a human's, the top half consists of two large black horns, made of a rough rocky substance, that frame the void around them. Ashiok has no upper face, no cranium, eyes, or nose. In their place, there is only black smoke emanating from where the mouth and upper lip ended. This black smoke whirls around their head, swirling down in a wider radius outside the body and cooling the areas it touches. Ashiok is capable of reaching into the dreams and fears that dwell inside of others. With this power, they can summon beings born of people's darkest fears, call them into reality and give them form. They become Ashiok's minions, eager to please their master, freed from the dreams of the believer. Ashiok uses these minions to tear down those who view themselves as untouchable and superior, believing that since all sentient beings feel fear, fear is the greatest equalizer of all beings. The dread vapors that emanate from Ashiok are an extension of the nightmare magic the mage wields, giving the walker easier access to the fears of those they enshroud. Ashiok travels the Multiverse in perpetual search of designs for the perfect embodiment of fear. They never laugh. Ashiok's magic is centered on manipulating fear, dreams and nightmares , extracting thoughts, and destroying the mind. Ashiok can float. Ashiok is centered in black and blue mana. When they planeswalk, smoke swallows them at their origin, while veils of black coalesce into their form at their destination as those nearby feel cold and inhale smoke. Ashiok's announcement article for Theros generally referred to the card from a gameplay perspective using \"it,\" but referred to the character as \"he\" in its final sentence. The same day, senior creative designer Doug Beyer implied that Ashiok's race and gender were unknown as they enjoy unsettling others. Later that week, head designer Mark Rosewater weighed in, stating that he believes Ashiok is male or female, but prefers not being defined. However, when the set released, Ashiok was again referred to using he/him pronouns in its Player's Guide. Beyer again clarified that \"despite the pronouns used in the player's guide of the Theros fat pack, Ashiok’s gender is officially unspecified.\" Rosewater agreed, stating that while others may label Ashiok, they choose not to use labels. In their first storyline appearance, Phenax initially refers to Ashiok using he/him pronouns, but later recants: \"He, no, Phenax was not sure if the mortal even had a gender, Ashiok .\" In their next appearance in the IDW Publishing comic Magic: The Gathering - Theros , the Theran firemage Atha refers to Ashiok using he/him pronouns but reveals her knowledge of the planeswalker to be secondhand. That year, Rosewater and Beyer again clarified that Ashiok's gender is \"officially unspecified,\" and that while the character may have a private gender identity, they choose not to share it. In 2015, Wizards of the Coast shared the official MTG Style Guide entry for Ashiok written by Daily MTG copy editor Mike McArtor , which stated that \"Ashiok is androgynous and does not subscribe to the binary.\" The Style Guide also advised against using \"it,\" \"he,\" \"she,\" or \"they\" pronouns — although the latter would later be retracted — and instead suggested using Ashiok's name. In 2019, Rosewater repeated that Ashiok's gender is unknown, and for the first time suggested that Ashiok may lack a gender entirely. Ashiok may have been human once. Over time, their power has taken a physical toll. The mage's face eroded into a smoky shadow. Nightmarish wisps swirl where a skull may have once been. That these are no longer required is part of their enigma, and is a testament to the unnatural power they wield. Ashiok came to Theros because of the strong power of devotion and belief of the plane's mortals, and of the consequential effects it has on the gods and Nyx . There is something special about Theros, and they intend to harness this unique advantage. However, unlike the gods, Ashiok does not seek to become the object of belief. Instead, they seek the darker side of belief, the smoke, and screams that waft from the cold corners of nightmares . They know that if fond thoughts of the gods have power, then the dark phantasms spawned from fearing those gods hold even more: where there is a belief, there is doubt, and where there is doubt, there is the nightmare. And the world of Theros is a world full of believers. Nightmarish End The nightmare weaver's complete agenda is yet unknown. Whether Ashiok came to Theros for personal purposes, or as an emissary of some stronger force, is unclear. At some point in their pursuits, they made a bargain with Phenax , the god of lies and deceit. The nightmare weaver then sought to incite war between the polis of Iretis and the leonin . Duress ( Media insert ) - Dack Fayden and Ashiok Ashiok posed as Udaen, an advisor to Kedarick, king of Iretis. Kedarick was trying to make peace between his city and the Leonin, resulting in a peace meeting between the two sides. However, Ashiok sent nightmarish abominations to kill off individuals from both sides during the peace meeting. This resulted in continued conflict between humans and leonin, each side accusing the other of betrayal. The leonin retaliated by annihilating the Iretis' citizenry, allowing Phenax's plan to go into motion, to create another necropolis for the Returned , a cog in his grander designs. In return, Ashiok asked to be made invisible to the gods, which made Phenax break into a burst of hysterical, cruel laughter after he peered deep into their essence. As an experiment, Ashiok used psychic powers to upset the dreams of the citizens of Theros. This created disturbing thoughts of the poleis, which in turn created Cacophony - God of Cities. The newborn god was quickly slain by Ephara , but she was unable to locate the creator of Cacophony. Ashiok was satisfied by the use of Phenax's boon and the results of the nightmare weaver's test. Ashiok valued creation and beauty, and considered the deed beautiful. Ashiok's Erasure Slowly Ashiok's influence grew, nightmares stirring in the minds of Theros's inhabitants. Entire cities grew tense as their dreams turned against them, but it was only the start of their scheme. As the will of the people weakened, those with power, the magic wielders found themselves awakening in places with no memory of how they had gotten there or what they had done while slumbering. They could remember only the nightmares that haunted them, and mayhem broke out in their wake. They were cast out from their homes and all the while, Ashiok gathered power for the grandest spell. The planeswalker planned to cast a spell over all of Theros that would send the world into never-ending slumber so that they could harvest nightmares forever. There was only one person who could hope to stand against the mage: Dack Fayden . Dack, Ravos , and the dead put an end to Ashiok's Sleep curse. Ashiok was, in some undisclosed way, involved with the War of the Spark . Ashiok tortures Elspeth in the Underworld, using her nightmares and fears. Ashiok continued to spread nightmares through Theros. Not even the Underworld was free from such dark power. Eventually, they would start to particularly savor the twisted dreams of Elspeth Tirel , a fallen planeswalker. Ashiok found out about the nightmarish Phyrexians from Elspeth's mind and then planeswalked away, hoping to find the Phyrexians and to understand more about their nature. Ashiok used their nightmare-inducing powers to influence the dreams of Mirrans until they decided to see what they would do to a Phyrexian. They then tested that on Elesh Norn herself, making it appear as if her glistening oil failed to properly compleat a Mirran woman. When Norn discovered the ruse and attacked Ashiok, the planeswalker conjured a figure of Elspeth Tirel wearing Norn's armor before leaving. The incident inspired Ashiok to send a message to Elspeth on Dominaria while she was helping defend the Temporal Anchor , in which they waxed poetic about the many people Elspeth had hurt. Ashiok becomes Eriette's adviser. Following New Phyrexia's Invasion of the Multiverse , Ashiok was one of few planeswalkers who retained their spark following the Great Pruning . After the invasion, they traveled to Eldraine , which had fallen under a magical sleep. There, they pulled the nightmares of the sleeping citizens into the waking world and turned them against those still awake , presumably to rule Eldraine in the absence of the courts. They made an alliance with the witch Eriette , one of the authors of the curse. Taking control of the sleepers when Will Kenrith assaulted Castle Ardenvale , they were restrained by Kellan and struck in the chest by an ice bolt from Will, forcing them to planeswalk to safety. They later returned to free Eriette from prison. Ashiok is the primary antagonist of the Theros Beyond Death trailer. Wizards of the Coast hired musician Jonathan Young to compose a song based on Ashiok titled Nightmare Weaver . In the video game Magic: The Gathering Arena , Ashiok is voiced by Steve Blum . Eldraine Meditation Plane Ravnica Theros New Phyrexia Calix Dack Fayden Elspeth Tirel Rowan Kenrith Will Kenrith Associated cards: Depicted in: Quoted or referred to: ↑ a b c d e Doug Beyer (September 4, 2013). \" Ashiok was just revealed \". A Voice for Vorthos . Tumblr. ↑ a b Mark Rosewater (October 18, 2014). \" What is Ashiok's gender? \". Blogatog . Tumblr. ↑ a b K. Arsenault Rivera (August 10, 2023). \" Wilds of Eldraine - Episode 3: Two Great Banquets \". magicthegathering.com . Wizards of the Coast. ↑ a b c Ken Troop (December 04, 2013). \" Building Toward A Dream, Part 2 \". magicthegathering.com . Wizards of the Coast. ↑ a b c d K. Arsenault Rivera (August 14, 2023). \" Wilds of Eldraine - Episode 5: Broken Oaths \". magicthegathering.com . Wizards of the Coast. ↑ Jacob Van Lunen (September 4, 2013). \" Weaving Nightmares \". magicthegathering.com . Wizards of the Coast. Archived from the original on March 14, 2015. ↑ Doug Beyer (September 04, 2013). \" So is Ashiok, Nightware Weaver a male or a female? \". A Voice for Vorthos . Tumblr. ↑ Mark Rosewater (September 07, 2013). \" Is Ashiok male or female? \". Blogatog . Tumblr. ↑ (2013). Theros Player's Guide . Wizards of the Coast . ↑ Doug Beyer (September 27, 2013). \" So the Theros fat pack guide came out today \". A Voice for Vorthos . Tumblr. ↑ Mark Rosewater (September 29, 2013). \" So is Ashiok now confirmed for being male \". Blogatog . Tumblr. ↑ Jason Ciaramella , illus. Martin Coccolo. (2013-2014.) Magic: The Gathering - Theros , IDW Publishing . ISBN-13 978-1613779088. ↑ Mark Rosewater (May 03, 2014). \" What are Ashiok's pronouns? \". Blogatog . Tumblr. ↑ Doug Beyer (November 12, 2014). \" does Ashiok have a non male or female gender \". A Voice for Vorthos . Tumblr. ↑ Doug Beyer (November 12, 2014). \" Some people want to know about Ashiok's gender \". A Voice for Vorthos . Tumblr. ↑ Wizards of the Coast (June 30, 2015). \" Ashiok's Style Guide Entry \". The Official Magic: The Gathering Tumblr . Tumblr. ↑ Ken Troop (November 27, 2013). \" Building Toward a Dream, Part 1 \". magicthegathering.com . Wizards of the Coast. ↑ Ken Troop (April 23, 2014). \" Dreams of the City \". magicthegathering.com . Wizards of the Coast. ↑ Greg Weisman (April 2019). \" War of the Spark: Ravnica \". Del Rey. ↑ Jason Ciaramella (2014). \" Magic: The Gathering - Theros \". IDW Publishing . ↑ Mark Rosewater (July 30, 2019). \" Did Ashiok have a roll in the War of the Spark that we don't know about yet, or was his card just to fill a hole? \". Blogatog . Tumblr. ↑ Wizards of the Coast (December 16, 2019). \" The Theros Beyond Death Story on Cards \". magicthegathering.com . Wizards of the Coast. ↑ Wizards of the Coast (January 10, 2020). \" Theros Beyond Death Story Summary \". magicthegathering.com . Wizards of the Coast. ↑ a b Lora Gray (May 3, 2022). \" A Garden of Flesh \". magicthegathering.com . Wizards of the Coast. ↑ a b Seanan McGuire (October 26, 2022). \" The Brother's War - Chapter 4: The Dark \". magicthegathering.com . Wizards of the Coast. ↑ a b The Preview Panel at MagicCon Minneapolis (Video). Magic: The Gathering . YouTube (May 5, 2023). ↑ Theros Beyond Death Official Trailer - Magic: The Gathering (Video). Magic: The Gathering . YouTube (December 12, 2019). ↑ Steve Blum as Ashiok, Sarkhan Vol . IMDB. ↑ James Wyatt (October 13, 2020). \" The Art of Magic: The Gathering - War of the Spark \". Wizards of the Coast"}