{"text": "Astor was a Keldon warlord of some importance, and one of the youngest warlords to ever earn that title. He was known as Astor the Upstart, Steward of the Northern Wastes, The Bearer of Three Blades, and The Butcher of Bogardan . He was most well known for his iconic  kukri blades with which he earned his third title. Astor spent much of his early life as a camp runner for Commander Treulk. He was the best messenger that Treulk had, and that honor earned him the attention of Doyen Olvresk , the Bastard of Bogardan . Olvresk took him from Treulk and sent Astor to train under Doyenne Tajamin , the Keeper of the Book of Keld. He had the utmost confidence in his protege and expected him to finish his training quickly. Tajamin had distinct ideas about how to train Astor, using Argivian tutors to teach the boy and restricting his physical training a great deal. Olvresk disagreed strongly with these methods. He stormed Tajamin's compound and used his Fists, his elite soldiers, to slaughter many of Tajamin's people. Tajamin saved her life, as well as that of Astor by telling Olvresk that Astor had yet to learn Kradak 's \"Tinder Spell\". If Astor's training was so important to Olvresk, she said, then Olvresk could teach Astor the spell himself. Olvresk agreed, but only if Astor would do without food until he had learned the spell, claiming he should already be done with this training and searching for food on the mountain. Two days later, Astor knew the spell, but Tajamin told him he knew only half of what he should and told him then of Jezal's Covenant . It was important to her to instill the need for thought rather than just Olvresk's actions. Despite Olvresk's rush to get Astor on the mountain, he was still weeks ahead of the other warlord candidates. He learned an important lesson the first-day Olvresk took him there, that once you feel the fear of death itself weigh upon you, nothing less will ever affect you. It was a lesson he learned well upon the mountain. He was halfway up the mountain when the rest of his compatriots arrived, and Astor had found food by slaying a Colos , but the blood and smell of meat attracted a pack of wolves. Astor fought them off before continuing further up the mountain. At the peak, shortly after his bloody battle, Astor came upon a vision of Keld's first warlord, Kradak himself. Kradak warned Astor of the coming of the Keldon Twilight in Astor's lifetime. Kradak told him to listen to the lessons of both of his teachers, for only with both thought and action would Astor and Keld survive Twilight. With that, the vision vanished, and Astor stood tall at the highest peak of Keld as a warlord. At age 19, Astor had been granted the lands of the far north, the country bordering Parma as his domain by Olvresk. Among his lands was a dragon who was sworn to leave the Keldon villages in peace, at the threat that her unhatched egg would be destroyed if she didn't. Unfortunately for Astor, it appeared that the dragon had broken her word. With a portion of his war host and an Argivian translator fluent in draconic, on loan from Tajamin, Astor set out to confront the dragon. As Astor soon found out, the dragon he had expected to confront was not the one he found. Skouras , a blue dragon from across the seas, had killed the resident dragon who had parleyed with Olvresk. Skouras was an expert at mind magic and quickly tore through Astor's troops. Astor and a handful of survivors, the translator included, barely survived, only being saved when Astor used the captured egg of the dead dragon as a bomb and hurled it into Skouras's horde, detonating it and rendering much of the treasure to slag. Skouras swore vengeance as he went to assess the damage done. Astor took advantage of this respite and retreated to the closest village, Letha. There, he carefully considered what had happened, and used the villagers to bolster his diminished troops. When Skouras tracked Astor down, he had devised a plan. Using the village as a tinder, he detonated most of the buildings, rendering Skouras earthbound. Soon Skouras found Astor and once more began to invade the warlord's mind. Astor was lost in the dark magic, but this was all part of Astor's plan. Astor called upon the full power of Keld and every Keldon and channeled it through his mind directly into Skouras's. This had the rather spectacular effect of exploding the dragon's head. When the Rathi Overlay began, Freyalise interceded and planted the Skyshroud Forest into the harsh climate of Keld. It materialized in the middle of Astor's holdings, and as such, he was the first warlord to confront the Skyshroud Elves. He found Eladamri and after a brief confrontation, Astor accepted the elf and began to teach him the ways of Keld. With Astor's help, Eladamri earned the respect of Olvresk and Tajamin, uniting the Keldon forces with that of Skyshroud. The combined forces rode into battle to reclaim the besieged Keldon Necropolis , where it was prophesied that the honored dead of Keld's past would rise again to retake their lands. The battle was harsh, with neither side gaining much of an advantage as it wore on. Eventually, however, the Keldon Twilight took place as the fallen chieftains returned to life to fight once more. Unfortunately, they instead sided with their undead kin, the Phyrexians. The battle for the Necropolis descended into chaos as the living Keldon warriors were forced to commit the ultimate sacrilege by slaying their undead champions. The lunacy reached a peak when Tajamin struck one of the undead with her sacred cudgel, that act causing the weapon to surge with energy and trigger a volcanic eruption beneath the frozen terrain, resulting in a massive flood that swept away the Phyrexians, elves, and Keldons alike. The mythical Keldon longboat Golden Argosy emerged from the depths and saved the remaining warriors of Keld to take them to the next battle—the fetid shores of Urborg . Astor arrived alongside Eladamri in the swamps to unite with the metathran army. He briefly met with their new leader, Commander Grizzlegom . The commanders joined forces in charging towards the Phyrexian command center, the Stronghold. The Coalition forces advanced rapidly towards their target but were held back when they reached the Portcullis. As the united forces searched around the volcano's exterior for an alternate way in, they came across Sister Nadeen Dormet and her fellow stone dwarf rock druids, who were tunneling into the volcano right under the notice of the Phyrexians to cause it to erupt. Eladamri managed to ally with them, agreeing to protect them once they reached the inside of the volcano in exchange for using the tunnel to attack the fortress from behind. The dwarves, along with the elves, the minotaurs , metathran, and Keldons—plus Liin Sivi, who had remained at Eladamri's side throughout—snuck up behind the Portcullis, defeated the outflanked Phyrexians and destroyed the gate before raiding the Stronghold. Their success was short-lived though. Yawgmoth began emerging through the planar portal in Stronghold's throne room. The allied forces, along with Gerrard fled for Weatherlight , which flew the various warriors to safety just before Yawgmoth's death cloud could consume them. Gerrard successfully sealed off the volcano by plugging the crater with a plague ship, but it became clear that Yawgmoth could not be contained inside. Already, he had caused the dead across Dominaria to rise as his new army. Even the soil had risen to form mud-men that ran rampant, slaughtering the living. Eladamri, Sivi, and their host of surviving Keldons and elves thus set off to do what they could to stop the carnage. They tried to save the Magnigoth Treefolk that were being suffocated as the soil that normally nourished them had risen and covered their leaves. The Keldons made fires to turn the mudmen into pottery while Sivi and the elves climbed the trees and pulled the creatures onto the flames below. This plan succeeded in saving the Magnigoths from the mud-men. At some point after the Invasion, and presumably after earning the title Butcher of Bogardan and becoming a full Doyen, Astor became involved with a female Skyshroud elf . Though he never saw his child, nor she him, Astor ensured that she and her mother were well cared for, but they remained secluded in the Skyshround forest rather than live with him in his estate. His granddaughter Radha , who was heavily involved in the Time Spiral crisis , sought to find his tomb in the Necropolis as soon as she was freed of Freyalise's meddling. Once there, she found no corpse in his tomb, only his twin kukris. During Sheoldred 's invasion of Dominaria, the Golden Argosy returned, carrying Astor aboard. Astor had lived in a dreamlike state aboard the Golden Argosy for centuries and remains physically as he was when he boarded the ship in his mid-twenties. Now fully returned to his senses, Astor battled his old foes once more. He was surprised to find his granddaughter now rules a united Keldon kingdom."}