{"text": "Avacyn was an archangel who inhabited Innistrad . She was the central figure of the Church of Avacyn , who gave the humanity of that plane the faith to fight for survival. The vampire planeswalker Sorin Markov created Avacyn and tasked her with protecting Innistrad. Through her, the magic of faith would create true power to fend off the darkness. The Church of Avacyn rose from the power Sorin invested in her. Avacyn's purpose was to maintain the balance on Innistrad. Without her, the equilibrium between humanity and the dark forces would be broken, which would result in the extinction of humanity at the hands of the vampires or werewolves and the triumph of demons over the plane; this would inevitably lead to the vampires resorting to cannibalism once humans and the other species were extinct, resulting in their extinction as well. Avacyn, depicted in an avatar for Magic Online Avacyn Restored Release Events Sorin knew never to expect peace and harmony on his shadowed homeworld, but he thought he had arranged a kind of effective equilibrium, a set of safety measures designed to keep one side of the scale from ever tipping too far. He trusted that this system would maintain itself without his intervention and left the plane in the hands of his creation. However, the demon Griselbrand eventually came to the Helvault , defiantly challenging Avacyn to combat. The two battled for days, out of view of all but Avacyn's host, the Lunarch, Mikaeus , and his most trusted bishops. Finally, in an act of desperate effort, Avacyn used all of her remaining strength to drive Griselbrand into the Helvault. However, as his final act, Griselbrand threw his spear and impaled his angelic nemesis. The binding spell backlashed as she was impaled, and Avacyn became imprisoned in the Helvault alongside every other demon that had been trapped within. The angel's disappearance not only endangered the humans of Innistrad but also shattered the carefully-constructed balance between humanity and the creatures of the night. Avacyn restored Liliana Vess visited Innistrad in the hopes of destroying Griselbrand , with whom she had made a demonic pact that would result in her soul's enslavement. To this end, she opened the Helvault by forcing an ultimatum on Thalia , its guardian: either she'd destroy the rock, or her soldiers would die. This resulted in the release of both the demons and Avacyn, restoring mankind's defense against the darkness. Avacyn's stained glass window The people of the remote village of Gatstaf appealed to Avacyn for aid in breaking the lycanthropic curse after her return. Avacyn appeared to them in Gatstaf Grotto, where many had gathered to strike down what they saw as their scourge. Avacyn's message was short and simple: she could not break the curse of lycanthropy. The curse mingles the human spirit with the spirit of the wild, and the wild spirit could not be destroyed without also destroying the werewolf's humanity; those afflicted with the curse would forever have it. However, Avacyn offered the Gatstaf werewolves a special place at her side. If they promised to serve as guardians of humanity, she would transform their curse, fusing the two warring aspects and allowing them to dwell in the light of her blessing. The lycanthropes at the Grotto accepted her offer, and she transformed them into the wolfir . In a powerful wave of spells that would become known as the cursemute , Avacyn's magic spread through the plane, transforming not just many werewolves but many of the world's foul curses. The wolfir emerged as a new race of great wolf creatures dedicated to the principles of the Church of Avacyn. However, some of the afflicted humans were fully cured and allowed to lead normal, non-hairy lives. The cursemute would eventually end with Avacyn's corruption, returning cured werewolves to their natural state. In the aftermath of her return, Avacyn led Innistrad's humanity into a time of prosperity and peace that lasted roughly a year. This changed, however, by the end of that year's Harvest Moon : the village outcast Kelse prayed to her for help in finding her son, who had ventured into the woods. Avacyn descended and rescued the child, only to be attacked by a strange spell that gave her a vision of Nahiri's works and invaded her mind with strange thoughts, claiming that mankind was corrupted. During this, Kelse was possessed by rage and punished her child. This event, combined with foreign thoughts, caused Avacyn to feel a new sense of disgust toward humans. As revealed later, Avacyn's madness was caused by Nahiri's cryptoliths . The redirection of mana that they caused was especially harmful to the angels, who are formed of raw mana. Sometime later, Lunarch Macher felt insecure in Avacyn's status as a deity and prayed for evidence of her power. Avacyn responded by verbally abusing him, causing him to urinate himself and faint. By this point, black trimming began to invade her irises. Months later, in late Hunter's Moon , Avacyn paid a visit to Sigarda 's house, alongside Bruna and Gisela . By this point, her eyes were already flashing black prominently and her spear began to shift into a more menacing weapon, and her thoughts of disgust towards humanity became dominant, advocating a genocidal solution. Sigarda remained unconvinced, but Bruna and Gisela had fully given in to the madness before they appeared in the former's house. Avacyn blew up Sigarda's roof, and implied a threat towards her should she not collaborate. By the end of Hunter's Moon, Avacyn returned to the village where Kelse lived. Commanding a flight of angels, she attacked the town, slaughtering its inhabitants with beams of light and prompting a crisis of faith in Kelse. The woman ordered her son to run away, much to Avacyn's anger, and was in turn burned by a beam of light. Satisfied, Avacyn kept attacking the town, now hearing soothing whispers from the Moon. At Thraben Cathedral, Avacyn encountered Jace Beleren and Tamiyo , who tried in vain to restrain her. As she prepared to kill the two planeswalkers, Sorin Markov arrived, asking her to accompany him to the Vault of the Archangel where he had created her. Avacyn did not recognize him, telling him to stand down or face her wrath. As her spells did not affect him, Sorin told her that he was her creator, and Avacyn's madness momentarily withdrew. She questioned herself, reminded of her acts in the grip of madness. She came to denounce Sorin; since he had created her, he was responsible for the flaw within her that had driven her against the innocents of Innistrad and thus was responsible for the creation of Innistrad's greatest current threat. Realizing that she could not harm Sorin, Avacyn instead called the angels of Innistrad down on him. The ancient planeswalker was able to defeat them, but the madness once again took hold of Avacyn, allowing her to harm Sorin. In the ensuing battle, Sorin managed to plummet Avacyn through the Cathedral floor into the Vault. Sorin offered to heal her, but she refused, stating that if she wasn't the daughter he had wanted, they would battle again and again because she would not yield to a monster. When she stated that she knew that Sorin would simply bind her, because what cannot be destroyed must be bound, her creator answered that she could very well be destroyed. When Sorin unraveled the spell that had formed her, Avacyn's last thoughts were: \"I am Avacyn. I am to protect.\" Avacyn, the Purifier Before her corruption, Avacyn was incredibly benevolent to all humans. She had always been the most comfortable with children since their innocence and earnestness made them easier for her to comprehend. Avacyn did not like smiling—she had never understood the point of it. But she did feel a deep and abiding sense of satisfaction over the work she and her angels had accomplished since the events of Avacyn Restored. Sigarda described her as the most powerful and confident angel on Innistrad. But perhaps due to her artificial nature, she is detached from all other angels, who see her in a distant light as humans see angels. Apparently, Avacyn can hear all prayers in Innistrad. Avacyn is not above slaying other angels, as she demonstrated 1000 years ago. Liesa, sister to Bruna, Gisela, and Sigarda, became allied with a demon lord, an act condemned by most angels. In response, Avacyn declared her a heretic, an accomplice to the very monsters Avacyn and all other angels were sworn to defeat. Avacyn single-handedly slew Liesa and her entire angel flight for their heresy, then declared the very mention of her name forbidden. Under the influence of the Cryptoliths, Avacyn saw those she deemed her enemies as monsters, their pleas like vermin crawling from their mouths. Vampires manifested as leech-like, blood-smelling creatures, even her creator. Avacyn's symbol Associated cards: Depicted in: Quoted or referred to: Doug Beyer (January 11, 2012). \" Sorin's Homecoming \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 18, 2012). \" The Prison of Silver \". magicthegathering.com . Wizards of the Coast. Colin Kawakami (August 13, 2014). \" The Lunarch's Journal \". magicthegathering.com . Wizards of the Coast. Doug Beyer (March 21, 2012). \" The Guardian, the Witch, and the Angel \". magicthegathering.com . Wizards of the Coast. Doug Beyer (April 09, 2012). \" Angel's Rise and Demon's Release \". magicthegathering.com . Wizards of the Coast."}