{"text": "Queen Ayara was an ancient elf from the days of the Elven Kingdom on Eldraine , who, until recently, reigned over the court of Locthwain . She was compleated during New Phyrexia's Invasion of the Multiverse and slain shortly afterward. Ayara was an elf with a petite nose, pointy ears, full lips, and intricate clothing. She wore a black veil over a crown with two hornlike spikes and had a nose piercing attached to her ear via two thin gold nose chains. She usually wore a magnificent black gown with a purple bodice trimmed in gold with miniature goblets in the fashion of Locthwain. A gauzy black veil half concealed her features, but her beauty and proud strength were evident to all. Her dark eyes had an expression as unreadable as it was daunting. Her voice was the sweetest imaginable, enticing any and all potential suitors. After compleation , she was covered in a black iron exoskeleton that mimicked her veil and gown. Spikes jutted from her arms and face, and her heart, glowing with heat, was visible through a hollow ribcage. While her official royal title was First of Locthwain , the denizens of the realm also often referred to her as the Widowed Queen , a reference to the many spouses she had wed over the centuries. Ayara wed those champions of Locthwain who sought the Cauldron on the evening before they set out on their ultimately fatal quests. By tradition, a year and a day after a champion had set off on the quest, Ayara declared the champion lost and held a funeral party. More often than not, the party carried over into the next day, transforming the new dawn into a wedding feast for the queen and her next champion spouse. Ayara secretly partook in the Wild Hunt , although it is outlawed in the land. However, she also worked to foster peace between man and elf. Ayara remained as the ruler of Locthwain rather than withdraw with her brethren into the Wilds after the elven courts had lost their hold on the Realm . Ayara looked youthful due to the Cauldron of Eternity , but she buried many lovers through the years. Ayara compleated by the Furnace Host Ayara, along with the rest of the court of Locthwain, was compleated as part of New Phyrexia's Invasion of the Multiverse . However, she met an ignominious end shortly afterward: Rankle used a love potion to lure her off a cliff and to her death. Associated cards: Depicted in: Quoted or referred to:"}