{"text": "Aysen is a human nation, in the Northern Plains of Ulgrotha . It began as a city-state and later grew into a proper state containing the capital city of Onella and separated from the rest of the Homelands by its Border Gates . After the Great War of Ulgrotha , the few humans survivors became nomadic wanderers on the Northern Plains of the Homelands. As time went on, they divided into different families and came to forget where they came from, and why they were in this world. During this time, skirmishes with the goblins from the Koskun Mountains were frequent, but they were usually quickly defeated thanks to the fighting experience of the nomads. Then came a time when the nomads were growing so numerous, they started to war amongst themselves. This continued until around 3750 AR when the planeswalker Serra came on Ulgrotha. She encouraged peace amongst the nomads, and the foundation of their first city, Onella , named after the first Abbot chosen by Serra. The name of the newborn country was Aysen, after a star constellation that Serra said stood for \"harmony\". Serra became the protector and eventually goddess of Aysen. The government of the Citizenship of Aysen is run by a mostly democratic method. Bureaucrats from all over Aysen journey to Onella three times yearly to decide important issues of the state. The daily affairs and bureaucracy are maintained by the Abbey Matrons while the leader of Aysen, the Abbot, is responsible for the spiritual and moral well-being of his culture. Unfortunately, there is a lot of red tape and bureaucracy, and quite a few complicated procedures involved with getting anything done in the Aysen government, and many of the dissatisfied citizens had founded the town of An-Havva and the other pioneer towns. There are two major divisions in how people think in Aysen, that of the Serrans and the Samite. The Serrans are those that think that good and evil are absolute, and (of course) those who are of Aysen are good, while just about everything and everybody else is evil. The Samites are much more open, tolerant of the opinions of others, and generally unbiased. There are some healing and protection magics practiced openly in Aysen, but magic used to be uncommon and unspoken of otherwise. More recently, divination and fortune-telling have become popular in certain circles, known as the Death Speakers . Border Gates of Aysen Onella Aysen Abbey Serra Aviary Associated cards: Quoted or referred to:"}