{"text": "Balthor Rockfist was a dwarf of the Rock Clan driven off by his people, and who became an important barbarian chieftain on Otaria . At the age of forty-five, Balthor fought during the Phyrexian Invasion . Miraculously, he survived as so many others fell and were left alone, he scavenged what he could, managing to retrieve nothing less than Urza 's staff. As he wandered the vast wastelands left by the Phyrexians, he found a fellow survivor fighting warhounds, Matoc. Matoc and he dispatched the constructs quickly and began their long trek home to Otaria. On the ship ride home, Balthor befriended Matoc and explained how badly he felt out of place among the rock druids of his clan. He and the barbarian reached a kinship at that moment, as they talked of the heat of battle. After an assault by pirates, it became clear to Matoc what should be done. The barbarian invited Balthor to join his clan. When they returned to Auror Village, Balthor underwent the challenge to join the tribe and passed with no trouble. As thanks for giving him a home, Balthor forged Matoc a blade from Urza's Staff. He was the mentor of both Kamahl and Jeska , as well as many other barbarian warriors . As well as a warrior, Balthor was a skilled mage and worshipper of Fiers . Out of concern for Kamahl, he traveled with Jeska to Cabal City to try to find him, briefly fighting in the pits alongside her, but was unsuccessful in his search and returned to the mountains . Balthor was reunited with Kamahl when the barbarian returned to his home with the Mirari . Balthor was initially happy to see him but became concerned about Kamahl's increasingly erratic and violent behavior. Balthor realized that the Mirari was to blame and was forced to oppose his pupil when Kamahl tried to take over all the tribes. Following Jeska's mortal wounding Kamahl snapped out of the Mirari's influence and resolved to atone for the damage he had caused, which Balthor was happy to help with. The pair traveled to Krosa to seek help from the druids , but they were ambushed by Cabalists and Order Legionnaires under the influence of Ambassador Laquatus . Balthor let Kamahl flee into the forest and sacrificed himself to destroy the seemingly unkillable dementia beast Burke as it suffocated him. Undead Balthor; Balthor the Defiled . However, death was not the end for Balthor. The Cabalists raised him as a zombie , in the form of Balthor the Defiled . In his zombified form, he was able to retain a large degree of his personality and memories, which broke loose, leading him to pursue the merfolk responsible for his death, Laquatus. He repeatedly ambushed the ambassador's men and caused many casualties, leading to the Order and Cabal members leaving when they realized the creature in the shadows was mainly after the ambassador, not them. This left Laquatus alone in the forest to confront Kamahl and Balthor. However, in a twist of fate, the remains of Burke inside Balthor allowed Laquatus to control the dwarf, forcing him to fight Kamahl. Balthor begged Kamahl to end his suffering, which the barbarian reluctantly did before killing the ambassador. Even then, Balthor remained. His spirit lingered in the Krosan Forest around the Mirari-sword sensing that Kamahl would need it again. When Kamahl did indeed return for it, Balthor offered him his guidance first in finding the sword and then in mastering it. When Kamahl began to be overwhelmed by the sword's influence during a dangerous kata Balthor intervened only to be struck by the sword and killed for the last time. However, his efforts were not meaningless: his final death brought Kamahl to his senses again and allowed the barbarian-druid to finally master the Mirari's dark powers. Quoted or referred to:"}