{"text": "Bant is one of the five shards of Alara . It is primarily white -aligned with green and blue as secondary colors . It is inhabited by humans , aven , rhoxes , the semi-intelligent leotau mounts, and the angels that watch over the plane. Bant is a haven of order, honor, and community. Traditions have thrived, and are protected by innumerable knightly orders, warrior angels, and a caste system designed to support the good of the many over the good of the few. Without the magic of death and chaos there to threaten convention and stability, and with angels flying as tireless symbols of peace and justice, its community traditions have become codified into law. Its' monks study the words of ancient prayers. Its mages and clerics practice magic of healing, prevention, protection, and growth. Its druids and laborers care for the rolling fields, bringing nourishment to the population, and its orchards, which are some of its most important sources of mana. And its knights practice the codes and forms of martial perfection, weighed down by the medallions of honor and patronage known as sigils. Angels rule the realm with benevolence and grace. Humans and the aven resolve their conflicts with ritualized combat. Duty and honor are the bedrock of this kingdom of light. Bant is a land of towering castles and leotau-riding knights, angels, and high castles on rolling meadows. It is a world that loves order and values the group. The ruling establishment is noble and righteous, and society is well-ordered with a strong sense of right and wrong. Even for those who do break the law, the worst punishment is temporary banishment to the savannahs of Topa. There are still battles held on this shard, but they are battles of a noble cause. The fighting isn't just for the sake of fighting but as a means to find a resolution. When two factions disagreed, they structured combat to resolve the issue. Rather than risk the health of entire armies, each group picks one champion and sends him or her as their representative. Knights wear bulky, ceremonial armor designed to signal the angels by catching the sun and to show off the knight's sigils rather than to protect them  - even wearing no armor on their backs, as striking an opponent from behind is considered dishonorable. Bant is a land of high castles on rolling meadows.\nThere are five nations on Bant: The Inner Three on the savannah. Akrasa Eos Topa Valeron , the coastal nation. Jhess , the island nation. The Sun-Dappled Court , containing the Twelve Trees of Valeron under which the Sword of Asha was buried. The Cathedral of Bliss is a vast temple of glowing marble and light that floats in the sky. It is ruled by the angels of Asha . Serul Cove , a coastal city where rogues peddle stolen sigils. The Cormorant Stele Giltspire Castle , destroyed by Gwafa Hazid to uncover the Obelisk of Bant . Bant has a strict caste system, everyone has a specific role in society. One's caste is determined by birth, but it is possible to rise through sigils. Pretending to a higher caste is punishable by imprisonment while taking on a lower caste role results in a loss of caste to that level. Paragons are individual heroes who embody pure ideals, including honor, truth, duty, justice, and order. Paragons are respected regardless of caste, and anyone in Bant can aspire to become a paragon. The Blessed are the nobles of Bant, who are allowed to interact with the Angels . Many believe that when Blessed children are born, they will become angels as long as they don't fall into decadence or lawlessness. Clerics and monks make up the caste of the Sighted . They have to obey orders from the Blessed, but otherwise, they do not have to answer to anyone. A spiritualist and clerical caste that includes many ascetic rhox monks. Strangely, the angels and the Sighted have no special relationship. While the angels are seen as spiritual beings of great importance, the Sighted feel they have their insights into such things and don't rely on the authority of the angels in the same way as the other castes. The Sigiled knights are measured by the number of Sigils they gained through their actions. The Mortar make up the bulk of Bant's population. They have to follow orders from the three castes above them but may rise to the Sigiled caste. The Mortar are considered to be the keepers of common sense, as a counterpoint to the spiritual abstraction of the Sighted and the strictly coded existence of the Sigiled. The Unbeholden are thieves and rogues — those who, without Letters of Marque, forcibly take personal possessions from others. The Unbeholden are often victims of circumstance or rebels who reject the caste system, but there are few truly vicious men and women among their ranks. Many families have one member who is part of the Unbeholden. Often their exploits are chronicled in fables meant to illustrate the importance of virtue and hard work and the consequences of the lack of discipline that can lead to life as an Unbeholden. Jhess is the nation with the most Unbeholden. Acts of extraordinary nobility and courage are rewarded with sigils, coinlike magical medallions bestowed upon worthy souls by patrons. Royal houses, nobles, knightly orders, towns, monasteries, angels, and even a few remarkable individuals can grant sigils to signify their support for someone. They signify the support of the group or, on occasion, the individual that gave it to the wearer. A sigil is both a prize of honor and a bond of duty. The one who bears it may be called to fulfill that charge at any moment. A few sigils can be bought, and stories tell of tainted \"dark sigils\" that disappeared from the shard when the demons were cast out. All sigils empower their wearer. In-game, they appear both as artifacts and as auras . Known sigils include: Mark of Asylum The sigil of the city of Serul Cove, granted to their sea captains. It grants the bearer free passage into the cove and the protection of their modest navy while in their waters. Sigil of Asha, given to Rafiq when he was Knight-General. One was also built into the crossguard of the Sword of Asha . Sigil of Distinction Sigil of the Empty Throne , marking the champion of the archangel Asha. Given to Rafiq. Sigil of the Grand Laurel, awarded to Rafiq. Sigil of the Nayan Gods , created after the Conflux brought Bant's knights to Naya . Sigil of the New Dawn The sigil of the Order of the Skyward Eye Sigil of the Salted Wind, a Jhessian sigil awarded to Rafiq for resolving a dispute between the ship patrols and the island aven by defeating Mubin in the arena. Sigil of Valor , awarded to Gideon Jura . Sigil of the White Orchid, given by the Order of the White Orchid for unwavering commitment and unflinching strength. Smile of Jhess, available only to members of the royal family of Jhess, though rumor has it that Lisha has bestowed the sigil upon a few paragons that have earned her favor through acts of compassion or charity to the poor. Truth, earned by a decade of dedication to the so-called Ideal of Greatest Weight. Whoever bears the sigil becomes physically incapable of lying. A sigil of patronage from Eos bearing Rafiq's likeness The Grand Caravan, the world's greatest convoy of leotau -pulled trade carts and carriages, ranges all over Bant's five nations. It is led by Gwafa Hazid . Long ago, a council of archmages put a complex enchantment on Bant, allowing mortals who died on the shard to reform as angels. As long as any mortal conformed tightly to Bant's ideals, the light of their soul would transubstantiate into an angelic state, joining with what are called \"meta-sigils\" that are described as physical manifestations of the land and sky. These angels, mortal themselves, lend guidance to other mortals, but otherwise, they do not directly interfere with their lives. Some Mortar-caste folk believes Bant 's aven are related to the angels , and the aven themselves believe they are creations of the angels, though no angel confirms this. The ruler of Bant once was the supreme queen of the angels, the archangel Asha , who gave her life fighting the demon Malfegor long ago. No angel has assumed her title since her demise. Among angels, there is a hierarchy with four different ranks: The Asura are the highest-ranked angels. There are only seven of them, which make up the Court of Orderly Contemplation . The Amesha represent ideals, such as honor or justice. The Mahra carry out the orders of the Asura and the Amesha. Celebrants , as the lowest ranking angels, are responsible for protecting the lives and ideals of mortals. The major knightly orders are active in all the nations of Bant and provide a culturally unifying force. In general, members of an order will resist fighting one another, even when their kingdoms are at war. Bant's knightly orders are: The Knights of the Reliquary The Olive Branch, a knightly order based in Eos that seeks to broker peace and smooth the relations between all the nations of Bant. The Order of Dawnray The Order of the Skyward Eye The Order of the White Orchid The Wayfarers' Friends, who patrol the roads of Bant, keeping them safe from bandits and monsters. They maintain way stations in uninhabited areas and are the favored knightly order for Mortars who venture out to see the world. Human monasteries on Bant are both militaristic and spiritual, and monks divide their time between meditation and martial pursuits. Each monastery has a liturgy based on the martial art, Halcou, and monks practice this highly stylized combat system using a variety of single-handed weapons. Typically, monks commit to vows and prohibitions, such as a vow of poverty or a vow against deceit. Some of these vows become quite extreme, such as a sect that takes a vow of motion. They walk until they collapse in exhaustion only to get up and begin their endless journey again. Many rhox monks are ascetics, seeking religious inspiration through meditation and solitary life. If a religious dispute between a human monk and a rhox ascetic can't be resolved through debate, it may become a physical challenge. On an open field, each challenger demonstrates their spiritual fitness through elaborate displays of Halcou. While there is no \"winner\" of such displays of athleticism, the unspoken agreement is that the challenger with the most grace and skill has the deepest philosophical understanding of the issue in question. Huge stone obelisks called steles dot the lands of Bant, focusing and channeling the energy of the land itself. Major forts are built around steles, and the magic from the obelisks seeps into the architecture and instills it with the strength of the surrounding countryside. Steles are inscribed with detailed pictograms that illustrate a cycle of myths, and the art of carving the steles is a common rhox profession. Since very few humans have the strength to work the dense rock, rhoxes view themselves as the keepers of the myths and the only race to truly understand the symbolic meanings of the stories. One of the most famous steles sits on a peninsula of blue-tinged rock that juts into the rough ocean north of the port of Serul Cove. Known as the Cormorant Stele, it’s engraved with massive seabirds engaged in battle with a sea monster. Rhox monks who make pilgrimages to the great stele swear that they return home with increased vitality and prowess in battle. During the Conflux, red mana from Naya and black mana from Esper flooded into Bant, creating havoc. The Order of the Skyward Eye created mistrust in Bant, resulting in panic. The armies were disrupted, and the communities fell apart. The angels no longer could keep Bant under firm control, as strange creatures and plants spread across Bant, and even creatures from Grixis and Jund appeared, slaughtering entire settlements with ease. Although the army of Bant fought the invaders, it was clear that the opposing beasts and fighters were weakening Bant. Bant would no longer be as powerful as it was. Its borders merged more and more with the other shards until it became part of New Alara. Following the invasions, the once shining castles of their lands lay in ruin, dangerous places to venture to. Society as a whole had been shattered, and isolated pockets of settlements still fall prey to roving bandits and worse. Alara as was targeted by Elesh Norn 's Machine Legion as part of New Phyrexia's Invasion of the Multiverse with a simultaneous strike on Bant, Esper, and Jund. As the invasion was beginning Tezzeret sent a warning message to Rafiq, as the Knight-General of Bant, to employ the angels against the Phyrexians . At some point during the invasion, the Maelstrom itself awoke to fight on behalf of Alara. Elspeth Tirel Lisha of the Azure Rafiq of the Many Gwafa Hazid Ajani Goldmane Elspeth Tirel Gideon Jura Nicol Bolas Bant was concepted as \" Camelot in the savannah.\" Associated cards: Quoted or referred to: A Planeswalker's Guide to Alara Magic Arcana (August 12, 2008). \" Shard Preview: Bant \". magicthegathering.com . Wizards of the Coast."}