{"text": "The Blackblade (or Black Blade ) is a mystical soul-drinking weapon created by the blacksmith Dakkon after the planeswalker Geyadrone Dihada promised him the power of a god. It is also known as the Soul-Drinker . Dakkon and the Blackblade Geyadrone Dihada had given Dakkon ten years for the creation of the finest sword ever made. Dakkon knew that, for the task, his craft alone wouldn't be enough and that he needed the magical power of sacrifice. At first, Dakkon spilled only his own blood in sacrifice to the forging of the sword: the blood was seared by the flames and grafted the power of Dakkon himself into the weapon. The sword, however, needed not only blood but life itself. After two years passed, the work was not going well and Dakkon knew that more needed to be done. He called to his side his young son, Daron, and as he pulled the sword from the forge he told his son to close his eyes. When the boy did so, Dakkon plunged the white-hot metal into his own son's chest. The boy's blood, soul, and energy were drawn from him and pulled into the sword. Dakkon held the sword before him and saw that this was only the beginning since the work would require many, many more lives to succeed. In the following years, Dakkon slew countless slaves, buying them from among the worst villains in Corondor . Each one fed the sword with their blood, soul, and energy, making the sword ever stronger. When Geyadrone received the Blackblade, she found out that the sword was truly the most excellent weapon ever wrought by human hands. The real weapon she was seeking, however, was the ultimate warrior: Dakkon himself, honed by years of work spent on the blade and by the callous acts he performed in the decade before. After giving him the promised power, she stabbed Dakkon's shadow on the ground, treacherously stealing his soul with the sword. In this way, she was sure that the warrior would follow her among the planes to exact his revenge, becoming in the meantime ever stronger until Geyadrone would need his services once again. The Blackblade was later used by Geyadrone's servant, Sol'Kanar the Swamp King until Dakkon took it back. When Dihada summoned the Elder Dragons Piru and Chromium Rhuell to attack Dakkon, he stabbed Piru with the Blackblade, killing her. This released a massive energy blast that created the Dueling Chasm of Golthonor . It also allowed Dihada to absorb the power of Piru's soul, which had been her plan all along. With this power, Dihada managed to \"tag\" Dakkon, binding him to her will. Left without a way to exact his revenge, Dakkon and the Blackblade traveled to Terisiare together with the ancestor of the Carthalion bloodline. Gideon wielding the Blackblade It is unknown what happened later, but the sword was reforged and - probably during the Rift Era - came into the possession of Korlash , possibly a descendant of Dakkon. Later, around 4560 AR, the Blackblade, apparently still on the Terisiaran island of New Argive , would come into the possession of the Cabal minion Needle . The origins of the sword were rewritten by the Cabal to having been forged by the Cabal's new leader, Belzenlok . When the Weatherlight crew learned of its existence, they devised a plan to slay the Elder Demon with the blade. Gideon Jura stole the Blackblade from the Cabal's vaults and took it up against Belzenlok, but found himself outmatched in swordplay and thus unable to actually strike the demon with it. However, Liliana 's taunting of Belzenlok allowed Gideon to lodge the cursed sword into his leg, at which point Liliana grasped its hilt and activated its curse, draining Belzenlok's soul. Afterwards, Gideon kept the Blackblade, in preparation for the Gatewatch 's looming fight against Nicol Bolas . When Gideon arrived on Ravnica for the final confrontation with Bolas, he and his fellow planeswalkers were trapped due to the Immortal Sun . He fought in the vanguard of the troops defending the plane against Bolas and his invading Dreadhorde . When confronted by Rhonas , Gideon stabbed him in the eye with the Blackblade, draining the God-Eternal into a husk that quickly crumbled into dust. Gideon used the Blackblade to attack Bolas and struck the Elder Dragon in the head, but the sword broke against its flesh. Bolas revealed that he had enchanted the Blackblade in the past so that it would never be able to hurt another elder dragon again. Represented in: Associated cards: Depicted in:"}