{"text": "The Blind Eternities is a term commonly used by planeswalkers to refer to the space between planes in the Multiverse which is filled with chaotic energies, mainly the Aether but also mana and temporal energy. During the time of the Thran, this space was also referred to as the Corridors of Time , the Halls of Time , and the Bastard Plane . Only planeswalkers and the most powerful, godlike beings can enter the Blind Eternities and survive its rough environment. Karn described the Blind Eternities as an endless space that feels like crushed velvet, prickly and sometimes even painful, causing both a feeling of vertigo and a feeling that he wasn't moving at all. The planeswalker Jaya Ballard recalls that even ghosts may die in the Blind Eternities. The Aether takes part in summoning creatures, from which that creature materializes, or is pulled from . Much about the blind eternities is still unknown. There does appear to be some basic concept of being \"between\" two points in the Blind Eternities. However, according to Mark Rosewater , they are more like a doorway rather than a physical space. He argues that planeswalkers might experience the Blind Eternities and relate it to an experience they understand, experiencing it as a place while it isn’t one because it has no substance, area or locality. Nonetheless, it is possible for a planeswalker to \"explore\" the Blind Eternities in search of a new plane. Tezzeret 's Infinity Globes allow planeswalkers to interact with each other while in the Blind Eternities. The Eldrazi are unfathomable beings that exist in the Blind Eternities. It is not known if they were born there, or later adapted to survive its rough energies. Though inorganic material can pass through the Blind Eternities safely, unprotected flesh vaporizes in seconds. During New Phyrexia's Invasion of the Multiverse , Realmbreaker 's branches were capable of tearing paths through the Blind Eternities and opening the way for the Machine Legion to invade other planes. To the defenders, it was a terrifying sight. Each branch of the Invasion Tree was covered with thousands of seedpods, spiny vessels that transported the Machine Legion through the Blind Eternities. Seeking to protect the planes connected to New Phyrexia from its blast, Elspeth Tirel detonated a replica of the Golgothian Sylex in the Blind Eternities, potentially causing a Multiversal spark rupture . Planes can be closer or further from each other in the Blind Eternities, and it has been suggested that they may conserve momentum in the Eternities in a similar manner to outer space. When the Sundering of Alara , an extremely powerful outburst, occurred, the shards separated and continued to drift further apart over time. As an aftereffect of this blast, a phenomenon of aetheric rippling was observed in the Eternities. During the Conflux , the movement of the shards back toward each other was reacted to with surprise, and observers noted so-called \"streaks\" in the aether from the shards that didn't match with \"expected\" trajectories. In the Magic comic series, the Blind Eternities are depicted quite differently. They are described as a place where one's deepest desires are mirrored, comforting their mind, a stark contrast to the way they have traditionally been depicted. This was established in the very first issue, with no apparent attempt to date at explaining this contradiction."}