{"text": "Bo Levar , formerly Crucias , was an interplanar smuggler who transported goods across the boundaries of the planes. He was recruited by Urza as one of the Nine Titans and placed one of the soul bombs on Phyrexia . Before becoming a planeswalker , Bo Levar was a pirate known as Captain Crucias. Crucias was a Yotian sailor whose career was cut abruptly short due to an indiscretion with the daughter of a Sumifan admiral. Drummed out of the navy, he took to the life of privateering, rising to captaincy aboard the ship Backstab . Despite living as a pirate, he continued his dalliances with the admiral's daughter every time he was in port, and five years after his plans went awry, he suffered another shock. Returning to his ship after a night of carousing and brawling, a screeching wail awaited him aboard his ship. In his private cabin, he found a small infant wrapped in cloth with a note declaring her parentage. Half of his crew abandoned the ship within the hour. When he went to confront the admiral about his child, wandering the streets with the crying child, he was arrested for kidnapping. When the family was finally called, they disavowed any knowledge of the child's heritage, leaving her to fate's cruel hand. Crucias escaped from his cell and fled Sumifa with the girl. The next day, his remaining crew left him alone and adrift in the sea. Quite impossibly, for the love of his daughter whom he named Nunieve, he single-handedly crewed his ship to safety. Bo Levar firing a Prophetic Bolt ( Apocalypse ) He gave up his life of privateering, becoming an honest businessman, and eventually one of the richest sea captains on Terisiare. He bought a villa in the city of Kroog where he would dote upon his daughter any time they were not on the sea. However, his happiness would last only a scant 9 years. Nunieve developed a sickness that began to waste her slowly away. He spared no expense for the best chirurgeon, but the doctor could not cure her sickness. He held hope that someone could help, and until then he showered his precious daughter with gifts. Eventually, she began to refuse them as she became thinner and thinner, insisting he spent the money on things that would make him happy. On the eve of their voyage seaward to find a healer, Nunieve died in Crucias's arms. For years afterward, Crucias would dream of giving her a fitting memorial, Crucias spent the next 11 years building a ship in honor of his daughter, carving the figurehead in her likeness with his own two hands. It was built to explore the shores beyond Terisiare, but shortly after it was finished, Mishra sacked Kroog and destroyed the nation funding his explorations. He turned to Argive to pay for his ship, but it had not been built for cargo and he lost more than he made with each voyage. Desperate, he began his \"Expedition to the End of the World\" for the rich bloodthirsty nobles of Argive. He exploited the deaths of thousands for the entertainment of the few as he moored outside Argoth and watched as the armies of Urza and Mishra tore themselves apart. He hated his passengers, he hated making money watching people die, and he hated himself for what he was doing to Nunieve's memory. And then Argoth was gone. As he and his passengers watched, the Sylex Blast devoured the island itself in light. Less than a mile from shore, Crucias's ship was caught in the blast, and that was the end of Crucias's tale. Yet, the beginning of Bo Levar's story. Bo Levar and Urza . Urza approached Bo Levar early on in planning his Nine Titans . Along with the rest of the Titans, Bo Levar assaulted and captured the caves at Koilos , effectively ending the first phase of the Invasion . The next step was an attack that would destroy Phyrexia itself. They made slow progress down the spheres, suffering casualties due to Tevesh Szat 's treachery. When Urza drained Tevesh Szat to power the soul bombs, Levar railed against him, as Urza had anticipated Szat's betrayal, and indeed had planned for it to charge the bombs. As the artificer slid down the halls of dementia, slowly beginning to sympathize with Phyrexia, Taysir began to take charge. Urza used the same failsafe and destroyed Taysir. The remaining planeswalkers mutinied against Urza and Levar led the last titans to plant the bombs and destroy the plane. After their return to Dominaria , he discovered that Commodore Guff already knew how the Phyrexian Invasion would end and convinced him to change their destiny. Levar used his very essence to cast a spell shielding a small colony of merfolk called the Eliterates from Yawgmoth 's death cloud. He gave his life in appreciation of beauty, and his final thoughts were that it was a worthy death. Dominaria Phyrexia Depicted in: Quoted or referred to: Magic Arcana (September 03, 2009). \" Who's That Planeswalker? \". magicthegathering.com . Wizards of the Coast."}