{"text": "Calix is a Theran Nyxborn Human and former Planeswalker . Calix appears as a muscular young man with short-cropped black hair. He was created by Klothys , the god of Destiny, to reweave Elspeth Tirel into the pattern of Fate. He is a patient master tracker with a one-track mind. His powers over fate not only help him influence the future but also allow him to read the past. Despite this, he fears the unknown of when he finally captures his quarry, as he will then have no purpose. He wields flying needles and threads of destiny. Calix is a Nyxborn so it is possible to see fragments of Nyx 's night sky in green tones on his body. He has access to white and green mana . Calix Key Art Klothys was furious when countless souls escaped the Underworld during the war of the gods. She dispatched countless Agents of Fate to stop these souls from seeking a new life. But for Elspeth's, a Planeswalker's soul, she needed something special. So Klothys weaved her masterpiece — the Agent of Fate called Calix. Created solely to carry out the will of Klothys, Calix headed off in pursuit of Elspeth to preserve that which should be. On her way to the exit of the Underworld, Elspeth clashed repeatedly with Calix, emerging victorious every time. After all, she was a seasoned warrior, and he was freshly made. But with each battle, Calix did a little better — he was learning his foe as he learned himself. Still, she defeated him one final time as she reached the exit where Heliod awaited her. When Elspeth managed to defeat Heliod, she was granted life by Erebos out of gratitude for her defeating Heliod, and planeswalked away. Calix's very being was in agony over the impossibility of his purpose, until he sparked and planeswalked after her for their destined confrontation. Calix sleeps to regain his strength, and when he sleeps, he dreams of the battles he's fought with Elspeth, studying every move to devise the perfect counter. He fears his own success, knowing that once he takes Elspeth back to Theros' Underworld, his purpose will be fulfilled and his existence will cease. Although Elspeth has continued to be elusive, Calix may soon find himself tracking another who defied destiny . During New Phyrexia's Invasion of the Multiverse , Calix returned to Theros before losing his spark in the Great Pruning . Calix in pursuit of Elspeth through the underworld. Calix is artificially created and artificial creatures normally can't be planeswalkers . As such, it is currently unknown how Calix has a spark, but according to Mark Rosewater he created his spark. It is implied that his spark ignites because his entire purpose, his existence, is dedicated to the pursuit of Elspeth. Since belief and desire can reshape reality on Theros, it's possible that Calix was able to planeswalk to fulfill his purpose. If so, it's unknown what happens to his planeswalking abilities outside of Theros; for instance, when Kiora took Thassa 's bident out of Theros, it lost its Nyx qualities, but wasn't completely depowered. Theros Elspeth Tirel Depicted in:"}