{"text": "Capenna is the plane on which the metropolis of New Capenna is located. New Capenna is the plane’s only major settlement, as the rest of the plane was devastated by invading Phyrexians and is largely uninhabited. Elspeth Tirel on her home plane The people of New Capenna act like there was no history before the city; they're wrong. There was a plane out there centuries ago, one of many cities, kings, cultures, and wonders. That Capenna, Old Capenna, is gone, lost in a cataclysmic war against a forgotten enemy — the same war that prompted the creation of the towering city. The city of New Capenna is centuries old, at least older than the Phyrexian Invasion of Dominaria . Its inhabitants have little memory of its past, perhaps because the demons didn’t want people to remember it, or because people simply forgot the details over generations after fleeing from Phyrexian invaders. Elspeth grew up in an encampment of Phyrexian holdouts, long after their initial invasion. Her life immediately before her ascension was spent as a prisoner along with many other beings, locked tightly away and tortured. In this prison, the Phyrexians of her homeworld tended to those of their numbers they felt insane. Elspeth and her peers were a distraction meant to soothe the insanity of the flawed Phyrexians. When her dark warden came for her, she responded instinctively with a powerful spell and planeswalked away to Theros . She was only 13 at the time. After leaving Theros , Elspeth met with Ajani Goldmane who told her where to planeswalk to find her home plane. Arriving in New Capenna, she felt out of place as the plane was nothing as she imagined it. Vivien Reid claims the plane outside of the city is essentially dead, devoid of life and nature. Several centuries before the modern day, Capenna was a plane of chivalry, castles, and fantastic beasts, similar to Alara 's Bant . The predecessors to the five families served in different roles. The Maestros served as the plane's nobles and art aficionados. The Riveteers made up its artisans, blacksmiths, edificers, and architects. The Cabaretti made up a popular druidic faith. The Obscura served as mystics, wizards, and advisers to the plane's Angels. The Brokers were paladins. One of the deities worshiped on the plane was Serra . Sometime before the Phyrexian Invasion of Dominaria , a single Phyrexian ship invaded Capenna. When the invaders attacked, they ate hope, turned children's parents against them, and poisoned the plane for millennia. Their invasion was successful for the better part of a year. It was only through the intervention of Capenna's archangels and their hosts that the plane's mortal defenders stood a chance. Allied with these divine warriors, Capenna's defenders managed to hold a small pocket of land, encircled but defiant against the end. The Phyrexians sent their forces again and again against the spears of Capenna's final defenders, and though the angels and mortals held, it was plain to the archangels that they could not win. The enemy's numbers were inexhaustible; in addition to their knights, the enemy added the mortal dead to their number, sending the animated corpses of fallen defenders to fight against their comrades. To save the people of Capenna from total defeat, the archangels turned to an old, familiar enemy: the archdemons. The angels had become consumed with the defense of the plane, and it had become clear that the demons needed to join the fray as well. This unlikely deal laid the foundation for a new place that would hold the plane: a fortress that became a city, which the people called New Capenna . Denizens from the rest of the plane migrated to the city in two exoduses before the Riveteers tightened up immigration. The allied forces of the archangels, mortals, and archdemons were the last to enter the city, after holding open corridors for refugees to stream into the lower elevators. The enemy never stopped. Legends tell of the last battle of the war being fought on the final elevator, with allied soldiers throwing enemy knights off the rising platform as it approached the underbelly of the city. The enemy rebuffed, the last elevator arrived, and New Capenna was sealed to all below. With the surviving population of the plane safe inside New Capenna, the archangels, and archdemons let the people celebrate. However, the archangels could not find joy, as they knew a dark truth. This tower, for all its might and defiance, would still not be enough to stop the Phyrexians. Though well-defended and difficult to access, if the enemy could find a way inside, which they would never stop trying to find, the war would rage here as it did far below. Thus, the city's architects puzzled over a stark question: how could they guarantee the safety of the city and the plane upon which it stood when they were so grossly outnumbered? While the archangels puzzled, the archdemons of Capenna plotted. During the war, Capenna's archangels and their angelic hosts ravaged the enemy with their mere presence. The archdemons studied this divine natural weapon and realized that if they could trap angels and distribute their essence across the whole of New Capenna — maybe even out into Old Capenna — they could drive the enemy back and ensure the city and their people would be saved. Alone, though, they could not accomplish their betrayal, so the archdemons sent their whisperers to the ears of mortal, power-hungry Capennans, planting a bleak answer to the question of the future: trap the angels, and let an age of demons begin. However, the plot against the archangels could only be accomplished through the archdemons' mutual sacrifice. The archdemons appointed five families to rule the city in their name, drafting a contract with the head of each family and conferring demon status to each signatory. The five became demonic hybrids, gifted and cursed by the archdemons bound to them, their vices magnified and powers enhanced. Together with their archdemon patrons, these demon hybrids and their followers took advantage of a sudden slumber that struck the Phyrexian forces — likely caused by the death of Yawgmoth on Dominaria — to act on their plan and achieve success beyond their most optimistic projections. In place of a prolonged battle, the archdemons and the five captured the archangels and their hosts during a city-wide celebration of victory. While the people were told the archangels had voluntarily sacrificed themselves to send the enemy into a slumber, the five and their organizations, their families, suppressed the grim truth: that the archdemons had used the angels in the defense of the city, trapping them in a kind of stasis that saw their physical bodies converted, slowly, into the fuel of the new age: Halo . The Demon Lords used the Halo to defeat the Phyrexians and then disappeared themselves. The five families settled in to dominate niche industries and command territory in the city's three boroughs, operating in full view of each other and also in secret. A nominal, all-but-vestigial city government ensures the lights stay on, the water is clean, and the streets are kept in good repair. Law as other planes know it — a crown or government and a police force, with hard rules and penalties for those who break them — does not exist in New Capenna. Instead, there is an agreement, a code agreed to by the five families. Fronts, subterfuge, and clandestine operations are played out as mutually understood theater. They all do it, and they all understand that it is polite to try and hide their flouting of the rules, a nod to the fact that the rules exist. Flexibility, allowances, favors, and looking the other way are key in New Capenna: as long as no one family attempts to take too much for themselves, neither will the other families, and there is peace in New Capenna. During the events of Streets of New Capenna , the planeswalker Ob Nixilis infiltrated the plane, siphoning members of each of the families and hosting a targeted strike on their leadership on the night of the Crescendo , the plane's new year celebration. At least one boss, Xander , was killed, with Jetmir mortally wounded. After the sacrifice of Giada , possibly the last free angel in the city, the city's other angels began reawakening from their stasis. Capenna was a target in New Phyrexia's Invasion of the Multiverse . Atraxa herself was sent by Elesh Norn to lead the efforts of the Machine Legion against the Capennans. She was commanded to salvage the ship of the Old Phyrexians, scavenge any remaining Phyrexians for parts, kill all citizens and destroy the Halo wellspring. The Maestros and their vampires were the ones most vulnerable to compleation, as Atraxa's directive was not general compleation but to uncover the old Phyrexians, which the Maestros' museums likely had clues to. The Obscura, Riveteers, and Brokers fought in sparse groups, with the Cabaretti absent in action. The plane had no planeswalker champion to defend it but had the advantage of halo stockpiles as a ready-made chemical weapon. The gangs formulated a plan to collapse the structure holding Park Heights on Atraxa, killing her. With the stragglers manageable by the citizenry, the slowly-reviving angels entered the omenpaths to attack New Phyrexia. Finishing the fight on New Phyrexia, those that traveled to the plane could not return after its multiversal switch. New Capenna , a warded city built by angels on girders above the remains of the capital of an Old Capennan kingdom. The Outside / Old Capenna , the devastated plane around New Capenna. Walls have long since fallen, slumped into a pile of rubble. A girder of the upper city splits an ancient castle in two. Old Capenna can be reached via \"weak spots\" (hidden tunnels, ladders, gaps in the structure.) On occasion, new arrivals with old names ride the ancient lifts up from below, bringing with them stories of hard-lived lives and wasteland nightmares. Druidic, a language spoken by the Cabaretti's predecessors. Tagger's Scrawl , a symbolic language of unknown origin used by graffiti artists on the streets of New Capenna . Angels Avatars Aven Cephalids Demons Devils Dragons Elementals Elves Faeries Horrors Humans Leonin Ogres Phyrexians Raccoonfolk Rhox Shapeshifters Sphinxes Spirits Vampires Viashino Cats Dogs Fishes \"Miniature\"/\"teacup\" animals. Birds Blackbirds Corvidae Erithacus rubecula Pigeons - Touched by Halo, they are smarter than on other planes. Crocodiles Krakens Pegasi Phoenixes Plants Plant Dinosaurs Rats Rust flies Constructs Gargoyles Urabrask Atraxa Represented in: Miguel Lopez (April 28, 2022). \" Planeswalker's Guide to Streets of New Capenna \". magicthegathering.com . Wizards of the Coast."}