{"text": "Chainer was a pit fighter and a dementia caster for the Cabal under Master Skellum . As a cabalist, the name \"Chainer\" was a nickname, while his real (secret) name was Mazeura . Chainer was the first person known to have found the Mirari on Dominaria . Initially, he was able to resist its lure, but ultimately he became obsessed with it and was consumed by its power. Chainer was born in a small village in the salt flats on the outskirts of Cabal City . Little is known about his origins, but it is known that it was there that he picked up his phobia of snakes, which would become his dementia-summoning trademark. He also learned how to use the weapon that would become his namesake, the chain. Chainer was taught how to pit fight by an old, mostly-blind dementia caster called Minat , who suggested the chain weapon as it was unusual and thus would appeal to the crowds as well as also being powerful at range. He showed Chainer how to wield the weapon and how to use magic to enhance it, such as creating weights or spikes on the end to injure opponents and creating new links in the chain to allow Chainer to collar enemies. With time, Chainer learned how to create his chains solely through magic rather than needing a real chain. Minat also taught him the powerful Death Bloom spell, which Chainer would come to use on several occasions to slay superior opponents. As Chainer's pit fighting improved he moved to Cabal City itself to be trained as a true dementia caster. He was placed under the care of another senior dementia master, Skellum . The two bonded well, with Skellum taking on a paternal role while teaching Chainer the art of dementia casting. Chainer showed such promise that Skellum hoped that Chainer would become a true master of dementia, rather than just another pit fighter. One day during his early training, Chainer had by chance been exploring the older part of the city for fun when he felt strangely drawn to an old, ruined manor. He descended into its basement and happened upon the Mirari , which showed him visions of his greatness. Chainer resisted its call, deciding that such power was only fit for the First of the Cabal. As he traveled to the Patriarch's palace to deliver his find in person, Chainer was confronted by Order guardsmen including Major Teroh and Officer Baankis , who were inspecting people entering the city that they suspected had dangerous artifacts. Chainer fought them off before fleeing to the safety of a Cabal bar and contacting Skellum, who rescued him and had him taken before the Patriarch to present himself. Luckily, the risks Chainer had taken paid off as the value of Chainer's find and the loyalty he had displayed in taking it to the Patriarch rather than keeping it for himself earned him the First's favor. Chainer then spent most of his time training with Skellum, who showed him how to enter his dementia space and control the creatures there. However, Skellum’s training program was interrupted by the beginning of the three-day lunar games, in which the Mirari would be offered as one of the prizes. The Patriarch commanded Chainer to accompany one of the top competitors, the mountain warrior Kamahl , and show him how to enter the tournament. Initially, Chainer was unhappy with the assignment, but he soon befriended the barbarian as the two taught each other their ways. However, Chainer’s assignment was interrupted by a dragon attack on the city. As Kamahl ran to aid in the defense, Chainer’s mind went to the Mirari. He rushed to the vaults to protect the Mirari from any opportunistic looters. There he fought against a group of Order troopers, who killed his two fellow cabalists, including his friend Deidre . To defeat the soldiers and their limestone golem , Chainer tapped into the ambient power of the Mirari and unleashed the Death Bloom spell, shattering the golem and killing the Order troops. In the aftermath of the attack, the Mirari was given to Lieutenant Kirtar . Chainer protested about simply giving up such a treasure, but the Patriarch assured him that the orb would soon return to the Cabal, as all valuables eventually did. As Kamahl had left the city to chase the Mirari, Chainer resumed his dementia training. Under Skellum's tutelage, he learned how to control the horrors in his mind and transpose them into reality, attaining the rank of caster. After this, Chainer then returned to the pits to gain experience at casting under fight conditions. There he fought against Kamahl’s sister Jeska and mentor Balthor , where he lost his right arm when he was hit by one of Jeska’s explosive bolts. He recovered though, receiving an expensive artificial golem arm which was paid for by Skellum. Otherwise, his return to the pits was successful due to his skillful blend of melee fighting and adept summoning. After some time, the Patriarch’s prediction about the Mirari proved true. Chainer witnessed its return to the Cabal in the hands of Braids , following its catastrophic use by both the Order and Emperor Aboshan . At this point, Chainer was also reunited with Kamahl, who had been following the Mirari’s journey across Otaria. The two formed a pit fighting partnership that scored a record-breaking run of twelve consecutive victories but was broken when the First ordered them to throw their next match. This went against Kamahl's sense of honor and fair play, so he refused to fight and broke off their partnership, although the two remained friends outside the pits. Eventually, it was decided that Chainer had enough experience to reach the rank of dementist. Skellum arranged for Chainer and himself to go on the shikar rite of passage, where a caster would travel into Krosa to discover new inspiration for dementia beasts. However, the Patriarch felt that Skellum was now holding back Chainer’s progress and so arranged for the old master to die in a pit fight against an Order crusade squad led by Major Teroh. The plan almost worked perfectly, but Skellum managed to channel his experience in the fight to Chainer so he could bear witness to the Patriarch’s betrayal. Chainer was horrified by it and swore revenge against the squad. However, he still went ahead with his shikar , taking Kamahl with him instead. The ritual went smoothly, as Chainer captured amongst other things a wolf-monkey and a grendelkin in memory of Skellum. He also saw a vision of the Cabal‘s god Kuberr , which he took as a sign of his passing the trial, so he and Kamahl journeyed back to Cabal City in triumph. As they returned, Kamahl and Chainer were surprised to find Cabal City was under attack by the Order. They immediately joined the battle, where Chainer demonstrated his newfound powers by filling the central arena with dementia beasts that slaughtered the invaders there. With those losses, the Order broke off their attack and fled the city. However, Chainer could not take much satisfaction in his victory as Kamahl had been seriously injured in the battle. The Patriarch was most grateful for Chainer's intervention and granted him the right to use the Mirari. However, Chainer wanted to use it twice, once to heal Kamahl and once to fulfill an agreement with Ambassador Laquatus to create a new champion for the merfolk. To do both, the Patriarch insisted that he get revenge upon the Order's commanding officer for the attack. This happened to be none other than Major Teroh, so Chainer carried out his assignment with relish, slaughtering Teroh, his command corps, all the injured troops recovering in a Samite hospital, and most of the innocent healers as well. Upon his return, the Patriarch was true to his word and gave the Mirari to Chainer, who then successfully used its power to create Burke for Laquatus and also healed Kamahl by magically grafting snakeskin over his wounds. Laquatus was perfectly satisfied with Chainer's creation, but unfortunately, Kamahl reacted badly to Chainer's gift. According to his barbarian culture, an injured fighter should recover naturally and learn to fight without whatever he had lost. Kamahl chose to burn off his skin to be rid of the additions rather than become an outcast in his culture. His refusal to accept the Cabal's gifts ruined his and Chainer's friendship. Following his successful uses of the Mirari, Chainer became increasingly important to the Cabal and worked closely with the Patriarch. The First had been impressed with Burke and requested that Chainer make a second one to serve as the First’s bodyguard. However, this time Chainer decided to use the Mirari to get revenge on the last remaining person responsible for Skellum’s death—the Patriarch himself. He had made a deal with Laquatus to research the Patriarch’s secret name so that Chainer could weaken him, then used the orb to power an enormous Death Bloom that killed all of the Patriarch’s bodyguards and attendants. However, the Patriarch himself was immune to the spell due to his pact with Kuberr, which made him nigh immortal. Instead, Chainer had to settle by forcing him into exile in Aphetto . With the Patriarch removed and Chainer in possession of the Mirari, he took control of Cabal City and therefore fulfilled the Mirari’s visions. Chainer’s reign was a brief one. He presided over the Mirari games, but these descended into chaos when an Order justicar and three angels appeared during the opening ceremony and tried to take revenge for the murder of Teroh and the Samites. Chainer became infuriated at the chaos and idiocy that surrounded him and decided to rebuild the Cabal as he saw fit. He poured power into the Mirari to tap into the dementia space of almost every other dementia caster on Otaria and brought all the creatures he found there into existence inside Cabal City. Carnage ensued until Chainer was confronted by Kamahl, who tried to convince him to stop using the Mirari. The two former friends fought, with Chainer easily besting the still-injured barbarian. However, Kamahl managed to melt Chainer's artificial arm off, which caused Chainer to try to heal himself with the Mirari as he had done with Kamahl. The spell went wrong, with his arm first becoming that of an insect, then a fleshy lump. Becoming bored with it all, he attempted to reabsorb all the creatures he created with the Mirari into his body, but the Mirari’s power finally overwhelmed him, replacing Chainer’s entire body with a writhing mass of dementia creatures. The instability and pain of this form were far too much, and he gurgled (presumably) for Kamahl to kill him, who did so. Afterward, all of the horrors he had released disappeared back into their owners’ minds, while the Mirari now passed on to Kamahl. Associated cards: Quoted or referred to:"}