{"text": "Chandra Nalaar is a human planeswalker from Kaladesh . She is a member of the Gatewatch . Chandra has bright auburn hair and amber eyes. She stands at 5'6\" tall and weighs 130lbs. A highly gifted pyromancer , she is not one for subtlety or grace. Chandra is particularly good with fire and uses it to resolve whatever situation she might be in. She values ingenuity and improvisation with her magic. She is passionate, impulsive, and doesn't much like authority, as typifies characters tightly bound to red mana. Even though Chandra is proud of her independent nature, she also recognizes the volatile nature of her inner fire. She studied under Jaya to learn better control over her pyromancy. She can also conjure some fiery creatures – anything from adorable little embercats to massive flaming elementals and phoenixes . Although hotheaded, she cares deeply for those she calls friends and takes one's death as a personal failure on her part. Chandra is a planeswalker centered in red mana. When creating spells, Chandra's hair becomes flame and at times her eyes glow red. As she planeswalks, she disappears in a conflagration of orange and red flame. The act leaves a scent behind like the last wisps of smoke from a fireplace. Chandra was originally planned by the Creative team to be a pansexual \"hot mess\" and eventually be in a relationship with Nissa Revane . However, she was described as a heterosexual who likes \"big-muscled manly men\" in War of the Spark: Forsaken . Wizards of the Coast later released a statement on their website acknowledging the controversy and reception with the novel, and that Chandra's identity will be explored more in future stories. Greg Weisman also released an apology, stating that the mutual creative/editorial process with WotC and Del Rey was to blame for the final characterization of Chandra in the book. In the storyline of Midnight Hunt , Chandra seems to be smitten by the looks of the cathar Adeline . Chandra appeared on a Pride float in Secret Lair : Pride Across the Multiverse and was reconfirmed as pansexual in the drop's corresponding Digital Zine. The March of the Machine story fully reverses course on Forsaken's controversial characterization, by having Chandra share a kiss with Nissa after the latter has been cleansed of her compleation through Melira 's final act. Chandra's spark ignites when she is about to be executed by Baral Chandra was born on Kaladesh , with a \" mother who was strict , a father who was gentle, two sisters who [she] hated, and an older brother who [she] adored\" in her own words. Her brother was eventually killed in a war. Chandra began to practice and play with her newfound fire abilities to pass the time, and found that her fire talent came to her naturally. However, on Kaladesh, fire magic was strictly banned, and her parents pursued many ends in an attempt to \"cure\" their daughter of her powers. Knowing that the Consulate would arrest Chandra and her family for using fire magic, they left Ghirapur when she was eleven and went to another town that was smaller than their home to avoid attention. In an attempt to scare off her parents, she set off a huge blast of fire that caught several of the village huts on fire, before running away to the mountains. In her absence, the police of a temple on her plane rounded up the village, believing the people of the village to be a group of fire-magic-practicing rebels, as they did not believe that one person could cause such destruction. They placed the villagers into the burning huts where they were to be burned to death. Chandra returned in time to see her family burned, her mother crying for her daughters to be released, and fought against the soldiers until the entire village had burned to death, at which point she surrendered. She was forced onto her knees, her head held back, and a blade swung to her throat, her punishment immediate execution.\nThis traumatic moment ignited her planeswalker spark, sending her to Regatha . However, the story Chandra told Gideon was not the entire truth. In truth, she was an only child and her parents were inventors who secretly trafficked a controlled substance, the mystical Aether , to those who needed it. The fire in the village wasn't lit by Chandra, but by the soldiers of the Consuls, who were persecuting her. She wasn't punished at the village, but taken to the City of Ghirapur, to be executed in an arena. The bladebearer turned out to be Baral , an officer who secretly had (anti-fire) magic of his own. Quite some time after the events in her past, Chandra journeyed to Aretopolis on the plane of Kephalai . There, Chandra stole a scroll known as the Dragon Scroll from the Sanctum of Stars . She was pursued by a Watch Commander, his men, and a pair of gargoyles . They attempted to execute her but she managed to get away using a large fire spell. Since her body was not found, they considered the matter closed, but later investigations re-opened it. The magistrate turned to the Infinite Consortium to retrieve the scroll, and Jace Beleren was assigned to track the thief, and erase the memories of anyone who had read it. He managed to find Chandra on Regatha where she was studying at Keral Keep . Jace confronted her and a fight broke out. Jace gained the upper hand and left after completing his mission. However, Chandra had given the scroll to the scribes in the monastery who were making copies of it before Jace arrived. The battle between Chandra and Jace is also covered in the first chapter of The Purifying Fire . Young Chandra training at Keral Keep monastery, plane of Regatha Chandra, right after her first planeswalk, has come to live on a plane named Regatha, where she has been studying at the Keral Keep monastery in an attempt to learn better self-control and mastery of her powers. The monastery was founded ages ago around the beliefs of another fire-wielding planeswalker, Jaya Ballard . Her quotes and teachings are the core of the Keep's beliefs, championing personal freedom and individual choice over all other things, as long as one was not infringing on another's rights. Gideon and Chandra vs. the Order Chandra became entangled in the politics of Regatha when the Order of Heliud begins a series of events put into place that had begun to enforce its rule over the lands of Regatha, starting with the plains, then moving to the forests, and ideally to the mountains where Keral Keep rests. The Order declared that fire magic was to be punished by death in the cities, and creature summoning, traditionally a way to resolve disputes in the Western Woods, was illegal as well. With that in mind, the allies of Keral Keep in the woods sought to consult the monastery. After attempting to chase away a specter that served the Order, she set fire to a large portion of the forest and angered a tribe of ouphes who put a price on Chandra's head. The leader of the Order, Walbert, used this event, and an attack on his soldiers, as an opportunity to order Chandra's capture. Mother Luti, head of the Keral Keep mages, decided that because of the attention drawn to her, it would be a good time for Chandra to \"disappear\" for a while, and sent her on a quest to retrieve the scroll that Jace had retaken, stating that the true meaning of its words might not be in the words, but in some sort of physical attribute of the scroll itself. Heeding Mother Luti's request, Chandra once more 'walked to Kephalai. Her attempt to retake the scroll failed and her attack on a group of soldiers caused the entire Sanctum of Stars, a museum of artifacts and rarities of great power and value, to be destroyed, killing all those inside. During her flight, she encountered a man named Gideon , who seemed at first to want to help her, but turned her over to the soldiers of Kephalai. After her captors tried to torture the location of the scroll, which she had lost during her flight, she managed to escape from the dungeons of Kelaphai, blindly 'walking to a plane ruled by a vampire and shrouded in eternal night. Much to her surprise, none other than Gideon arrived shortly after her. Eventually enlisting the help of Gideon himself, she sought to find a way off of Diraden , whose only source of mana was black. During this time, Gideon reveals that the plane of origin of the scroll is none other than the mysterious plane of Zendikar , where he claims that mana and magic act in powerful, but erratic ways. Unfortunately for the pair, the inhabitants, though malnourished and mistreated, had grown treacherous after years of exposure to the mana, and they were both captured by the ruler himself, Prince Velrav . Chandra awoke in the Prince's private chambers, and she was shown the torture Gideon was undergoing. Eventually, she concocted a plan of escape with Gideon that culminated in the death of Velrav, freeing the plane from its eternal night and restoring the flow of mana. Together, they returned to Regatha. Her return was not met with good news, though, as the plane had fallen further under the rule of the Order. Gideon revealed that he was an agent for the Order, which was a multiplanar organization, promising to bring \"peace, order, and law\" to the multiverse. After leaving him and getting to Keral Keep with the aid of allies from the forest, the Keep was laid under siege with the condition that she had to be surrendered to them, which not a single one of the free-thinking fire mages was willing to do. The entirety of the Keep valued the idea of individual freedom to the point that they would not dare infringe on Chandra's even if it meant their deaths. She eventually decided to turn herself over, expecting to encounter an execution. Chandra's Fury What awaited her was far, far worse. Planning to use the Purifying Fire, an ancient artifact that \"cleanses\" a person's soul of their sins and imperfections, Walbert planned to strip Chandra of her fire magic, leaving her powerless, as an example to any who would dare stand against the Order. To Chandra, this fate was worse than death, and she asked Gideon to kill her rather than have her \"humiliated and put on display.\" Before she was brought to the Fire, Gideon speaks with her, and claims that she may be able to keep her power if the Fire accepted her, if she entered it with a \"clean soul.\" She tells him of her history and how her actions led to the death of her family in a painful fire and the destruction of her entire village, something she had been running from and what had been causing her nightmares ever since. She declared that she doesn't know \"what clean is, but I do feel better\" after her confession. Walbert, on the way to the Fire, explains that he has seen Chandra in his visions, that she is a cataclysm that will bring an era of lawless madness to Regatha, which is why he aims to stop her and secure his rule, believing that when a planeswalking fire mage is stripped of her power, the rest of the Keep will fall into place. The Fire, however, accepts her as she enters it with a clean soul, removing all the wards and shields placed around her by Walbert. She faces her past, her mistakes and victories, her successes and failures, taking them all for what they are and nothing more, no longer running. When she emerged from the Fire, she feels infused with more focus than ever, and decimates the Order's forces around her, burning Walbert and many others to death and cracking the very foundations of the cavern. She is knocked out when the chamber around the Fire collapses. Gideon wakes her up, harshly chastising her for leading to the deaths of all the members of the Order, yet she feels no remorse for taking down what they believed in. She decides to leave the plane of Regatha forever, and seek out the mystically powerful plane of Zendikar. Before she leaves, though, she tells Gideon a part of her story that she had held back the night before: that the soldiers that so brutally ordered the death of her village at the slightest false provocation belonged to an order that promised to bring \"harmony, protection, and law,\" leaving him to ponder the revelation of his allegiances and what the Order he belongs to has done. She tells him that should anyone proclaiming the virtues of the Order (and by extension white magic) cross her path, she would treat them as her enemies without remorse. With that, she leaves, seeking Zendikar. Chandra uses ghostfire in the Eye of Ugin Chandra arrived on Zendikar, roughly three years since her quest began, and sought out a guide to the region of Akoum in the area of Affa Town. Her exact goal was to seek the assistance of the ruin sage Anowon , hoping that he could shed some light on finding the Eye of Ugin . After repeated failures on the part of her guides, and more than a few gold coins, she finally managed to track down the League of Anowon's current campsite high in the mountains. She confronted Anowon there and after a brief and tense exchange, Anowon agreed to lead her. Unfortunately, Anowon proved to be a backstabbing traitor. He attempted to kill her in her sleep, but she rebuffed his initial assault. Anowon ranted at Chandra and claimed that she has no right to the scroll he wanted and continued his attack as her magic gave out. Luckily for Chandra, Sarkhan Vol ambushed Anowon, rendering him unconscious with a swift strike to the head. Though Sarkhan had saved Chandra, he threatened her for intruding into the Eye of Ugin. Chandra then attempted to cast a spell, which backfired but was sufficient to impress Sarkhan. He led her further into the Eye and began to explain to her the nature of what she was searching for. It was not what she was expecting, and as she attempted to leave Sarkhan wheeled upon her, changing fully into a dragon. Left without her usual magic, she received assistance from the unexpected source of Jace Beleren. With his encouragement, she cast a fire spell that could not be seen. It was enough to down Sarkhan, and as a side effect, Jace as well. She momentarily considered killing Jace simply because he continued to show up, but she instead woke him up. They had a brief exchange in which Jace questioned the motives of the mysterious individual who had told Chandra of the scroll to begin with. She ignored him and walked away, planning to exact some measure of vengeance on the person who had gotten her involved with the scroll. After leaving Jace behind, Chandra bounced from plane to plane searching for clues as to who Ramaz was. He was the one who had manipulated her into stealing the Dragon Scroll and she intended to seek her vengeance. Knowing just enough about her target, she tracked his progress across multiple planes, often retreading old grounds that she had visited in the past. Her final goal was finally met on the plane of Kaldheim where she confronted the insane shaman . After a skirmish, he escaped, revealing that he had only been a minion in a yet greater scheme, subservient to the mysterious dragon whose voice he followed. Chandra returned to Regatha and studied pyromancy at Keral Keep for a considerable time. After her mentor died, she was elected to become the new abbot. However, the ceremony was interrupted by Jace Beleren and Gideon Jura. Both men attempted to convince her to follow them to help in the fight on Zendikar, but a frustrated Chandra who was angry at continuously being compared to Jaya Ballard chose to stay. She knew that Jaya would have helped them but she was sick and tired of being compared to her. After rejecting Jace and Gideon, who were both disappointed with her choice, they told her to come to Sea Gate on Zendikar if she changed her mind. Her choice made, Chandra returned to her meeting to reluctantly become the newest head abbot. While she tried her best to settle down, vivid memories of Zendikar's grand landscapes and the bitterness of her manipulation at the hands of Nicol Bolas still burned brightly in her mind. Chandra intervenes in the retaliation of Ob Nixilis, and saves Nissa, Jace, and Gideon After some time, Chandra couldn't resist peeking at what her friends on Zendikar were up to. She arrived just in time to witness the failed attempt to imprison Ulamog and the return of Kozilek . She followed the demon planeswalker Ob Nixilis who had taken Gideon , Jace and Nissa prisoner. She managed to free them, and through a concerted attack they finally scared the demon away from the plane. Oath of Chandra - “If it means that people can live in freedom, yeah, I’ll keep watch.” The four planeswalkers realized that they were helpless against large threats on their own, but that they could stand against just about any force in the Multiverse by working together. Thus they swore an oath to stand together and the Gatewatch was created. Seeing that he could not keep his promise to Ugin to not harm the Eldrazi nor allowing them to escape from Zendikar, Jace decided to slay the Titans with the Gatewatch's and Kiora's help. After consulting with Nissa, he described the Ley Line pattern to her that would bind Kozilek and Ulamog to Zendikar, drawing the bulk of the Titans into the plane so that their energy could be dispersed into Zendikar, killing them in the process. To attract them, the remaining forces of Zendikar's defenders would pose as bait. While the plan worked at first, with Gideon keeping the Eldrazi swarms away from the army, Kiora clearing out any other swarms, and Chandra supporting them, once the Eldrazi titans were anchored to Zendikar, their destructive essence threatened to assimilate Zendikar into themselves. Afraid, Kiora tried to persuade Nissa to release the Titans and allow them to flee, but Jace objected. Chandra offered to burn the Titans instead and after preventing Kiora from attacking Nissa, Jace agreed. The pyromancer then connected with the animist, allowing her to channel her pyromantic magic through Zendikar's Ley Lines directly into the titans. In one brilliant blaze of flame, Ulamog and Kozilek were incinerated and destroyed, leaving only ashes raining from Zendikar's sky. After the defeat of the Eldrazi titans, Chandra stayed a while on Zendikar to recover from the physical onslaught caused by her massive spell on her body. Chandra arrived with the rest of the Gatewatch on Innistrad after Jace alerted them of the presence of Emrakul on the plane. During the battle of Thraben, they attempted to duplicate the feat they accomplished on Zendikar but failed due to the unfamiliarity of Nissa with the plane's ley lines and Emrakul's potent hold over large numbers of them. While battling Emrakul's hordes, they were saved by Liliana Vess . During the battle, Chandra was overwhelmed by Emrakul's psychic powers, forcing her to relive her spark's ignition on Kaladesh again. When it became clear that they could not destroy Emrakul, Chandra joined Gideon in defending the other members of the Gatewatch while they conducted the sealing ritual. Mother and daughter reunite Weeks later, Chandra was on Ravnica at the newly founded headquarters of the Gatewatch, when a Vedalken planeswalker from her home plane arrived and tried to engage the Gatewatch to defend the Inventors' Fair . Greatly upset, Chandra stormed off, at first trying to seek solace from Nissa, but eventually finding herself in the company of Liliana. Together with the older planeswalker, she returned to Kaladesh. Arriving in Ghirapur, the two began to search for renegades. Their search was interrupted when Liliana accosted a Vedalken guard. The pair hid in an alleyway, where Chandra discovered a mosaic of her deceased father. Liliana used the opportunity to invite Chandra to take revenge on Baral. During their continued search, they became witnesses of unrest where aether had been drawn from Ghirapur's systems. The blackout was caused by a rogue artificer referred to as \"Renegade Prime\" by a man with silver-grey locks and a metallic arm by the name of \" Tezzeret \", referred to as the Head Judge. Chandra recognized Renegade Prime as her presumed dead mother, Pia . Struggling to reach her mother against Consulate constructs, she could not avert her mother's renewed captivity. Liliana persuaded her to retreat along with the recently arrived Nissa. The trio found themselves in an alley, where Liliana and Nissa argued and the necromancer left to deal with things on her own. Chandra and Nissa were found by an old friend of the Nalaars, the lifecrafter Oviya Pashiri . Pashiri comforted Chandra and told her that they were going to rescue her mother. Arrested by Baral Along with Nissa and Pashiri, they visited the party of the Aetherborn Yahenni . While Yahenni was at first unable to aid them, a Consulate officer hunting for a criminal Aetherborn at her party allowed her to learn that the prison where Pia Nalaar was held in the Dhund. Pashiri told Chandra that Baral was still stationed there. The trio searched in the tunnels beneath the night market after the rumored position of the Dhund. With Nissa's aid, they managed to locate the aether pipelines that connected the prison to the rest of the city's infrastructure and found the hidden prison. When they entered it, however, Baral already awaited them, having been warned by Dovin Baan . Baral lured the group into an airtight, enchanted Deadlock Trap , intending to turn Chandra's pyromancy against them by using up the air faster while filling the trap with poisonous gas. Not even the combined power of the two planeswalkers managed to crack the prison. Chandra then explained what she saw in the Gatewatch - a family that would remain with her regardless of the plane she was on. Thanking Nissa for coming to Kaladesh, she urged her to planeswalk away, while she would remain with Pashiri. They were freed by the leonin planeswalker Ajani , who had come in search of Oviya Pashiri. After being freed, the other members of the Gatewatch arrived, having been alerted by Liliana. Public announcements that told of the execution of Renegade Prime during the grand finale of the Inventors' Fair caused the group to mix with the crowd. Chandra watched, barely restrained by Jace, as her mother and the Head Judge battled each other. When finally confronting him, Tezzeret mocked Chandra, reminding her that this was the same arena where she had been once sentenced to death. When her planeswalker allies revealed themselves and fought against his constructs, the Head Judge quickly fled the scene. Discovering that their presence had been used as a distraction to confiscate the inventions displayed at the Fair and to take the inventors prisoner, the Gatewatch swore to uncover what Tezzeret had planned. Chandra and her mother finally reunited. Chandra cooperated with the Renegades Chandra then cooperated with the Renegades, fighting at their side against Consulate troops. Her aggressive style drew the attention of Gideon, who reminded her that most Consulate troops were regular people who only did what they were told. Chandra countered that it didn't matter and that Tezzeret and the Consulate were the same. Gideon reminded her that the purpose of the Gatewatch was not traveling from plane to plane to impose their judgment on the world's inhabitants. Otherwise, they would be no better than tyrants. Being reminded of her oath, Chandra promised that she would try to avoid collateral damage, but that her loyalties were not only to the Gatewatch but also to her family. Together with her mother, they visited Gonti, who promised aid in taking the central Aether hub of the city in exchange for services rendered later. The personnel of the hub yielded when faced with the superior numbers of Renegades. In a counter-attack, Baral provoked Chandra almost to the point of self-imploding by taunting her with her father's death. She was saved by Nissa and Ajani. Following the destruction of the Skysovereign , the Renegade's flagship Heart of Kiran prepared to attack the Aether Spire where Tezzeret had constructed a Planar portal . The Renegades had prepared a special thopter equipped with an aetheric disruptor to destroy the portal and rob Tezzeret of his powers. Chandra was assigned to stay on the Heart of Kiran and protect it against the Consulate attacks together with Saheeli and Gideon. However, Dovin Baan had managed to pierce their defenses and infiltrate their freight room to sabotage the thopter. Chandra attacked him, but only managed to damage the Heart of Kiran further. As Baan planeswalked away, the remaining planeswalkers had to improvise. Chandra volunteered to enter the thopter and use her fire magic as a detonator instead. Gideon decided to accompany her, shielding her with his magic from the following explosion. Their plan was successful in destroying the planar bridge , but Tezzeret managed to escape. In the following days, the Consulate was restored, with Pia becoming the new Consul of Allocation and Baral being imprisoned in the Dhund. Chandra was present when Ajani took the oath to join the Gatewatch and the group planned to strike against Tezzeret's master, the Elder dragon Nicol Bolas . Chandra, confident in her group's success after the destruction of the Eldrazi Titans, advised striking directly against the dragon's powerbase. After saying goodbye to her mother, Chandra again tried to meditate with Nissa to find calm, but only fell asleep. Chandra's Defeat at the hands of Bolas On Amonkhet , the Gatewatch discovered that Bolas had been creating an army of Eternals ; highly trained fighting specialists which had been zombified while keeping their skills intact. When they confronted the dragon, they were soundly defeated. Chandra was severely wounded and had to abandon her friends by planeswalking away. Chandra helps Karn restore Multani and retrieve the Golgothian Sylex Chandra reunited with the Gatewatch on Dominaria . Exhausted and defeated, she questioned Liliana's allegiance to them, believing her to only use their group to kill her demonic debtors. She was also very hurt by the abandonment of her friend Nissa. While she stayed true to the Gatewatch, she left to find reinforcement in the person of Jaya Ballard . Chandra was surprised to find that she had met Jaya already, as Jaya turned out to be the same person as her mentor Mother Luti , the elderly matriarch of Keral Keep . While searching for Jaya , Chandra also met Karn and Multani . Using some of Nissa's techniques, she restored Multani's consciousness. This action persuaded Jaya to help in the Gatewatch's quest to kill Belzenlok. Together with Gideon , Chandra infiltrated the Belzenlok 's Stronghold to find the Blackblade , the only weapon strong enough to kill the demon. Chandra traveled with the Gatewatch to Ravnica for the final confrontation with Bolas, and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Chandra, Saheeli, Lavinia , and Lazav were tasked with shutting off the Immortal Sun . Lazav disguised himself as Chandra in the fight against Dovin Baan , using illusions and an Izzet League flamethrower to replicate the effects of her pyromancy. This deception allowed the real Chandra to sneak into Baan's facility and disable the Immortal Sun, allowing many planeswalkers to leave Ravnica. Lazav subsequently defeated Baan, blinding him with throwing stars and causing him to planeswalk away. Later, as part of Gideon's plan to kill Nicol Bolas, she reactivated the Immortal Sun to prevent Bolas from planeswalking away. When Gideon sacrificed his life to save Liliana, Chandra misunderstood what had happened, believing Liliana had killed him. She was ready to immediately kill Liliana and had to be stopped by Jace, who explained the situation. Chandra survived the battle and was present during the Planewide Celebration that followed. She admits to her teammates that she had feelings for Gideon and loved him \"as more than a brother.\" After, Chandra and Nissa professed their love for each other (although it's not clear if Nissa shared Chandra's romantic interests). Later, at the behest of Samut , Chandra and Jaya cremated the bodies of the now-inactive Eternals. Chandra participated in the memorial service for Gideon on Theros . By this time she felt depressed, distanced from her surroundings, and cold in her heart, feeling angry and inadequate because she hadn't been able to prevent the many deaths of the War. This soured her friendship with Nissa as well, and their goodbye was cold. By command of the new Living Guildpact, who feared their interference, Jace and Chandra were kept out of the loop concerning the assignments of Vraska, Kaya, and Ral Zarek to pursue and kill Dovin Baan, Liliana, and Tezzeret respectively. Searching for Baan herself, she found him and Vraska in Zinara on Regatha , but unknowingly became an accomplice in their plans. During the fight, Vraska severed Baan’s right hand to use as proof of a kill while Chandra believed she had delivered the killing blow. Later she and Jace tracked Liliana to Dominaria, and only found a corpse on a burning pyre. They didn't suspect that the body belonged to Liliana's imposter. Tibalt vs Chandra Chandra struggled to come to terms with her guilt and the pain about Gideon 's death and the loss of Liliana . She struck out on her own, determined to prove — to her family and herself — that next time she would be prepared. She essentially became a one-woman Gatewatch and visited many planes to help the innocent, but continually slid down a self-destructive path with ever-increasing desperation. This was reinforced by emphatic attacks from the planeswalker Tibalt , who fed on her agony. After battling the half-devil planeswalker and losing to him, she planeswalked away to Zendikar. On the ruined plane, she contemplated what had happened on Ravnica and what she needed to do to regain control of herself. In the end, she decided she needed to travel to where it began - back to Amonkhet and the site of the Gatewatch's defeat at the hands of Nicol Bolas. After battling a group of Eternals, she found herself at the Necropolis before an idol of the Elder Dragon. There, she unleashed her rage, obliterating the statue; symbolically defeating the foe that had haunted her. Done with her quest; she planeswalked to Alara, to speak to Ajani whom she knew shared a similar experience in the past. Together, the two decided to head back to Kaladesh, so Chandra could apologize to her mother. However, once there, the duo found Tibalt awaiting them, with Consul Nalaar bound and tortured beside him. As Tibalt was distracted by their entrance, Pia could escape from his clutches. Tibalt immediately attacked Chandra, but quickly noted her renewed self-confidence. Realizing that he couldn't compete with both Chandra and Ajani on their home turf, he fled to Innistrad. Chandra and Ajani followed in pursuit. On his homeplane, Tibalt was aided by a horde of devils and could overwhelm his opponents. Gloating, he revealed that on Ravnica he had felt Chandra's pain screaming through the aether . He had followed her to Regatha to find out if he could hurt her even more, admitting that he thrived on physical torment, psychic misery, and emotional anguish. Chandra realized that Tibalt's aim was for her to lose herself all along and that he might be eviler than Bolas for that. Her self-confidence asserted itself, and she now knew that her guilt and sadness wouldn't go away but that it didn't have to mean that she had to be weakened by it. Done feeding Tibalt, she knocked him out and delivered him to the local authorities to deal with. She had finally found peace with herself. Arlinn Kord went to Ravnica to ask The Gatewatch for help in finding the Moonsilver Key . She found and explained Innistrad 's situation to Teferi , Kaya and Chandra. The three planeswalkers agreed to help Arlin and headed to Innistrad. Together with the cathar Adeline , they decided to go to Thraben to investigate. Chandra makes her way through the hordes of zombies in Thraben . Chandra, Teferi, Arlinn, Kaya, Adeline, and a group of cathars arrived in Thraben. They found the city destroyed and full of zombies from the army Liliana used against Emrakul . Kaya entered the city alone to scout the place. She found a clue in a book about the whereabouts of the Moonsilver Key . The Key should be in the possession of the Betzold family. Arlinn and Adeline knew a bishop of the Church of Avacyn with that last name. They located bishop Worrin Betzold amid the ruins of a church. The group made their way through the zombies until they reach the bishop. Chandra fended off and incinerated several zombies with her flames. Upon reaching the church, Chandra rose a wall of flame to protect the perimeter. Arlinn interrogated the zombie bishop and was given a name, Dennick . The group moved to Gavony , where the family had a mansion. In the ruins of the mansion, they found the spirit of Dennick Betzold who told the group the location of the Key. The key had been given by an ancestor of Dennick to Sorin Markov . At Markov Manor, Teferi and Arlinn waited with Sorin for the vampire to hand over the Key so they can help restore balance to Innistrad. The vampire refuses and strikes Arlinn when she mentions Avacyn . Before his second strike, Sigarda appeared by answering a prayer made by the group before entering the Manor and stopped the attack. The angel says that the Key is in Sorin's quarters and that she will stop the vampire, giving the group a chance to get the Key. The party returned to the Celestus in possession of the Key. At this moment, Tovolar launched his army against the Harvesttide festival . The witches' magical protections managed to stop the werewolves' advance. Arlinn tells Kaya to take the Key to Katilda . At this point, the protections begin to fail. Teferi cast a powerful spell to delay the sunset and consequently the transformation of the werewolves into their wolf forms. Planeswalkers , witches, and cathars began their battle against the invaders to defend the humans . As Adeline lead the Cathars, Chandra cast powerful fire spells against the invaders. When Teferi's spell wore off, the werewolves complete their transformation, including Arlinn's. After the battle with Tovolar, Chandra, and Adeline took Arlinn to the center of Celestus. There, the witches were finishing the ritual, but Olivia Voldaren appeared, interrupting the ritual, and took the Key with her. Thus, the Eternal Night began. Ruining Olivia Voldaren's marriage. Chandra and the other members of the Gatewatch formed a small group of fighters to battle the Eternal Night and Olivia Voldaren 's vampires. All the while, she was growing closer to Adeline . They formed a pact with Sorin Markov and traveled together to the wedding of Olivia and Edgar Markov at the Voldaren estate. When they arrived, all but Sorin were forbidden entrance. Inside the castle, Sorin managed to disrupt the ceremony and attacked Olivia who dropped the Moonsilver Key . From it, Katilda ’s spirit emerged and freed Sigarda who unleashed a blinding holy aura that shattered windows and broke the manor’s wards. Now free to advance, Teferi used his magic to hasten the entry of their foot soldiers and assisted Chandra in burning through the great doors to the manor, granting full entry to their forces. Chandra and Adeline rode out together with the mounted cathars and began to dispense justice. During the fighting, Adeline saved Chandra from a falling column with the assistance of Teferi who slowed its fall. As the battle continued and with their forces spread thin, Tovolar and his wolves arrived to help. Emerging victorious and with the Moonsilver Key now secured, Teferi accelerated their journey back to the Celestus to complete the ritual. After the balance between night and day was restored, Arlinn Kord observed Chandra and Adeline together, hidden away under a willow tree as they talked and embraced. Chandra traveled to Zendikar to inform Nissa of the Gatewatch's plans for defense against the New Phyrexian threat. After discussing the threat on Ravnica, Nissa agreed to help in the fight, and both traveled to Dominaria. Chandra commiserated with Jodah over Jaya 's death. She returned to Ravnica to update Jace, before traveling home to Kaladesh to visit her mother before the final fight. Chandra wasn't part of the planeswalker strike force that set out to destroy Realmbreaker on New Phyrexia . Together with Vivien , Wrenn , and Liliana , she took refuge in one of the latter's cabins on Dominaria and anxiously awaited the return of the team. When the survivors returned, Chandra was devastated to learn that Nissa and Jace had also fallen to the enemy. Defiant, she was the only one of the group willing to return to New Phyrexia to help their remaining allies. The group tried to dissuade her, but she decided to go anyway. Wrenn, who had stayed silent, joined her and told her she had the plan to merge with the Invasion Tree, hoping to use it to retrieve Teferi to help them. Traveling to New Phyrexia, Chandra, Wrenn and Seven met with Koth and Urabrask who brought them to Realmbraker. Here, they were stopped by the compleated Nissa, who tore Seven apart limb from limb. The rebel team were entirely captured and brought to the Phyrexian leadership. Just as Jin-Gitaxias was to cut down Koth, a newly ascended Elspeth intervened, healing some of the Mirrodins and giving them new resolve. Chandra and Koth fought their way to the tree with Wrenn, Koth's geomancy acting as mobile defenses and transport. A new confrontation between Chandra and Nissa was stopped short by Elspeth, and Wrenn managed to fuse with Realmbreaker. After Wrenn switched Zhalfir and New Phyrexia's places in the Multiverse , Chandra was present when Teferi, Karn, and Melira un-compleated Nissa. Although she was one of few planeswalkers who retained their sparks in the aftermath of the Invasion , Chandra chose to stay with the desparked Nissa, traveling the Multiverse via the new Omenpaths instead. Chandra narrates the trailer for Magic 2014 , is the primary focus of the Magic Duels trailer, and appears in the Aether Revolt , ManaStrike , and Magic SpellSlingers trailers. In the D&D campaign released with Dungeons & Dragons: Adventures in the Forgotten Realms via Magic Story , Chandra was given a character sheet representing her as a sorcerer: a spellcaster deriving her power from intuitive and innate abilities rather than extensive study or external sources. Her alignment is chaotic good, matching her rebellious and emotional but heroic nature. She has many fire spells, although no elemental summoning abilities. Interestingly, she's given a \"draconic bloodline\" origin, rather than the other common choice of \"wild magic\". Ironically, she did not use the Pyromancer subclass developed for the official D&D content set on her home plane of Kaladesh . In the video game Magic: The Gathering Arena , Chandra is voiced by Laura Bailey . Chandra's Regulator — Vent pack invented by Chandra's father, which helps to control her fire. Pyromancer's Gauntlet Pyromancer's Goggles — Originally a holy relic of Keral Keep that once belonged to Jaya Ballard . Associated cards: Depicted in: Quoted or referred to: Magic Arcana (October 8, 2009). \" Chandra vs. Chandra \". magicthegathering.com . Wizards of the Coast. Doug Beyer , Christopher Moeller , Brady Dommermuth et al. (November 5, 2008). \" Fuel for the Fire, Part I \". magicthegathering.com . Wizards of the Coast. Doug Beyer , Andrew Robinson, Brady Dommermuth et al. (November 12, 2008). \" Fuel for the Fire, Part II \". magicthegathering.com . Wizards of the Coast. Doug Beyer , Jeremy Jarvis , Brady Dommermuth et al. (November 19, 2008). \" Fuel for the Fire, Part III \". magicthegathering.com . Wizards of the Coast. Christopher Moeller , Doug Beyer , Michael Mikaelian , Karin Powell, and Jeremy Jarvis (October 22, 2007). \" Chandra's Ultimate \". magicthegathering.com . Wizards of the Coast. Doug Beyer (October 24, 2007). \" Planeswalkers Unmasked \". magicthegathering.com . Wizards of the Coast. Chandra Nalaar at the Planeswalker Minisite Michael Yichao (June 10, 2015). \" Chandra: Light 'Em Up \". magicthegathering.com . Wizards of the Coast. Chas Andres (August 4, 2015). \" Acting on Impulse \". magicthegathering.com . Wizards of the Coast."}