{"text": "Chishiro is a large Orochi samurai from modern Kamigawa . He carries a black blade flecked with jade that represents his bond with his kami companion, Kaima . Chishiro was an elite samurai in the Order of Jukai who could channel the magic of Kaima , Kami of Forest Fellowship, through his sword. This strength could even be extended to others based on how strong an emotional bond he forged with them. But Chishiro falls into a trap set by the Saiba Futurists . His friends were killed, Kaima was driven from him, and his sword was shattered. Broken and unwilling to risk the lives of others, Chishiro leaves the order and journeys alone, accepting coin to train warriors to defend themselves. When a small village is attacked by a group of Mukotai Reckoners , Chishiro finds a glimmer of comradeship from his old life and chooses to battle alongside them, leading them to a hard-won victory. Originally a member of the Order of Jukai , Chishiro and his comrades hunted Futurists who infringed on the forest's territory. One day, a boy visited the village that the Order lived in. After poisoning the Order's food, the boy stole Chishiro's blade, slit the throats of Chishiro's comrades, and threatened the orochi in hopes of forcing Kaima to bond with him. Instead, it caused Chishiro to shatter his bond, and with it his blade. Kaima rampaged through the village, killing the villagers and chasing the boy off. After that day, Chishiro abandoned his ideals and became a killer-for-hire. Years later, Chishiro was hired to protect the neighborhood of Far Corner from the Mokutai Reckoners. After training the villagers in the defense of their village, the Reckoners arrived and Chishiro recognized the toad rider Tatsunari as the boy from his past. Gripped with rage, Chishiro attacked the boy, and was saved by the village's kami, which he soon realized was Kaima itself, enraged by the perceived betrayal in the years since Chishiro shattered their bond. Chishiro opened himself to the kami, agreeing to reforge their bond so the two could protect and keep watch over each other, and his blade began to reforge into a new blade of light, rather than darkness. Associated cards:"}