{"text": "Choryu was a talented water wizard of the Minamo Academy on Kamigawa . He was a friend of princess Michiko Konda . Unbeknownst to her, he was also an agent of Minamo and its soratami masters, placed in Michiko's vicinity to ensure that the princess's activities were monitored. He was of medium height, with a white mane of hair. Choryu was talented, but also arrogant and boastful. When Michiko shared her secret desire with her friends - to get out of Eiganjo and to actually help her people - Choryu took the initiative and helped her to escape, trapping their kitsune mentor Sharp-Ear in a cover of water. He intended to bring the princess to Minamo Academy. However, Sharp-Ear managed to escape and later, using his kitsune trickstery, separated Michiko from Choryu and Riko . Choryu was quite desperate about the situation, especially when his patron spirit, Ichikawa of the Great River (possibly another name for the Myojin of Seeing Winds ) reprimanded him for taking Michiko from Eiganjo and forbade him to allow Michiko to go into the woods. Choryu and Riko were later reunited with Michiko in Sugi Hayashi . Guided by a vision of Lady Silk-Eyes , Michiko and her party (Riko, The Tail Brothers , Pearl-Ear , Sharp-Ear, and Choryu himself) headed for the orochi country, much to Choryu's chagrin. The wizard kept complaining all the way, desperate about the fact that Michiko was heading exactly where Minamo didn't want her to be. The party met Toshi Umezawa and Kobo . Toshi and Choryu immediately disliked each other. The parties were attacked by orochi shortly after. Choryu conjured a stream of water and let himself be born away on it. The rest of the party was captured. When the snakes overwhelmed and immobilized Kobo by binding him to a tree, Choryu made a decision. Afraid of the ogre's apprentice's might (that he witnessed during the fight), he drowned him with a mighty stream of water directed into his face. This was the greatest and last mistake in his life - earning the revenge of the Hyozan Reckoners . When Michiko was saved from the hands of the Myojin of Life's Web by Toshi Umezawa, the ochimusha proceeded with the hyozan's revenge. Branded by the kanji that marked Kobo's murderer, Choryu was lifted into the air and brought into the hands of Hidetsugu . The o-bakemono got revenge for his killed apprentice. He tortured Choryu in an impossibly cruel and disgusting way: he bound him to wall, suffused him with poison, and let him be slowly burned off by a heat-emitting crystal. When he was losing consciousness because of lack of nutrition and water, the ogre fed him his own poisoned flesh, only to make his suffering even greater, keeping him alive all the time. When Toshi learned about Choryu's fate, he was shocked. When Hidetsugu left his home to exact his revenge to Minamo, Toshi shadow-walked to Shinka and tore the gem off Choryu's chest, finally allowing the ill-fated wizard to rest in peace."}