{"text": "Colfenor was one of the most ancient and wisest treefolk sages on the plane of Lorwyn . He was the only and last living red yew treefolk. The yew treefolk were powerful shamans , and their poison magic, one of the strongest types of magic overall, was unequalled on Lorwyn. Colfenor was a cryptic personality, showing only a fraction of what he really knew, always pursuing his own secret agenda. He apprenticed a young Gilt Leaf elf named Rhys and taught him the secrets and the wisdom of yew magic and the yew species overall. However, despite their close bond, their ways parted for a long time after. Rhys became a hunter in the Gilt Leaf tribe and Colfenor wandered Lorwyn alone. After some time, Colfenor became alerted to a great coming event that would change Lorwyn forever . Deciding he needed to ensure the survival of his species in this world to come, he wandered to the kithkin clachan of Kinsbaile , where he was reunited with Rhys. His former pupil had become an eyeblight and an outlaw thanks to his poison magic going terribly awry while trying to salvage a botched attack on the boggart at the Feast of Footbottom. Colfenor tasked Rhys with traveling to Murmuring Bosk , a sacred treefolk grove, and planting his cone there to make certain the yew line would go on. Rhys and his companions, Kinsbaile archer heroine Brigid Baeli , a flamekin pilgrim named Ashling , a triplet of fae called the Vendilion Clique and Maralen , supposedly a Mornsong elf, arrived at Bosk only to find it completely leveled and burned. Rhys planted the cone anyway, performing a ritual to ensure its growth. Ashling was later doused in water and abducted to Kinsbaile by Brigid, as a result of political intrigues played by Gaddock Teeg . Rhys returned to Kinsbaile to inform Colfenor of Murmuring Bosk's destruction, only to find himself trapped by his former tribesmen. He fled, but was forced to battle his former commander, Taercenn Nath to escape. Rhys emerged victorious, killing the ruthless Nath. When he finally returned to Colfenor and Ashling, the flamekin was being rekindled by a greater elemental , and as her elemental-fueled fire reignited, the blaze engulfed Colfenor and the Last Yew burned brightly to his death. Rhys and Ashling, emotional after the death of their friend, returned to Murmuring Bosk to check the progress of Colfenor's offspring, but were surprised with what they found. Instead of decades, the young tree had grown, awakened, and \"risen\" in a matter of days, and greeted the company in the name of her \"seedfather.\" Colfenor was dead, but his (and his whole species') experience and wisdom survived in the young yew treefolk. The Sapling of Colfenor went on to play an important role in the events of the Great Aurora, and in the war between Oona and her renegade twin Maralen. In the Lorwyn style guide, Colfenor was called Cronan. Associated cards: Quoted or referred to:"}