{"text": "The Consulate is the governing body of Ghirapur on Kaladesh . Before the Consulate, Kaladesh was ruled by feuding principalities that competed intensely with each other, with their rivalries often escalating into war. Eventually, the conflicts resulted in a terrible war between the eleven most powerful nobles for a stretch of the coastal territory, referred to as the War of Eleven. The war was eventually ended when the court inventors of the nobles came together, opened channels of communication, and eventually managed to end the conflict. The eleven artificers made the contested land their nation, with the newly founded city of Ghirapur as its capital. Representatives from the eleven noble families would come together and rule over the territory in harmony, forming the first Consulate. In time, the power of the Consulate would eclipse even that of the surrounding nations, incorporating them into their territory. After the ingenious inventor Avaati Vya developed a process to refine volatile raw aether , the Consulate recognized its potential as a fuel and designed distribution methods to ensure that it was accessible. Their efforts led to a plane-wide inventors' renaissance, a time of hope, optimism, and boundless creativity. The Consulate banned fire magic and made pyromancy punishable with a death sentence, reportedly since pyromantic magic interacted dangerously with the aether in the air, but some suspected that the Consulate saw independent energy generation as a threat to their power. A faction known as the Renegades even believed that the Consulate was corrupt, and infringing on their freedoms. They refused to adhere to safety regulations and aether quotas, and they undermined the Consulate's efforts to provide law and order. In reaction to the intrusion of unknown figures wielding magic openly after the Inventor's Fair, who saved Renegade Prime from her execution, the Consulate issued an ordinance to all citizens of Ghirapur. All inventions and artifacts that had not been Consulate-approved or had been modified for personal use were taken into custody, as a safety measure against Renegade factions that would exploit these artifacts. The Renegades believed that the Consulate was trying to consolidate their hold over Kaladesh's technology for their gain, and started a revolt . The Renegades were victorious. After the defeat of Head Judge Tezzeret and the removal of other corrupt elements, a more benevolent Consulate took up their seats. In the aftermath of New Phyrexia's Invasion of the Multiverse , Kaladesh's denizens again began to question the Consulate's leadership. There are eleven consuls in total. Together, they are also referred to as the Enlightened Keepers. Among them: Kambal , Consul of Allocation. Replaced by Pia Nalaar . After New Phyrexia's Invasion of the Multiverse , this position became the Consul of Revival. Padeem , Consul of Innovation. Held her position following the revolt the Consul of Law Enforcement the Consul of Ports and Commerce the Consul of Regulation & Enforcement the Consul of Taxation and Treasury Consuls held their positions for life. Their admission in the case of a vacancy was the matter of nomination by the citizenry of Ghirapur, after which the candidate had to present their abilities in a public interview, where their qualities are questioned by the Consuls as well as the citizens. Departments are the primary subdivision of the consulate, and multiple departments are known, each with their own function. The Department of Inquiry, a public relations division. The Department of Safety and Registration, oversees permitting of pilots and drivers. The Department of Security and Enforcement Dovin Baan , Senior Inspector for the Inventors' Fair . Tezzeret , head judge for the Inventors' Fair, later declared Special Grand Consul. The Honorable is the official police force of Ghirapur. Members of its armed force are called enforcers, but often eschew lethal weaponry in favor of thopters and other aether-powered devices. Ranaj , chief of the Consulate Enforcers. Captain Baral , Chief of Compliance. The House of Knowledge is the think tank of the Consulate. Consisting of the best scientists and artificers in the city, they constantly work to expand the technological level of the Consulate. Symposia known as Inquiriums is tasked with studying the aether and constructing new devices. The skyfleet of the Consulate protects Ghirapurs miners and aether harvesters from the local fauna that also feeds on the aether. The Edificiers are tasked with constructing the buildings of Ghirapur and repairing them in case of damage. Sram , Senior Edificer Associated cards: Referred to: The Consulate's colors are white and blue ."}