{"text": "Crovax , sometimes known as Crovax the Cursed and later as the Ascendant Evincar of Rath , was once an aristocratic human from Urborg born as part of Urza 's Bloodline Project . Throughout his life, he was the victim of Phyrexian attempts to drive him mad and turn him against Urza. These were ultimately successful and resulted in him going from a loyal member of the Weatherlight crew to one of their deadliest enemies. Crovax had brown eyes and dark skin. Crovax was born on the island of Urborg to a noble family. He had a brother, Jolav , and multiple sisters. He had a poor relationship with his parents and his noble status and the remoteness of Urborg meant that he was largely isolated from the outside world. He idolized Lord Windgrace , and was constantly reading about his exploits. His only companion was the angel Selenia , who was bound to an artifact to protect the family estate. Over time, Crovax became besotted with the angel, who was unable to return his affections. When the opportunity arose for Crovax to join the Weatherlight crew, he jumped at the chance to leave Urborg behind and explore Dominaria . He took with him the artifact controlling Selenia so that he could be with her. At age 27, Crovax found a purpose as a warrior aboard the Weatherlight , although his relationships with the rest of the crew were uneasy. He befriended Rofellos and Gerrard Capashen , but tended to be aloof and reclusive, making him seem untrustworthy. However, his competence as a crewman was clear and therefore he remained on board for several years, aiding in their mission to collect the Legacy artifacts. Crovax later received word that a pair of unstoppable beasts were ravaging Urborg. He convinced the Weatherlight crew to go to the aid of his family and found that the Phyrexian agents Morinfen and Gallowbraid had laid waste to his family’s lands whilst leaving the other nobles untouched. The Weatherlight arrived too late to stop the slaughter of Crovax’s family and soon found themselves locked in battle with the beasts. Rofellos became the first casualty of the battle. To win the desperate fight, Crovax summoned Selenia, who defeated the Phyrexians. In the aftermath, Crovax blamed himself for what had happened: his taking of Selenia’s amulet had left his family vulnerable to the attack. In an attempt to make amends, he chose to remain in Urborg to try to restore his family’s heritage. Whilst in Urborg, Crovax’s love for Selenia became obsessive. Enraged by her inability to return his feelings, he shattered the artifact that bound her in the belief that it prevented her from experiencing love. Instead, Selenia simply flew away once it was destroyed. He eventually found Starke il-Vec , who informed him that Selenia had left for Rath , and that Crovax’s estate was again vulnerable to attack. Left with only his family's remains for company, Crovax became more and more unstable. Unbeknownst to him, the act of destroying the artifact had cursed Crovax to a life of misery. He was now destined to destroy all that he loved. Sometime later, Crovax's isolation was interrupted when Starke returned, fleeing Volrath 's mercenary Maraxus of Keld. Crovax offered his friend Alaric 's estate to hide Starke. Gerrard arrived soon after, asking him to rejoin the Weatherlight crew to help rescue Sisay , who had been kidnapped. Crovax accepted, but remained withdrawn and isolated from the rest of the crew as they journeyed to Rath . Upon arrival, Crovax was traumatized at the sight of Selenia leading an attack by the Predator against the Weatherlight . He fled below deck, sobbing and howling while being comforted by the ship's healer, Orim . She eventually managed to bring him to his senses, but by that time it was far too late for him to have an impact on the battle. Embittered by his love's betrayal, Crovax became obsessed with getting revenge. After reuniting with Gerrard, the crew planned to infiltrate the Stronghold to free not only Sisay but also the other crewmen and the Legacy artifacts that had been taken during the fighting. Upon arrival, Crovax spotted a shapeshifter in the guise of Selenia. In a fit of rage, he pursued it and tore it apart, much to the shock of his allies. Gerrard tried to send Crovax back to the ship, fearing he would jeopardize the mission, but Crovax insisted that he stay. Begrudgingly, Gerrard agreed and he, Crovax, Starke il-Vec , and Mirri pushed further into the Stronghold. Crovax finally met the real Selenia in the dungeons of the fortress. She tried to kill him and in the process severely wounded Mirri. Crovax's rage overcame him again and he wildly swung his blade at the angel, who eventually allowed herself to be struck. She shattered into hundreds of shards that dug into Crovax's flesh, shattered his mind, and warped him into a vampire . Crovax's curse had been fulfilled: he had killed the love of his life and had been damned because of it. The unconscious Crovax was taken back to the Weatherlight to be tended to by Orim. As the ship was being pursued by the Predator , he wandered onto the deck and attempted to sabotage the Weatherlight's sails, as he was being commanded to do by voices in his mind. Before he could complete this, however, he was attacked by Mirri, who had followed him out of suspicion. The two fell overboard into Volrath 's garden, where Crovax then proceeded to kill the cat warrior. As the Weatherlight retreated, the closing of the planar portal sent a shockwave that caused Crovax to tumble down a ravine. He welcomed the prospect of death, but the voices in his head had a different fate planned for him. Crovax was taken to Phyrexia, where the voice in his head was revealed to be the Dark Lord Yawgmoth . The noble was confronted by Kirril , who taught him how to consume the lifeforce of others and transformed his body and mind into those of a Phyrexian. He was granted massively enhanced strength and endurance, glistening oil blood, the ability to manipulate flowstone and to teleport, and had his sense of conscience removed. Once the compleation process was finished, Crovax was taken into the Stronghold and his new role was revealed: he was to become the new evincar of Rath, needing only to prove himself to his masters before he could take the throne. Crovax's potential competition for the evincar status were the army commander Greven il -Vec and the wizard Ertai . Crovax was initially unable to best Greven in combat but learned how to manipulate the warrior's mimetic spine to incapacitate him. Upon doing so, Crovax attempted to intimidate the Phyrexian emissary Belbe into declaring him the new evincar, but she refused. To prove himself, Crovax organized an expedition to attack the rebels in the Skyshroud Forest . However, the Skyshroud Expeditionary Force was poorly planned, low on morale, and exhausted after a forced march to the edge of the forest. As a result, they suffered heavy casualties against a much smaller rebel army and had to retreat. This failure lost Crovax a lot of respect, especially when compared to his other rival Ertai. The wizard had enamored Belbe and also demonstrated shrewd tactical thinking in taking hostage 6,000 members of the Kor , Vec , and Dal to prevent rebellion during Crovax's campaign, making him a credible opponent for Crovax. In retort—and to sate his bloodlust—Crovax impaled the hostages on flowstone spikes. This horrified Belbe but was an undeniable show of his power and ruthlessness. Still, Belbe refused to name him evincar. Crovax became enraged by Belbe's denial and organized a coup against her by his Corps of Sergeants to force her to make him the evincar. This was successful due to Belbe's affection for Ertai, whom Crovax threatened to kill unless she agreed to his demands. Belbe organized a coronation ceremony for the next day, but this was interrupted by the return of Volrath . The former evincar demanded his throne back but was opposed by the outraged Crovax. To settle the dispute, Belbe made the two duel for the throne. The warriors were evenly matched, but when Volrath seemed to have the upper hand, his strike against Crovax was magically diverted by Ertai, allowing Crovax to win. Crovax had been slaughtering the onlookers to restore his strength, so Ertai had seen Crovax's victory as inevitable; Ertai also knew that by aiding Crovax he could gain his favor, while Volrath would slay the wizard immediately. With his victory over Volrath, Crovax's reign as evincar began. Crovax quickly took control over Rath after being made evincar. After suppressing the rebels that had infiltrated the Stronghold, he organized a funeral for Belbe (whom Eladamri had killed) and a simultaneous execution for Volrath. He also had Ertai compleated into a Phyrexian and made him his court mage. As the Rathi Overlay was imminent, Crovax's main task was to prepare the armies of Rath to invade Dominaria. When the overlay took place, the Stronghold emerged inside a dormant Urborg volcano. From there, Crovax oversaw the Phyrexian domination of his former homeland. He converted his ancestral estate into a shrine to himself and had his parents' remains exhumed to be used as puppets for his amusement. He executed his second-in-command, Tsabo Tavoc , for her failure at Koilos , then set about trying to destroy Weatherlight both for revenge and to prevent the Legacy Weapon from being completed. He sent Predator to attack the ship and had Ertai teleport Gerrard directly into the Stronghold. Once there, Crovax fought with Gerrard before offering him the prospect of Hanna being resurrected if Gerrard joined Phyrexia, showing Gerrard the resurrected Selenia as proof of Yawgmoth's power. This convinced Gerrard to surrender himself to the Dark Lord. As a reward for corrupting the savior of Dominaria, Yawgmoth resurrected Squee so that Crovax could enjoy killing him over and over again. With Gerrard submitting himself to Phyrexia, Crovax was free to entertain himself with the suffering of others. When Multani transplanted part of Yavimaya to Urborg, Crovax personally led the counterattack. He demonstrated his necromantic abilities by raising an army of undead, and then his fighting skills and bloodlust by leading the slaughter of the woodland creatures. However, he was interrupted during the battle by a magical distress call from Ertai. Crovax rushed back to the Stronghold with the intent of crushing whatever it was that threatened his throne room and punishing Ertai for pulling him from battle. To his shock, he discovered that Gerrard had returned from Phyrexia with his freedom, but also with boons from Yawgmoth that made him a match for Crovax both physically and in regards to his flowstone manipulating abilities. The two fought to the death, with Crovax briefly having the advantage, but eventually being sliced in half by Gerrard. Following his death, Selenia appeared and recovered Crovax's soul which is shown to be his normal, non-Phyrexian self. Crovax, intent on his obligation to deal with the cursed Mirri. In Planar Chaos , it is revealed that there is another reality in which Mirri killed Selenia and became cursed instead. Following his grief for the loss of both of them, Crovax re-emerged as Crovax, Ascendant Hero . According to the artist Pete Venters , his plumed cape represents Selenia's wings, and he carries the Sword of the Chosen . Though not a planeswalker, Crovax traveled through the Multiverse as a crewmember of the Skyship Weatherlight . Dominaria Rath During Weatherlight design and development, Pete Venters was put in charge of establishing Crovax's mannerisms and style of speech. There is a widespread belief among fans that Crovax's surname is Windgrace , although there is no canonical source for this. Depicted in: Quoted or referred to: Cross denotes a depiction of Crovax as Evincar of Rath. Tick denotes a depiction of Crovax from the alternate universe."}