{"text": "Dack Fayden was the human planeswalker protagonist of the Magic: the Gathering comics released by IDW Publishing . In search of greater magical knowledge and on the hunt for the people who destroyed his town, Dack Fayden was the self-proclaimed greatest thief in the Multiverse . He was a young human with long, dark hair and green eyes. He stood at 6’1″ and weighed 175 lbs. His right hand and forearm were permanently dyed a deep red nearly to his elbow, as a punishment for a past theft. He had the innate ability of psychometry , the capability to absorb knowledge from objects by touch. Throughout his many adventures, he showed remarkable intelligence and agility. Although he was thought to be a selfish thief (something he himself thought he should be but wasn't), Dack commonly let the benefit of others get in the way of his pursuit of wealth. He had a strong sense of self-preservation (or at least believed he should have), although his desire to aid others conflicted with it, which eventually led to his untimely demise. He used his ability of psychometry to absorb the spells of items he touched, using their unorthodox spells to remarkable efficiency. During the War of the Spark , he used a spell taken from a ring to incinerate undead one at a time, while at another instance, he used a magnetism spell to causes the Lazotep zombies to become stuck together, slowing their advance, and at times, outright incapacitating them. Dack Fayden was centered in both blue and red mana. As he planeswalked, he disappeared in a puff of purple smoke. Dack and Mariel Dack hailed from Drakeston on Fiora . In his adolescence, Dack showed great promise in the magical arts. His psychometry gave him an enormous advantage when he joined the magical academy where he spent his youth. He rose to the top of his class and befriended his biggest rival, a boy by the name of Marsh . They were inseparable and were possibly the best mages at the academy, but while they had talent, they were sorely lacking in wisdom. The longer they were members of the academy, the cockier they became, and their hubris would ultimately prove their undoing. After their exams one year, the pair went out to celebrate, taking it as an excuse to cause trouble. Unfortunately, they picked a fight with a band of ruffians, not expecting them to be adept at magic as well. The pair seemed to have the fight in hand, but they were so used to fighting with spells that Marsh never expected the sword that would kill him. Stunned at the loss of his friend, Dack left himself open and the group hit him with the strongest spell in their repertoire. Lying smoldering next to the body of his friend, Dack’s spark flared and he ascended. Dack found his way back to Drakeston after the tragedy. With his future cut short, Dack took to stealing to make his living. After his return, he rediscovered his childhood friend Mariel , and as they grew close once again, he was smitten. He told her everything that had happened, including his trips to other worlds. He started to teach her how to be a thief, a dangerous and thrilling life, but it caused too much stress between the two and it eventually became too much for Mariel. Dack’s recklessness was more than she could bear and she left to go back to Drakeston. Dack went with her, but there wasn’t enough there for him to make his living, and so he turned to his poorly understood gift. He started to search the worlds for items he could steal and that quest took him to the world of Alkabah . He quickly found an artifact of great power that he decided to… liberate, but things went poorly when he discovered the artifact was not unguarded. The guardian Djinn beat him horribly and left him for the city guards. He was taken to prison to serve out his sentence, and part of that punishment was the torturous treatment that permanently stained his hand red, forever proclaiming him a thief. It took days, possibly weeks for Dack to finally tap into his ability and planeswalk back to Drakeston. But instead, he arrived at the scene of a massacre. The corpses of his friends and neighbors were strewn about, the entire town having been murdered while he was away. Nothing hurt him more than seeing Mariel’s body though. He fled, unable to bear the pain and wondering if he had been there, could he have saved anyone? He nursed his pain and swore that he would destroy whoever had done this to him. He wandered, both Fiora and the greater worlds beyond it, all the while honing his skills as a thief and making quite the living trading items from one world to another. His own magical abilities grew with each theft because he stole not only the items themselves but also the various magics they contained. He eventually settled in Ravnica , a home as convenient as any he could ask for. He worked his way into the vast network of spies and thieves, earning a reputation and friends amongst Ravnica’s seedy underbelly. Everything changed when he stole a dagger from the Cult of Rakdos . The dagger held memories from everyone that had used it, and to his shock… it had once been held by the planeswalker who had murdered the people of Drakeston. From the blade, after years of searching, he learned who was responsible for the death of everyone he had known. Her name was Sifa Grent . Sifa had given the dagger to the Cult of Rakdos for several reasons, chiefly to secure their loyalty, but more to keep it away from those who might want it on the plane from which it had originated, a world known as Innistrad . Dack Fayden and Sorin Dack immediately dropped everything he was doing and ventured to the unknown world. He wasted no time in blundering directly into the vampires of the world, gaining the enmity of the Falkenrath in the process. However, what he could not know was that Sifa was far closer than he expected, and his actions had tipped her to his presence on the plane. Everything was not lost though, for, in his opposition of the Falkenraths, he had gained the attention of allies, a cathar named Ingrid Reichert and her father Hermann . Ingrid and Dack rode out to confront Sifa in the Falkenrath castle, but when they arrived, they found only a skeleton guard. They dispatched them easily, but to their horror learned that Sifa had taken the majority of them to search for Dack and destroy the town if necessary. Dack managed to intervene right as Sifa managed to gather the entire town… a tactic exactly like the one she used in Drakeston. Dack managed to drive Sifa and her minions away, but he lost her before he could exact his revenge. Hermann and Ingrid led the efforts to plunder Sifa’s castle and uncovered inconceivable notes in languages they did not understand. Dack began to tell them of planeswalkers and other worlds, but he realized quickly that they weren’t listening. Indeed, they weren’t moving at all. Someone had cast a stasis spell on them while he hadn’t been paying attention. The spell’s owner made his presence known soon enough. Sorin Markov had come for the Ancient Fang, the dagger Sifa had used and the one Dack had used to track her down. He traded knowledge of Sifa for the dagger and the lives of the cathars. Sorin’s information pointed Dack to the world of Grixis , prior to the conflux of Alara . He was quickly captured by the demon Malfegor , who had devious plans to try to steal Dack’s spark for himself so he could finally escape the tiny world of Grixis. It was a task he had tried before, which is what led to Sifa’s ascension. Before Malfegor could attempt his plan though, Dack escaped and used his power to learn more about Sifa, including what had triggered her spark. Unfortunately, it offered little insight more into what she was up to or where she had gone. With few other options, he returned to Ravnica to find what she wanted with the Rakdos. Dack on Fiora Unfortunately, when he arrived, things had already been set in motion. The Rakdos were looking for him and attacking his known associates to get to him. Amidst all this, he learned that couriers were vanishing as well, and the invitations to the rejuvenation of Vitu-Ghazi were falling into the wrong hands. Using his psychometry on one of the messages, Dack figured out Sifa’s plan. She was plotting to drain the power from all of Vitu Ghazi with the same spell she had used to consume the life from Drakeston. With his motley crew of misfits and thieves, Dack rushed to the City Tree, arriving just in time to confront her and her forces. An enormous battle was waged in the boughs of the tree and Sifa had Dack on the ropes, but just like his friend Marsh, from ages ago… she forgot to protect herself from a sword. One of Dack’s colleagues managed to stab her from behind, wounding Sifa horribly at the cost of his own life. Dack loomed over Sifa as she bled, trying to suck the life from the tree to restore her own health, but Dack would not allow it and cut loose with his most powerful spell, bringing vengeance upon the death mage at last. Now Dack’s vendetta was done, but his life was left adrift. Following rumors that the Boros Legion had acquired a weapon that might upset the balance of peace on Ravnica, Dack broke into Sunhome to take the gem from them. Unfortunately, he could not locate it before a number of angels located him. Rather than tipping his hand, he grabbed the first thing he could and leaped out of the window, quickly losing pursuers in the crowds below. However, the random relic he had grabbed (a magical gauntlet) proved to be far more than he could have expected. It spoke to him, tempting him with secrets that he could scarcely imagine. Using his gift, he was inundated with images and power of a vast and ancient being and a mysterious island , but despite that, he was no wiser. Only two things became apparent. The gauntlet was incomplete, and its other half lay elsewhere. His travels took him to Theros . Dack Fayden and Ashiok On Theros, Dack found himself surrounded by thugs, which didn't heed his words of warning. After defeating them, a thankful boy took him to his father's ship, the Hadross . Fayden hired Captain Vog to take him to the island from his vision. On the island, Fayden found a cave filled with hundreds of human skeletons and petrified men. After he found a metal arm guard, which was the other part of the magical gauntlet, he was attacked by the gorgon Hythonia and by a witch but managed to escape. Safely back on the Hadross , the crew found themselves being attacked by a kraken . Fayden slipped on the completed gauntlet, felt an ancient power within him, and defeated the sea creature. Back in Meletis Fayden had nightmares every night. He had been studying the gauntlet, but it only showed him images he couldn't translate. He met the magic-user Atha who told him that he would be affected by a Sleep Curse very soon because of his magical powers. Nobody knew that Ashiok, the Nightmare Weaver caused the Sleep Curse, and no one knew how to cure it. Her village was decimated by this curse, and now Fayden had it too. Dack decided to seek help from others on Theros and was last seen entering a portal to Theros's Underworld . Having somehow escaped from the Underworld, Dack traded the gauntlet to someone who agreed to cure his curse. Disappointed that he didn't get any money out of the deal, he left Theros and continued his adventures through the Multiverse. Ravnica became his adopted home. At some point over the next few years, he racked up an enormous debt to J'dashe , an Orzhov pontiff who had been funding his heists. J'dashe's death didn't help since he came back as a ghost and became even harsher to his debtors than he had been in life. Desperate to pay J'dashe back, Dack spent the next few months on Innistrad trying to find valuable relics that the pontiff would be interested in. Dack's fate Dack was lured back to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . He was disappointed to return to Ravnica empty-handed but soon found that he had bigger problems than J'dashe. Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. At the meeting, Dack flirted with Saheeli Rai , though he also considered stealing her gold jewelry. He also managed to touch Kiora 's bident without her noticing, hoping to copy the divine artifact's powers with his psychometric ability, but this apparently failed, as the attempt made him look like he regretted his decision. At Jace 's recommendation, they decided to split up into teams to focus on specific tasks. Karn , Ob Nixilis , Dack Fayden, and Samut volunteered to go through Bolas' Planar Bridge to Amonkhet and shut the portal down from the other side. While Nixilis and Samut fought off the Eternals, Dack distracted Tezzeret, giving Karn an opening to fly one of Saheeli's explosive micro-drones into the Bridge control mechanism in Tezzeret's chest. The portal collapsed, and the wounded Tezzeret revealed that he was glad they defeated him: he hopes they succeed at killing Bolas so he can finally be freed from his servitude to the dragon. With that, Tezzeret planeswalked away. The planeswalkers were then visited by the god Hazoret , who arrived with the rogue planeswalker Sarkhan Vol . At Sarkhan's request, Hazoret gave them her spear to aid them in their fight against Bolas. Dack considered escaping to safety (as Ob Nixilis did), but Hazoret convinced him to return to the battle on Ravnica, telling him that he was a better man than he knew. Dack had a second chance to escape when Chandra disabled the Immortal Sun, yet once again he declined the opportunity. He was one of the few planeswalkers who chose to remain on Ravnica, helping the Gatewatch in their fight against Bolas. When Gideon suggested reactivating the Immortal Sun in order to prevent Bolas from escaping, Dack gave his support for the plan. Ironically, this would turn out to be his undoing: in the final stage of the battle, he was surrounded by Eternals and found himself unable to escape. While he fought off several of them at once, one of them managed to grab him by surprise and harvest his spark , killing him. His last thought before he died was of Mariel. Depicted in: Quoted or referred to: Despite playing a role in the War of the Spark story, Dack does not have a card for the War of the Spark expansion. This is due to the fact that the card designs were crafted before the story was made, and at the time it was not known that Dack would play a role in the lore. The fact that his role ended with his death irked many fans, as it signified a major disconnect between the marketing team, the creative writers, and the card designers - a character shown to have died in the trailer in a way that didn't match the lore, and was not honored by having a new card, was seen as a disservice to him. Among the items that Dack wanted to steal on Innistrad, were an Amulet of the Kralmar , a Bloodletter, the Seelenstone , the Praying Gargoyle, the Tome of Eons and Grimoire of the Dead . On Dominaria , he once stole a hellblazer ring from a vampire . Another magical item that he once stole was a Loxodon Horn. Using a tactile spell he'd once acquired off the Amulet of Tarantual, he was able to quickly scale walls. Dack once possessed a supremely powerful mystic pair of gauntlets that had helped him fight off a kraken . He had traded it away to cure a sleeping curse created by Ashiok . Despite appearing in numerous supplemental set and promotional cards , Dack only appeared in the art of one premier set card, Bred for the Hunt , and in the flavor text of one other, Artificer's Hex . Monty Ashley (October 27, 2011). \" Comic Book Previews! \". magicthegathering.com . Wizards of the Coast. Matt Forbeck (2012). \" Magic: The Gathering \". IDW Publishing Matt Forbeck (2012). \" Magic: The Gathering - The Spell Thief \". IDW Publishing . Matt Forbeck (2013). \" Magic: The Gathering - Path of Vengeance \". IDW Publishing . Jason Ciaramella (2014). \" Magic: The Gathering - Theros \". IDW Publishing ."}