{"text": "Dark Legacy is the tenth Magic novel, and the final pre-revisionist book. It was published in November 1996, and written by Robert E. Vardeman . War rages under the double moons of Dominia . It is Minotaur – Elf in a bloody conflict of dirty politics and foul magics. The human orphan Yunnie brings two formidable weapons to the battle. One is the Living Armor , which turns its wearer into a berserk killing machine. The other is the stone idol, Tiyint , which once awakened, slaughters with grim abandon. But Yunnie soon finds there is even more at stake than a kingdom. There is a third relentless enemy, under the ground - keeping the war going, and dining on the dead of both armies! Yunnie is a human orphan who is accepted into the Urhaalan minotaur community . The minotaurs are at war with the elves of Eln forest , but Yunnie quickly discovers that there is a third party involved. These rock/lava elementals , called the Niroso and the Coal Golem minions, are manipulated by the witch Sacumon to instigate the war by burning down both elven and minotaur homes, which of course the warring factions blame on each other. Sacumon tricks Yunnie into donning a Living Armor, which prevents him from speaking out about all he has seen to his minotaur tribe, as well as transforming him into a berserk warrior to lead them. Maeveen O'Donagh is human soldier who protects Vervamon the Elder, a scholar who wanders Terisiare to write about its history, cultures, and geography. They get tasked by lord Peemel of Iwset to find the Sigil of Iwset, the missing seal of his office. This quest, which is made more difficult by several members of both the Inquisition and various other factions in Iwset infiltrating their party eventually brings them to the Urhalaan valley. It turns out that Sigil has Yunnie since he is the bastard son of the fourth wife of lord Peemel and Vervamon. Maeveen's group helps defeat Sacumon and end the war, though at the cost of much blood on both sides. In the process, they animate a giant statue of  Tiyint, the god of the minotaurs that they animate to kill elves, but later lose control over. Maeveen is enamored of Yunni but is turned down by him. Meanwhile, Lord Peemel has declared war on the neighboring island nation of Jehesic . A war that is made more complicated by one adviser of the queen of Jehesic plotting against her mistress, and no fewer than three advisers to Peemel trying to oust him. Isak Glen'Dard is a shapeshifter who is secretly working for several sides as a messenger. Several factions in Iwset want the elves and minotaurs to be distracted by their war so no anti-Iwset alliance between them and Jehesic could arise. In the end, Maeveen brings Yunnie to Iwset, which results in the death of Peemel and most of his advisers, and the one adviser who wanted peace with Jehesic in charge."}