{"text": "Davriel Cane Davriel's Contracts Davriel Cane is the pseudonym of a mysterious diabolist , shadowmage and planeswalker living in Kessig on Innistrad . Davriel is a domineering figure with a pencil mustache, dark slicked-back hair, a black suit, a fluffy shirt, and a violet cravat. He is known as the Lord of the Manor of the small town of Verlasen , but at the nearby priory he poses as Lord Greystone . In public, he wears a cloak and a mask that has been charmed to obfuscate his features. The deep black cloak has a distinctive ghostly tattered bottom — like the frayed spirit of a haunting geist. When it moves, it leaves faint smudges in the air, obscuring his exact position. With it, he is able to hide in the shadows. The golden mask is manufactured in a demonic shape with large dark eyes, sinuous lines, and a gruesome mouth reminiscent of a jaw with the skin removed. Davriel uses a walking cane, with a sword hidden inside. Davriel is considered to be lazy and selfish. He is able to steal spells from the minds of other wizards and keep them available for a limited period of time. His eyes change color whenever he uses one of these spells. Davriel is primarily black -aligned but secondarily blue . A Worldsoul Entity is hiding in Davriel's mind, promising him unlimited power if he surrenders control. It heals Davriel's wounds. It also possibly provided Davriel with his planeswalker's spark . The Entity normally wanted him to draw upon it, use it for its true purpose — as a vast reservoir to power his spells. Spells that Davriel stole from the minds of others usually faded a few hours after he first employed them. Some lasted longer, and others vanished after a few minutes, particularly if he’d been holding them for a while before their first use. But with the Entity, he could make his stolen abilities last weeks under constant use. The Entity was aware that forces clashed in the Multiverse , and that the boundaries between planes trembled. It expected the conflict to find Davriel and would have him ready and prepared, ready to rise up to claim the position that the Entity thought to be rightfully his. For this purpose the Entity had led the unaware Davriel to Innistrad, for it knew that another one of its kind was hiding on that plane. After Davriel refused to absorb the power of the second Entity, his own Entity proclaimed him unworthy and threatened to find another host. It also predicted that Davriel would curse himself when that which he loved burned, as he would lack the strength to stop his enemies. It is unclear whether Davriel's spark is his own. It is possible that his planeswalking powers are granted by the Entity . Before his planeswalking days, Davriel was a young accountant from an unknown plane working ledgers for a partnership. Davriel's magic focuses on temporarily stealing spells from others. Ever since stealing the Entity — pulling it from the mind of a dying man — Davriel had been able to sense its vast potential. Davriel had used the power of the Entity only once, three years before his arrival on Innistrad. By that time in his life, he’d become comfortable with his powers — and with his strange ability to walk between different planes of existence. He’d spent years traveling, exploring, learning how enormous the multiverse was. He’d suffered enslavement and found vengeance. He’d become an expert at dealing with demons. At long last, he decided to claim himself a throne. It had been during that struggle — a desperate, climactic clash between armies and ideologies — that he’d finally relented, and drawn upon the Entity, which resulted in the destruction of both armies. Standing on that bloody field, Davriel had first sensed others hunting him. They’d arrived on the battlefield, drawn to the plane by his use of this power. He didn’t know who they were. Likely, they were allies of the dying man from whose mind Davriel had originally stolen the Entity. But he knew that whoever they were, they’d hunt him and destroy him. And so he fled. Davriel prefers a life of quiet comfort, but the dying man's allies have been hunting Davriel eversince he took the Entity. Staying one step ahead with the careful use of stolen spells, Davriel ensures his safety and, more important, his comfort, by entrapping demons with contracts so devious they can never collect. When the demons grow wise to his false bargains or his old enemies sniff him out, Davriel packs up again with great reluctance and finds a new plane with gullible demons to deal with. Desiring to fade away into obscurity, he moved to Innistrad, a plane where consorting with demons was seen as only a minor oddity. Davriel arrived on Innistrad around 4559 AR , about a year before the arrival of Emrakul and the madness of the angels . He moved to the backwater of the Approaches - the most remote location on an already remote plane - and immediately removed the previous ruler, a vampire known as Lord Vaast of the Markov line. Because he valued his peace and quiet, and because of the remoteness of the Approaches, the Corruption of Innistrad went by him fairly unnoticed. Davriel was caught up in local events when the citizens of Verlasen were attacked by geists , and the girl Tacenda blamed him for orchestrating that attack. They found out that an imposter had been using a copy of his mask and mantle. The church, equally thinking he was guilty, had sent several hunters and cathars to kill him. Wanting to restore his peace and quiet, Davriel decided to help Tacenda to find the imposter and restore the souls of the villagers to their stiffened bodies. Researching the church of the Nameless Angel , Tacenda and Davriel discovered that the people inside had been able to resist the attacks by the Whisperers, until a betrayer had let the geists in. As the Whisperers were unaffected by Tacenda's song but were stopped by the priests, Davriel reasoned that they were from the Bog. Additionally, he reasoned that the spirits that Tacenda had heard whispering were likely people from her own village. While at the church, a group of hunters and cathars from Thraben attacked the group, killing Davriel's demons Brerig and Yledris. During the investigation, Davriel began to suspect that Tacenda was more than she seemed. When he tried to steal her song magic, she was able to resist him. He questioned her if there was an entity, similar to his own, that talked to her. She denied this, but Davriel's Entity confirmed that she carried part of the Bog Entity . Not fully alive, it couldn't speak to her, except in the crudest of ways. It also confirmed that the majority of its power was supposed to be hidden in the Bog . Davriel's Entity urged Davriel to take the second Entity to become mighty enough that none would ever dare challenge him. However, investigating the Bog they found it to be empty, and they were besieged by a host of Whisperers under control of Tacenda's twin sister Willia . Fleeing to the Priory again, Davriel and Tacenda found the body of the Nameless Angel, killed after it had been struck by Emrakul 's madness. Its soul still lingered and it encouraged Tacenda to use a new song. With this warm joyful song, Tacenda defeated the Whisperers and absorbed their souls. With the help of Davriel, she also overcame and killed Willia. Willia's body released its part of the Worldsoul, and the Bog Entity was made whole inside Tacenda. At the moment that Tacenda was overcome by her power, Davriel's Entity urged him to grab the power for himself. Unwilling to become a creature that only caused death and destruction, Davriel refused to do it. Not long after, Tacenda vanished into nothing. As a result of these events, Davriel's presence became known to other planeswalkers, much to his chagrin. He was soon visited by a group of planeswalkers (possibly the Gatewatch ) looking to recruit him to their cause. He also received a cryptic message, although no further details are known. Davriel was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . While he had no interest in the conflict , he showed up just to make the other planeswalkers believe he was useless in a fight, hoping that would get them to leave him alone in the future. Rather than participate in the battle, he attempted to join a party being thrown by an Orzhov vampire who was celebrating the bloodshed. He also considered selling his soul to Rakdos . During the invasion, the trapped planeswalkers (including Davriel) met with Ravnican leaders to strategize. At the meeting, Davriel tried to buddy up with Ob Nixilis, although his motives were unclear. In spite of his earlier inhibitions, he ended up joining the battle: Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . He led an army of demons and devils alongside the half- devil Tibalt . He also fought off an Eternal by stealing the Elderspell from its mind (which may enable him to cast it himself). Davriel survived the battle, as he was one of the many planeswalkers who left Ravnica and escaped to safety as soon as Chandra disabled the Immortal Sun. Davriel has signed several contracts with demons . They serve him until they are able to reap his soul via certain conditions within the contracts. However, unbeknownst to the demons, Davriel has engineered these stipulations such that they are nigh impossible to fulfill. These demons include, but are not limited to: Voluptara (a.k.a. Miss Highwater ). Known as one of the most dangerous and wily of demons of the Nexrix Flame Expanse, she now works for Davriel as his accountant. Notably, she is the demon that Davriel interacts with the most within the novella Children of the Nameless , the first demon Davriel summoned on Innistrad, and the demon given the most control over his business dealings as Lord of the Manor. She wears a fitted grey jacket over a simple knee-length skirt and her black hair in a bun. She has ashen grey skin and dark red eyes, with small horns peeking up through her hair. In order to obtain Davriel's soul, she has to successfully seduce Davriel. However, he has never presented a hint of attraction towards her even though Miss Highwater has mentioned that she has had a history of successfully seducing both men and women. When Davriel suggests that he simply is not interested in women, Miss Highwater objects that she is not that \"oblivious\" and remarks that Davriel is \"something else entirely.\" Crunchgnar . A tall, muscular, wingless, and hairless Hartmurt demon. His inhuman features include horns swept back along with his head almost like a mane. Quick to heal and a skilled combatant, he wears a warrior’s leather and a pair of wicked swords strapped to his waist. As his designated bodyguard, Crunchgnar earns Davriel's soul if Davriel doesn't die before age 65 — but Davriel had already died before meeting the demon. Brerig . A hunched demon with a twisted figure, and features that vaguely resembled a hairless dog’s snout. He has black wings jutting out of his back, though they are gnarled and withered. To gain Davriel's soul, Brerig had to solve a riddle: \"What am I thinking of, right now?\" While Brerig gets five chances a day and the answer was set at the time of signing, the answer is so esoteric as to be nearly unguessable: a particular random rock from Cabralin . Miss Highwater notes that Brerig enjoys serving a long-term master, implying he may not have earnestly tried to answer the riddle. Gutmorn and Yledris . A pair of lightly armored Nightreach demons, with skeletal features, long, goat-like legs, and enormous wings. The two claim to be brother and sister because they were created on the same day. Their stipulation has not been explicitly specified though one may presume it has also been crafted with Davriel's guile. He has showed an open interest in trying to recruit Ob Nixilis . Associated cards: Depicted in: Quoted or referred to:"}