{"text": "Daxos is a demigod from Theros . He used to be a human soldier and an oracle of Heliod living at the temple compound in Meletis . Later he had become the friend, mentor, and lover of the planeswalker Elspeth Tirel . In childhood, Daxos was initially thought to be deaf and mute. He often stared into the sky or sat in a dark corner alone. However, his happiest moments were outside in the sun, moving his hands through the air as if tracing patterns. His mother Lidia had searched far and wide for someone to cure Daxos, but to no avail. Believing that her son’s soul had been severed from birth and was roaming the world, Lidia took Daxos into the Despair Lands to seek aid from Athreos , God of Passage. Lidia and Daxos entered the sacred cave that descended toward Athreos’s Shrine. To comfort her son, Lidia gave Daxos her glass amulet. Soon thereafter, Daxos spoke his first word, “Asphodel,” the flower for which the amulet had been fashioned. Lidia then peered into her son’s eyes and saw the stars of Nyx and quickly realized that Daxos had been born an oracle. Unlike other oracles, Daxos could hear and perceive all the gods at once. When Erebos heard Daxos speak, Athreos was sent to claim the child. As Lidia and Daxos fled to safety, Karametra (the god of mothers), sent her emissary (a giant sable ) to provide aid, but not before Athreos had hooked the young oracle with his staff. Lidia traded herself for her son, and Karametra’s emissary took Daxos to safety in the Nessian Forest . Daxos of Meletis. Elspeth met Daxos when she first journeyed to Theros, at the time she had witnessed a battle between Heliod and Purphoros and had taken the Sword of Chaos when it was knocked to the mortal world from Purphoros's hand. When Elspeth returned to Theros ten years later, she encountered Polukranos , a massive hydra that had slain countless warriors. Elspeth engaged the hydra with the help of Daxos and succeeded where many had failed, slaying it. This feat of heroism secured her place at the temple of Heliod as the god's champion . Months passed as Elspeth learned what the priests of Heliod had to teach, but mostly she found she enjoyed the time spent with Daxos. Elspeth and Daxos were met with the Setessan Hero Anthousa , who told them of the Nyxborn attacking humanity. Then, the ageless sphinx Medomai had nothing but dire predictions for the pair and a vision of Akros under siege. At Akros, they found that the minotaurs had constructed a giant wall to keep reinforcements out. Queen Cymede informed them that the Akroans had captured the satyr Xenagos and that he demanded to speak to Elspeth. Xenagos told Elspeth that he knew how they could destroy the army without ever battling. At his instructions, they raised the river that ran through Akros and swept the army away. After leading the armies of Akros to victory, King Anax ordered a celebration that was held to honor her victory. Together, alone in their tent, Daxos and Elspeth finally realized their feelings for each other. But it was not to be. Xenagos appeared as they slept, thrilled with how well she followed his plan. He controlled her and brought back her darkest memory, trapped with the Phyrexian Obliterator , striking out and killing it — only realizing too late that she had just killed Daxos. Daxos as a Returned Daxos was freed from the Underworld in a cruel bargain with Erebos . He became one of the Returned , traveling across Theros in an endless search for his beloved Elspeth Tirel — but she had taken his place in the realm of the dead. His blank, featureless face was hidden behind a golden mask twisted in a grotesque caricature of his grief. After being elevated to demigodhood , Daxos wears his mask on his arm as a shield. He was reformed by Heliod with the task of destroying every sign of other divinities in Meletis . Despite his former affiliations, he has no choice but to obey his god. Even after Heliod's imprisonment in Theros' Underworld, Daxos spends his days in unfeeling service to the god. His nights are spent dreaming of Theros's Underworld, where he wanders in search of Elspeth. Once a month, his dreams take him to a twisted memory of Elspeth's defeat of Polukranos that ends with her killing him. Daxos fought in defense of Theros during New Phyrexia's Invasion of the Multiverse . After Elspeth Tirel had taken the exploding sylex into the Blind Eternities , her consciousness was rebuilt by the spirit of Serra , who appeared in the guise of her mother and as Daxos. Associated cards: Depicted in: Quoted or referred to:"}