{"text": "Dhiren Baral is a human officer of the Consulate in Ghirapur on Kaladesh . A monolith of a man, stout and statuesque, with a face that seems to taunt those around it for being of lesser handsomeness. While officially tasked with persecuting criminals who are smuggling aether , he was also responsible for hunting mages that could become threats to society. Secretly a mage with anti-fire magic of his own, he was tasked to prosecute Chandra Nalaar for using fire magic. Even when the consuls deemed the search for the renegades too costly, he continued to hunt for them. He stabbed Kiran Nalaar in the stomach and torched Bunarat, the village where Chandra and her parents had been hiding. In his official story, Chandra was blamed for the fire and the death of her parents. When Baral tried to execute Chandra at Ghirapur , the threat ignited her planeswalker's spark and she planeswalked to Regatha . The ignition of her spark burned Baral's face, leaving him deformed and scarred and with an even more obsessive hatred of the Nalaars. After the event, the Consulate demoted him from captain to lieutenant. Baral started to torment the captured Pia Nalaar , telling her repeatedly over the course of many months that he had killed her daughter. When Nissa , Chandra and Oviya Pashiri found the hidden prison where Baral worked, he managed to trap the three in a Deadlock Trap , intending to leave them to suffocate. Baral later helped Tezzeret steal the best inventions and abduct the best inventors from the Inventor's Fair. Disallow After the Renegades took control of the central Aether Hub of the city, Tezzeret ordered Baral to distract Chandra, exploiting the hatred that existed between both. However, to keep the Consulate officer under control Tezzeret ordered Dovin Baan to supervise the operation. Arriving at the central hub, Baral began to taunt Chandra luring her away from her companions to an abandoned quarter of old stone buildings along the river. After negating a fire blast Baral began to lead her to his trap when his progress was blocked by a thorn wall conjured by Nissa, who had followed after them. At a disadvantage being confronted by two planeswalkers the Consulate officer was picked up by Baan in a thopter. Knowing he couldn’t defeat the two in combat he requested additional support but was denied by Baan reminding him they were just a distraction. Baral without mask Back on the ground, Baral starts up both a physical and psychological attack on Chandra, managing to get the better of her with a kick to her gut. About to deliver a killing blow he is stopped by a filigree bird sent by Mrs. Pashiri, just a platform away. Ordering his thopter to gun down Pashiri’s platform Baral turned his attention back to Chandra, who had already returned to her feet. Locked in combat Baral admits to her that Kiran Nalaar had not died in the fire, as the official report stated, but that Kiran had been murdered by the Consulate officer. Finally driven to her breaking point Chandra let loose her powers to the point of self-imploding, which had been Baral's goal all along. Unfortunately for Baral’s plan, Nissa was able to talk her down. Seeing he had no other choice, Baral tried to kill her, but was stopped by Nissa’s elemental. Escaping in Baan’s thopter the vedalken charges Baral with one count of murder, one count of attempted murder, one count of extrajudicial incarceration and multiple counts of falsification of the public record. Dhiren Baral was imprisoned in the Dhund . When the prison where ex-Consulate officer Baral was held was damaged by Phyrexian attacks, he lost no time in escaping. His delight at being free was cut short when he found himself facing a host of Phyrexians. He would have died, if not for the timely intervention of the notorious skyship pirate captain Kari Zev . When Kari Zev realized exactly whom she had rescued, she gave Baral a choice that was no choice at all: help her fight or be thrown overboard. Though they're allies, for the time being, Kari has tasked First Mate Ragavan to watch Baral for any sign of deception. They know that if they both survive, they'll find themselves on opposite sides once again. In light of his zealous defense of Kaladash the new Consulate overlooked all his past transgressions. In Magic Duels , Baral is represented during the Chandra campaign by the card Consul's Lieutenant . There was some debate on the part of Creative on whether Baral was white or blue , before settling on the latter. Associated cards: Depicted in: Quoted or referred to:"}