{"text": "Dina is a dryad mage-student at the Witherbloom College of Strixhaven University on Arcavios . Dina has a wicked sense of humor that more than often edges on the darker side. She doesn’t worry or watch what she says and speaks the thoughts in her mind as they come, never giving a moment to consider whether she might be out of place with her words. Even though she is quick-witted and confident, she is attentive, making her an excellent tutor to other students. However, her teaching methods can sometimes be a little out there, like Dina herself. She spends her time at Sedgemoor , the swampy marshlands on the college campus. She wears clothing mainly colored black, green, and brown, as fitting for a dryad. She relies on her professors for guidance, as Dina has no family. She usually carries a salamander -like pest with her and uses its essence to channel her magic. When she was young, the Brittleblight had come for Dina's glade. The inhabitants began to fall prey to subtle yet persistent melancholy. Over years, its grip quietly tightened, stealing dreams and replacing them with despair. As minds were overtaken by misery, bodies followed. Animals lay down and never rose again. Dryads grew fragile and decayed into husks. Despite the efforts of scholars across Arcavios, no one knew the genesis of the disease or how it found its way into a habitat. Dean Lisette was one such scholar, and it was she who had arrived at Dina's glade to rescue her before the sickness could take a permanent hold on her. But even Lisette's formidable expertise couldn't save the glade itself. As an advanced student of Strixhaven , Dina wished to revive the glade and started to research a forbidden resurrection spell. She found out that she needed the exotic root of the Esis tree as one of her ingredients. Realizing that the Esis tree was not native to Arcavios, Dina shifted her research to arcane rituals that theoretically could enable travel from one plane to another — from Arcavios to a place where Esis groves were plentiful . Without fail, these spells were almost impossible to understand, far above her ability to craft and promised painful fates worse than death. Her search had stalled until she found a specimen in the potions classroom of Professor Onyx . Proceeding with her experiment, Dina was drawing on the energy of a family of pests when a wayward bolt of Silverquill ink magic corrupted the process. It was thrown by Killian Lu , who was angry at being unfairly sentenced to Detention Bog by his father. The unwanted result of this coincidence was a colossal living swamp creature with a dark heart that started to destroy all living things and took off for Strixhaven as it was being lured by its magic energy. Working together, Killian and Dina managed to defeat the monster, but the Silverquill student was fatally injured. Sacrificing the last remains of the resurrection spell in her blood, and the hope of resurrecting her glade, Dina cured her newfound friend. When New Phyrexia's Invasion of the Multiverse started, the Phyrexians quickly burned through the defenses of Strixhaven. Professor Vess tasked a small group of surviving students - Rootha Squallheart , Quintorius Kand , Zimone Wola , Dina and Killian Lu - to search for the Invocation of the Founders in the Biblioplex. The group found it and with a representative from each school they could activate it, but the compleated Nassari distracted Rootha enough that Quint could only try to make up her contribution with raw magic and lifeforce. The result was not entirely successful, and in the process, Quint's spark ignited and he planeswalked away. Though the invocation managed to repel the main wave of attackers, the students were wounded and Quint was missing. Though Zimone and Dina had been friends before, they'd never collaborated on a cross-college project. Under pressure of certain death, they blended their magics together and found to their delight that the intersection of Quandrix mathematics and Witherbloom biology led to new interdisciplinary magics never before seen. Using mathematical theorems, Zimone enhances Dina's plant growths, allowing the two of them to deal exponentially more damage than they otherwise would have apart. Dina appears in the trailer for Strixhaven: School of Mages . Depicted in: Quoted or referred to:"}