{"text": "Domri Rade was a human shaman planeswalker and a member of the Gruul Clans . He wasn't always a member of the Gruul, having been orphaned to the streets and ruins of Ravnica before he could even remember. Domri Rade was a chaotic power-hungry individual. He always admired the Gruul ways of life and wanted to become a part of them. The young, diminutive shaman always felt like he had something to prove in a guild dominated by hulking brutes. Through his desire, Bolas found him an easy target to manipulate for his plans during the War of the Spark. He takes great joy in destroying the architecture of Ravnica, embodying the fundamental goal of the Gruul clans wholeheartedly. During the War of the Spark, Domri showed a bit of naivety by thinking Bolas would allow him to join his side, simply because both wanted to destroy Ravnica. During his untimely demise, he revealed an almost child-like mentality, begging for forgiveness as the dragon ruthlessly stole his spark and cast his empty shell aside. Domri Rade was centered in green and red mana . Through his shamanic magic he could summon and command great beasts . Domri was orphaned and abandoned in what remained of Ravnica's wilds at a young age. He had always admired the Gruul, idolizing them for having the guts to fight the powers that he had to deal with every day in his adolescence. Unfortunately, he was too small and wiry for any clan of the Gruul to claim him. Rejected, but not dejected, he continued to strive to be what the Gruul wanted. Without a clan to call his own, he found companionship in the feral beasts of the ruins he called home. He developed an affinity for them, the first stirring of magic that he could claim as his own. This skill would finally earn him his long desired place among the Gruul. When the Orzhov Syndicate pushed into the Rubblebelt, Domri commanded a herd of ragebeasts into driving them out, a feat that earned the eye of the Guildmaster himself, Borborygmos . The cyclops declared Domri an honorary member of the Burning Tree clan. “Your precious laws can’t save you now!” His life was normal amongst the clans, pretend fighting with his best friends Whip and Lakkie, further smashing the ruins of the Rubblebelt, and in general being a nuisance to everyone he encountered. It was a mundane life, but all that changed when he underwent the Gruul rite of passage. It all changed when it came time for him to be buried alive. Teenage bravado led him to brag to his friends, but as the shaman of his clan led him further from his Rubblebelt home, he began to fret more and more. Reaching Utvara , they prepared him with the ritual magic to keep his body alive, but his mind was left unprotected. As the dirt fell upon him, all the boy's bluster fled and panic set in. He clung to what he knew, prayed to the old gods for deliverance, and struggled as hard as he could under the crushing weight of the cold earth. It was then, in the darkness, that his eyes were opened. He awoke under the Nayan skies, confused but happy to be alive. He was amazed at the lush, untamed growth of the world around him, and in his exuberance called out... gaining the notice of a Gargantuan and nearly getting himself killed. It was only thanks to the timely intervention of a group of Cylian godtrackers that he survived. He babbled to them about his own world, and the more he thought of his home, the more real his vision became until at last, he was pulled once more through the Blind Eternities to his homeworld. Domri becomes Guildmaster without knowing he was a pawn for Nicol Bolas With the help of Bolas he rose up through the ranks of the Gruul, becoming the guildmaster by defeating the cyclops Borborygmos . The shaman Nikya saw his ascension as the first sign of the coming of the End-Raze . As the precarious accord among the guilds teetered on the brink of collapse, Domri led the Gruul in a concerted effort to tip the world into chaos. He amassed an enormous mob to rampage through the city streets, making sure that every guild suffered painful losses to keep them at each other's throats. Domri Rade's death When the War of the Spark started, Domri initially was fighting against the Eternals and even helped save Kaya in a tight spot. But when he saw Bolas topple the Vitu-Ghazi elemental he decided to change sides because he thought that they could overthrow the other guilds by fighting for the dragon. The Elderspell was cast right after Domri decided to fight for Bolas and then he became the first named planeswalker whose spark was harvested. As spark harvesting by the Eternals is lethal, Domri died. All the moisture in his body was drained. Domri appears in the trailer for Ravnica Allegiance . In the video game Magic: The Gathering Arena , Domri is voiced by Jason Spisak . Alara Ravnica Associated cards: Depicted in: Quoted or referred to: Adam Lee (January 30, 2013). \" The Burying, Part 1 \". magicthegathering.com . Wizards of the Coast. Adam Lee (March 6, 2013). \" The Burying, Part 2 \". magicthegathering.com . Wizards of the Coast."}