{"text": "Drannith was the largest city on the plane of Ikoria , a human sanctuary with tens of thousands of residents. It was destroyed by Lukka during New Phyrexia's Invasion of the Multiverse . Located on the lush plain of Egali in the lowlands of Savai, it was rooted by the Argalith , a gigantic crystal pillar, which is the largest single crystal on the plane and a symbol of hope and protection for Drannith's residents. The Argalith formed the city's central axle and was the foundation of Drannith's magical defenses against monsters. The Citadel was built around it. The city further featured crystal-topped spires, straight-backed radial bridges, winding markets, hole-in-the-wall restaurants, and unexpected parks. Elevated highways called boulevards radiated out from the Citadel to all points of the compass. The city was protected by concentric circles of high stone walls. Drannith's highly trained military was second-to-none at warding off monster attacks; according to the inhabitants, its walls had never fallen since their creation. Drannith was founded at a time when humanity's numbers were wearing thin, which is perhaps why an unforgiving fear of monsters was rooted deep in their culture and ideological leadership. According to a mythos, it was the continued attacks of Snapdax against human settlements that forced the survivors to build the fortified city. Both monsters and bonders were rejected from the city. The Drannith Defense Force, the Coppercoats , was the most well-resourced, powerful military force in the world. The Fourth Ring was the outermost of Drannith's concentric defensive zones, and was dedicated to pasturage and timber forests. Because it was too large to be patrolled by the Coppercoats, it was uninhabited. The shepherds and loggers retreated to well-guarded walled hamlets in the Third Ring at night. The Second Ring was the heart of Drannith's hinterland, a wide belt of flat country where every available square foot was planted with crops. The First Ring was guarded by the broad \"secondary wall\", which was twenty feet high and covered with warning crystals, and protected by turreted ballistae. It was patrolled by the Coppercoats and the Arcane Corps. The First Ring once had been the entirety of the city's domain, but later consisted of sprawling military complexes. Beyond the First Ring stood the primary city wall, which had never been breached. During New Phyrexia's Invasion of the Multiverse , the compleated Lukka and the Copper Host were sent to attack Ikoria. Lukka immediately attacked the city that had cast him out for his differences, to devastating effect. The monstrosities of the Copper Host quickly overwhelmed Drannith's strongest defenses , and the city was reduced to rubble. The survivors fled to Lavabrink . Associated cards: Depicted in: Referred to:"}