{"text": "Edgar Markov is the founder of the Markov bloodline, and the very first vampire of Innistrad . Thousands of years ago he was an aging human alchemist , experimenting with ways to achieve agelessness for himself and his only grandson, Sorin . When famine was sweeping the land, the demon Shilgengar convinced  Edgar to start experiments with blood. Markov and his sons trapped the angel Marycz in his laboratory and exsanguinated her, preparing a decoction from her blood and created a ritual which caused his subjects to feed on the blood of other beings. It provided sustenance to those few, but the demand for blood also culled the overall population, reducing the number of hungry mouths to feed. However, when he forced his grandson to turn the trauma of the transformation caused Sorin 's planeswalker spark to ignite. Sorin soon left the plane and his grandfather for the first time. However, worried about the state of his homeplane, he would frequently return to visit his home. More than 7000 years old, Edgar often tired of the world around him, and rested until the world grew so alien that he could discover it anew. His coffin lay in a mausoleum at the very deep in the vaults of Markov Manor . Often, he would wake for small spells. Sorin left him books for those cases—things he thought exemplified the current state of Innistrad. Sometimes, when Sorin needed his grandfather's counsel, he would even wake him. The two would speak in the drawing room of the dead, and when it was done, Edgar would rest once more. It always left Sorin feeling like a child—but the advice had not once failed him. At some point during the Eternal Night caused by Emrakul 's presence in the Moon of Innistrad , Sorin entered Edgar's crypt only to find it empty. Olivia Voldaren had stolen the coffin. After staging an elaborate wedding party she awakened Edgar, immediately charming him and proposing. The confused Edgar agreed to her marriage proposal. During the exchange of vows between Olivia and Edgar, Sorin attacked Olivia and at the same moment Katilda 's spirit manifested by coming out of the Key. Katilda used her powers to free Sigarda from her prison. Being free Sigarda exploded her angelic aura in fury causing the surrounding stained glass to shatter, hurting or killing many wedding guests. Olivia and Edgar were not severely injured. To escape Sigarda’s ensuing wrath, Edgar fled into the manor’s sanguitorium. He was confronted by Sorin, and the two came to blows as they hurled insults and viciously attacked one another. During their struggle, Edgar expressed disappointment in Sorin’s naivety and wasted potential. Sorin struggled to understand his grandfather’s careless views and experienced flashbacks to the time of their family’s descent into vampirism. As if continuing his fall from grace, Sorin came back to his senses to find Edgar standing above him and looking down in disgust. Following his duel with Sorin, Edgar returned to the fighting in the ballroom. He attacked Teferi but was stopped by Sorin who had become empowered after drinking from the blood pit that he had fallen into. With a greatsword in hand, Sorin quickly overpowered Edgar. Rather than killing him, Sorin showed mercy and ordered his grandfather to leave. Edgar left to find Olivia and attempted to put an end to their plans. They were found by Arlinn Kord and her packmates, including Tovolar who was held back from attacking Edgar by Arlinn. Olivia dropped the Moonsilver Key in defeat and escaped with Edgar through one of the broken windows, barely escaping from the jaws of Tovolar. Associated cards: Depicted in: Quoted or referred to:"}