{"text": "Eladamri was the leader of the Skyshroud elves of Rath during the reigns of Volrath and Crovax . Though he was a skilled warrior, his greatest talent was his leadership, which he used first to unite the people of Rath in resistance against the evincars and later to tie together the various peoples of the Coalition on Dominaria . Eladamri was born on Rath in the Skyshroud Forest, which had long been opposed to the Stronghold . Few details about Eladamri's early life are known, but what is known is that he was the son of Kelimenar and later married and had a daughter, Avila . His wife died in a fire that destroyed their home. This was likely perpetrated by Stronghold agents, which would explain Eladamri's intense hostility towards the regime. His courage, tactical thinking, and leadership skills became clear as he grew older, resulting in him becoming the leader of the elves, the Lord of Leaves. Eladamri also fostered relations with the human enemies of the evincars, offering them the relative safety of the forest and therefore strengthening the resistance effort. Eladamri first became involved in the events surrounding the Phyrexian Invasion of Dominaria when Weatherlight appeared over the Skyshroud and was attacked by Predator . The fight left Weatherlight badly damaged, forcing it to land inside the forest, which brought it to the attention of the elves. During the fight with Predator , Gerrard Capashen had been knocked overboard and into the forest. Hanna was convinced that he was alive and so she and Mirri wandered into the forest to try to find him. However, they were soon captured by Eladamri's soldiers and brought before the elf lord for judgment. Luckily, Gerrard had survived his fall and had happened upon the Oracle en -Vec , who was traveling to meet with Eladamri but upon meeting Gerrard declared him the Korvecdal , the uniter of the tribes. The Oracle's proclamation convinced Eladamri to aid the Weatherlight crew in their rescue mission, believing that together they could bring an end to Volrath's regime. It was decided that Eladamri and the Oracle would lead a frontal assault against the Stronghold, while Weatherlight infiltrated the fortress through the back. Eladamri rallied as many elves and humans as he could and began his attack. His forces battled against the Stronghold's garrison, drawing their attention away from inside the citadel. Initially, the rebels were successful, pushing forward to the infamous Portcullis . However, they were unable to breach the gate and were soon taking heavy losses. As he spotted Weatherlight fleeing towards Ertai 's portal , with Predator in hot pursuit, Eladamri realized that the day was lost and was forced to call a retreat. Upon his return to the forest, Eladamri suffered an even greater loss: his daughter, Avila, had been murdered in her sleep by a Phyrexian agent while he was away fighting. Worse, the agent had also stolen her body for some unimaginable purpose. However, Eladamri had little time to grieve, as other news came, telling him that Volrath had disappeared during Weatherlight' s attack, leaving the Stronghold in chaos without a leader. Furthermore, the Predator had been crippled in battle and was having to undergo extensive repairs. Thus, despite the heavy losses the rebels had suffered, it seemed that the Stronghold had lost even more and was wide open for another attack. However, before he could attack the Stronghold again, Eladamri was confronted by another threat. The lead candidate for the evincarship, Crovax , had decided to prove himself by attacking the Skyshroud and exterminating the rebel threat. Eladamri was well-prepared for Crovax's attack, however, and easily outflanked him by seizing the outermost border town, trapping Crovax's army in a pincer movement. Eladamri intended to slaughter the entire Expeditionary Force, but his plan was ruined by a group of elves that tried to rescue several captives that Crovax was holding. The group was discovered inside the enemy camp, which forced Eladamri to engage the enemy sooner than he had wanted to. This meant that more of the Expeditionary Force survived, including Crovax. Despite having failed to kill Crovax, Eladamri was still at an advantage, commanding an unprecedented number of rebels. He met again with the Oracle en -Vec, who declared him the true Korvecdal, but warned that he would have to leave Rath for another world before becoming its savior. While Eladamri pondered the Oracle's message, word reached him that Predator was airborne again and would soon be fully operational. Knowing that the skyship posed a serious threat to any rebellion, Eladamri resolved to infiltrate the Stronghold and destroy the vessel while it was still vulnerable. Eladamri planned to enter the Stronghold by disguising several of his most loyal rebels as il -Vec and il - Dal warriors, who would then take Eladamri into the fortress as their prisoner. The plan worked perfectly until Eladamri was taken into the throne room to be brought before the Phyrexian emissary, Belbe . Eladamri was struck by the horror of what he saw: Belbe looked identical to Avila. His daughter had not just been murdered, her corpse had been twisted into the Phyrexian pawn that stood in front of him. Eladamri quickly broke loose and wildly struck at the abomination. He was then restrained and taken to the dungeons for interrogation. In prison, Eladamri underwent torture at the hands of Greven il -Vec but refused to reveal any information. Frustrated, Greven withdrew, leaving Eladamri alone as he believed that the elf lord was unconscious. Eladamri seized his chance to break free, breaking his bonds and limping away from the dungeon. During his escape, he happened upon the cell of Takara en -Dal , the daughter of the Weatherlight crewman Starke and a former rebel leader in her own right. He freed the emaciated girl and together they tried to flee the Stronghold. Along the way, they met up with the survivors of the failed attack on Predator and made their way to the Dream Halls, where they found themselves trapped. Their situation seemed lost as Greven and the new evincar, Crovax, began assaulting the heavily fortified chamber. However, they were surprised when Belbe politely knocked on the door of the room, requesting negotiations. Strangely, Belbe claimed that she had become opposed to the Phyrexian regime. She showed Eladamri her private portal device, which she could use to transport Eladamri and a few of his allies to the safety of another plane. Remembering the Oracle en -Vec's prophecy and the Phyrexian invasion plans, Eladamri knew he had to go to Dominaria . As the Stronghold forces began to break through the barricade, Takara dashed through the portal, followed at Eladamri’s insistence by Liin Sivi . Eladamri himself hesitated a moment, looking back at the mockery of his daughter. He calmly took off the carved wooden vial around his neck and dashed its contents over Belbe. The poison was the same as had been used to kill Avila, having been dropped by her assassin. It quickly overpowered even Belbe’s robust physiology, killing her in a matter of seconds. With his daughter laid to rest, Eladamri finally fled through the portal. After arriving on Dominaria, Eladamri set about trying to ready its nations for the imminent war. He traveled to Llanowar , where he tried to convince the king to ready his armies. However, King Fhedusil would not listen to him, thinking Eladamri was a foreign warmonger and a usurper. Unfortunately, the war came sooner than even Eladamri had anticipated. As he made his plea to the king, Phyrexian airships began bombarding Llanowar with plague bombs, causing enormous casualties, including Takara and the king himself. Eladamri took charge, guiding the survivors of the court to the relative safety of the Dreaming Caves, in which the beliefs of the elves began to come to life. As their minds were focused on the horrors surrounding them, Eladamri tried to calm the survivors with song and speech to stop their fears from manifesting. This worked for enough time for Weatherlight to arrive and dispatch the plague ships. Weatherlight also brought salvation from the plague, as Orim had worked out how to immunize against it. To save Llanowar, the elves of that forest pledged their loyalty to Eladamri, declaring him the seed of Freyalise , the planeswalker they worshipped as a goddess. However, the war was far from over, so Eladamri moved on to his next battlefield. Eladamri and his new elvish warriors were taken to Koilos , where a fierce battle was being fought for control of the permanent portal to Phyrexia found within its caves. There, he took charge of half the metathran army, as their commander Thaddeus had been captured. Alongside Agnate , he fought against the amassed invasion force in a fierce battle. Eventually, the Coalition forces were able to push forward with the aid of the Nine Titans , capturing the caves and destroying the Phyrexian portal. With the battle won, Eladamri enjoyed a brief respite to join in the victory celebrations. The celebrations at Koilos lasted only a short time. Before Eladamri’s eyes, the landscape of Dominaria shifted into the familiar flowstone of Rath. Standing upon it were the massed legions of Rathi and Phyrexians—millions of them. Eladamri tried to prepare his men for the next battle of Koilos, knowing it would be a futile effort. However, others had a purpose for Eladamri beyond a valiant death. Eladamri, Sivi, and his elves were taken to the frigid wastes of Keld by the planeswalker Freyalise. There she showed him another result of the planar overlay: Skyshroud had materialized in the hostile climate, where it would soon surely die. The elf lord bargained and pleaded with Freyalise to save the forest, so she created a protective ward to preserve it. She then gave Eladamri his new task: to unite his people with the native Keldons to aid in the defense of their lands. He met with the Keldon leaders, including Astor , and found common ground with the ordinarily hostile race. They combined forces and rode into battle to reclaim the besieged Keldon Necropolis , where it was prophesied that the honored dead of Keld’s past would rise again to retake their lands. The battle was as harsh as Koilos had been, with neither side gaining much of an advantage as it wore on. Eventually, however, the Keldon Twilight took place as the fallen chieftains returned to life to fight once more. Unfortunately, they instead sided with their undead kin, the Phyrexians. The battle for the Necropolis descended into chaos as the living Keldon warriors were forced to commit the ultimate sacrilege by slaying their undead champions. The lunacy reached a peak when Doyenne Tajamin struck one of the undead with her sacred cudgel, which double blasphemy caused the weapon to surge with energy and trigger a volcanic eruption beneath the frozen terrain, resulting in a massive flood that swept away the Phyrexians, elves and Keldons alike. Eladamri assumed that this would be his death, but once again he was spared. The mythical Keldon longboat Golden Argosy emerged from the depths and saved the remaining warriors of Keld to take them to the next battle—the fetid shores of Urborg . Eladamri arrived in the swamps to be reunited with the metathran army he had fought with at Koilos. He also met their new leader, Commander Grizzlegom . The two commanders joined forces in charging toward the Phyrexian command center, the Stronghold. The Coalition forces advanced rapidly towards their target but were held back when they reached Portcullis. Once again, Eladamri was unable to breach the entrance of the fortress and was forced to fall back and entrench his army. As he searched around the volcano's exterior for an alternate way in, Eladamri came across Sister Nadeen Dormet and her fellow stone dwarf rock druids, who were tunneling into the volcano right under the notice of the Phyrexians to cause it to erupt. Eladamri managed to ally with them, agreeing to protect them once they reached the inside of the volcano in exchange for using the tunnel to attack the fortress from behind. The dwarves, along with the elves, minotaurs , metathran, and Keldons—plus Liin Sivi, who had remained at Eladamri's side throughout—snuck up behind Portcullis, defeated the outflanked Phyrexians and destroyed the gate before raiding the Stronghold. Inside the fortress, Eladamri and his compatriots made rapid progress toward the throne room. However, they were stunned to discover not Crovax inside, but Gerrard, Squee and the decapitated, but still living, head of Urza . They did not have time for much explanation, however, as Yawgmoth began emerging through the planar portal in the throne room. The allies fled for Weatherlight , which flew the various warriors to safety just before Yawgmoth's death cloud could consume them. Gerrard successfully sealed off the volcano by plugging the crater with a plague ship, but it became clear that Yawgmoth could not be contained inside. Already, he had caused the dead across Dominaria to rise as his new army. Even the soil had risen to form mud-men that ran rampant, slaughtering the living. Eladamri and Grizzlegom convinced Gerrard to land them and their troops on the ground, where they could fight the final battle of the apocalypse. Eladamri, Sivi, and their host of surviving Keldons and elves thus set off to do what they could to stop the carnage. They tried to save the Magnigoth Treefolk that were being suffocated as the soil that normally nourished them had risen and covered their leaves. The Keldons made fires to turn the mudmen into pottery while Sivi and the elves climbed the trees and pulled the creatures onto the flames below. This plan succeeded in saving the Magnigoths from the mud-men, but they were soon struck down by Yawgmoth as his death cloud broke free from the volcano and began descending across the world. Eladamri and Sivi found themselves stuck between the descending cloud and the fires below them. The two, who had gradually fallen in love across their many battles together, decided to defy Yawgmoth one last time by choosing to fall to their deaths rather than let him kill them. Associated cards: Depicted in: Quoted or referred to:"}