{"text": "The Elder Dragon War was a great conflict in the mythohistory of Dominaria between beings collectively known as Elder Dragons . In the aftermath of the four or five thousand year conflict, only seven of these Dragons survived. The rest were killed or stripped of their powers. The war started when seven descendants of Vaevictis Asmadi raided the lands of Nicol Bolas . After defeating them with his army, using tactics previously employed by his dragon hunter subjects, Bolas was confronted by Vaevictis and his three siblings Rubra , Ravus and Lividus . Although Rubra was killed by a poisoned arrow, Bolas' army suffered a shattering defeat and had to retreat in the mountains. There, they were again confronted by Ravus and Lividus. Now, the sorcerers of Bolas' army managed to kill Ravus. Bolas himself overpowered Lividus' mind and turned him against Vaevictis. This was enough to escape. After these events, Bolas changed his tactics. Manipulating the many dragon clans, he turned them against each other. Palladia-Mors was easily influenced to join the fray. Dragons from one clan raided the mountain fastnesses of a cousin clan. Amid the snow-capped peaks the dragons fought in thunderous battles, claw to claw, fire to fire. Charred flesh rained down from the heavens. Bone shattered at the base of cliffs. Those whose hunger could never be sated tore their way through the dying, feasting upon the bloody flesh of their own kind. Dragons turned their gaze upon the fields and herds of the humanoid settlements. Some wished merely to devour the humanoids as they had hunted down and devoured wild herds. Others wished to manage them like cattle, ripe for culling when their hunger grew sharp. A few wished to teach and guide the humanoids, but their efforts were often met with ingratitude and misunderstanding. Even the clever Chromium Rhuell took to hiding himself while he pretended to be something he was not, lest he be scorned by the humans he claimed did love him or eaten by the dragons who despised his mealy-mouthed philanthropy. Dragons crossed the mighty seas to find new lands in which to feed their hunger for flesh and for power. When even those distant shores became too crowded, then dragons fought each other with tooth and claw, with fire and ice. Under dragon standards, they raised proud war bands from among the humanoids who worshiped or feared them. Sorcerers who sought a dragon-like power through mastery of their magical gifts came crawling to offer their services, for in all the wide world no creature is as powerful as a dragon, not in the beginning of days and never across all the unending span of eternity. Even the wise Arcades Sabboth threw his might into the great war as he listened to the whispers of Bolas that brushed through his mind. So the war raged while Bolas watched from a safe distance, confident that he would be the final victor. The war lasted many human generations, and in the end Bolas ruled half of Dominaria. The last clash of the war took place on Jamuraa , between the troops of Nicol Bolas himself and Arcades Sabboth. Only the unexpected intervention of Ugin prevented the ultimate defeat of Sabboth. The war ended there and then, because in rage and envy of Ugin, Bolas' planeswalkers' spark ignited and he planeswalked away. Referred to:"}