{"text": "Eldrazi Lineages Eldrazi is a creature type describing an ancient race native to the Blind Eternities that have neither physical form nor color alignment . Their nature is ceaseless hunger, so they travel between planes devouring the mana and life energy until the plane's destruction. Three Eldrazi titans were previously bound on Zendikar : Emrakul , Ulamog , and Kozilek . Emrakul warps biology, Ulamog warps physical properties, and Kozilek warps reality. It is unknown whether more titans exist elsewhere in the multiverse, although Ugin told Nahiri and Sorin that there were only three true Eldrazi Titans in the Multiverse during their first meeting. Each titan lives outside of the planes. When one wants to feed, it extends a part of its \"body\" into the plane, to create a physical manifestation of itself there, as well as an army of drones that are extensions of its body and will. The spirit dragon Ugin compared this to a man sticking his hand into a pool of water; the man being the Eldrazi titan and the water a plane. The fish—those who dwell on the plane—see only a part of the man—his hand. Likewise, the inhabitants of a plane can see only a part of each titan. Even if the lesser Eldrazi appear to be independent beings, their physical forms are just part of a greater entity outside the plane; they are all just part of the titan that made them. The Eldrazi were introduced as a creature type in Rise of the Eldrazi and returned in Battle for Zendikar . Some of the cards were reprinted in Modern Masters 2015 and Duel Decks: Zendikar vs. Eldrazi . The Eldrazi from the original set all featured the annihilator mechanic . Drone is an additional creature type for some Eldrazi. They are generally smaller and are aligned with colored mana. Those of Battle for Zendikar , though still requiring colored mana to cast, have devoid and are therefore colorless. Processor is an additional creature type for some Eldrazi, introduced in Battle for Zendikar . Each one has an ability that requires you to put your opponent's exiled cards into their graveyard for some effect . During design, this mechanic was known as \"digest\" or \"process\". Scion is an additional creature type for some Eldrazi tokens . They are colorless 1/1 creatures that can be sacrificed for . They are exclusive to Battle for Zendikar block . Spawn is an additional creature type for some Eldrazi tokens. They are colorless 0/1 creatures that can be sacrificed for . They are exclusive to Rise of the Eldrazi . Over the four Eldrazi sets, the Eldrazi have been given particular keywords that mark it as a faction. In Rise of the Eldrazi , the broods were intermixed, but over the next three sets, the broods had their distinct mechanic that highlighted how they interacted with the world. Spawn tokens and Annihilator were both exclusive to Eldrazi, and cast triggers were established as part of their unusual powers. Later on, Scion tokens were used much like Spawn for Battle for Zendikar and Devoid is introduced as a way to link Eldrazi spells mechanical without using the Tribal keyword. Eldritch Moon sidestepped the Devoid tag by using double-faced cards and color-identifying Emerge costs. Battle for Zendikar highlighted Ulamog's brood through the Ingest - Processor dynamic, demonstrating its consumption of the environment. The high number of exiling effects among interactive spells also adds to this play style. Oath of the Gatewatch introduced colorless costs, using a resource that was never required before, linking to the reality-shifting nature of Kozilek's brood. In this nature, it also results in color pie aberrations, as it gives monocolored decks some unusual abilities they may not gain otherwise. Eldritch Moon introduced Emerge and Meld . Flavorful, these spelled out that Emrakul does not truly generate spawn so much as warp other beings, which is also depicted in the various double-faced cards. Though each lineage has distinct anatomy, each of them seems to have a commonality. Each has a proboscis located somewhere near a joint that acts as a feeding tube, attaching to a subject and draining them of life. Eldrazi proper and their infant spawns have no color alignment and the mere presence of larger Eldrazi can cause reality to dissipate. However, Eldrazi drones born to serve the larger base species are often aligned, being a few examples of the creatures that are colored. Eldrazi drones, while formidable, are not as powerful as their larger counterparts and do not have the Annihilator ability. The progeny of Ulamog is characterized by having a bony mask over their heads, being completely featureless. They also possess writhing tentacles in addition to their aforementioned bisecting arms. The lineage of Emrakul is perhaps the most bizarre of the Eldrazi, possessing a strange lattice-like flesh composition and being of unnatural hues (predominately of bright purples, blues, and reds). Like the lineage of Ulamog, many possess tentacles seemingly for no real purpose. They have no discernible sensory organs and many do not possess conventional forms. Those born from the lineage of Kozilek have multiple eyes all over their body (curiously, rarely on the head) and have large, black jagged plates that float around them. They are also characterized by bisecting arms which they share with the Ulamog lineage. The Eldrazi are genderless, lack apparent biological sex, and display no awareness of the concept of gender. However, the question of their gender, or at least proper pronouns, is a recurring topic among players. Arguments for gendered pronouns rest largely on comparisons to the Zendikari deities they inspired, and on dimorphism between the broods. The issue has been further muddied by inconsistent pronoun use in official sources. In particular, Emrakul has been referenced by male, female, and neutral pronouns. The most recent official sources on the matter are cards from Battle for Zendikar and a blog post by creative director Doug Beyer , which agree on the use of male pronouns for Ulamog and Kozilek and female pronouns for Emrakul . The Eldrazi titans are sentient beings by most definitions. They are likely vastly intelligent, but in a radically different kind of intelligence from that of any other sentient being. While in general unfathomable, the telepath Jace Beleren managed to communicate with a conceptualization of Emrakul within his mind while on Innistrad. The conceptualization acknowledged that she did not realize that the telepath existed and that what he had seen was an attempt of his mind to conceptualize something that could not be understood otherwise. It is unknown if the other two Eldrazi titans had similar means of expressing themselves.\nWhen attacking a large Eldrazi, the vampire Drana had visions revealing that the Eldrazi of Ulamog's lineage knew they shouldn't be on Zendikar. When caught in Kozilek's reality-warping field, General Tazri had another Vision in which Kozilek obliterated the Gatewatch, proving his awareness of the planeswalkers. Eldrazi are known to follow leylines to move on a plane's surface. Type of trail left by the Eldrazi Titans and their lineages. The Eldrazi have various means of consuming planes, that vary among broods and situations: Ulamog and his brood leave behind a white, coral skeleton-like substance. Kozilek and his brood leave behind formations that closely resemble colorful bismuth crystals. Emrakul and her brood are known to leave behind yellow dust, and seemingly convert the landscape into flesh and bone. If too much of a plane is consumed it will break apart in a flash of light. Millennia ago three planeswalkers ( Sorin Markov , Ugin , and Nahiri ) decided to rid the Multiverse of these terrible creatures. Ugin told them that it wouldn't be a good idea to destroy them and instead helped them imprison the Eldrazi on the plane of Zendikar. The Three decided to force the Eldrazi into physical form and trap them on a plane, sacrificing that plane for the well-being of the Multiverse. They searched for a plane with lush ecosystems and uniquely dynamic mana—a powerful lure for the Eldrazi's insatiable hunger. They decided on Nahiri's own Zendikar . Sorin Markov lured the Eldrazi to the plane, directing their hunger to that unique mana, Ugin used his invisible breath to combat the Eldrazi and his colorless magic to bind them to the plane, and Nahiri had constructed a massive network of stone hedrons , whose power would form the bars of a planewide prison, forever preventing the Eldrazi from leaving. Ugin arranged the hedrons to direct leylines of energy, which were not to be disrupted . The planeswalkers concentrated the power of their imprisonment spell in a secret location deep inside Zendikar's mountains of Akoum : a subterranean chamber called the Eye of Ugin . To make sure that the imprisonment would not be broken, the three planeswalkers sealed the chamber with a mystical lock: the Eye of Ugin could only be reactivated by the presence of three planeswalker sparks—and the colorless, invisible breath of Ugin, the spirit dragon himself. The planeswalkers' trap worked. Emrakul, Ulamog, and Kozilek manifested in physical form on Zendikar, became confined by the magic of the network of hedrons, and thanks to the magic of the imprisonment spell, sank into harmless dormancy. Their mission was complete, and the planeswalkers disbanded.  Sorin and Ugin left the plane, while Nahiri remained to watch over Zendikar and protect the Eldrazi's prison. A few thousand years after the imprisonment of the Eldrazi by The Three , the noxious creative force of Ulamog became an infection that took hold of the people who dared to live in Akoum 's mountains despite the tectonic instability of the region. They became a sort of cult devoted to an imagined deity of the mountains, established a temple near the site of the prison, and began performing rituals inspired by their growing madness. The cultists avoided the notice of the increasingly reclusive Nahiri and over time and multiple generations, their rituals proved effective in loosening the bonds of the Eldrazi prison. When the hedron network was disturbed, their prison proved tenuous, and they came close to breaking free. A small fraction of their power was able to emerge which let loose legions of Eldrazi drones . Zhulodok was among the first wave to awaken and its name was whispered first into the minds of desperate cultists and later screamed from the mouths of panicked victims. Zhulodok razed the land and siphoned mana to fuel the eventual return of the three Titans. It marched across the land seeking anything to satiate its hunger. Mountains were crushed in its wake, splintered and carved out by Zhulodok and the monstrous forces at its back. It is said that a single night of feeding carved out the shape of the Windblast Gorge , once a towering range of mountains. Zhulodok's presence was said to inspire hunger and a thirst that could never be quenched, driving its enemies to consume each other ahead of the advance. This caused a famine so powerful that it even affected Ulamog's followers, though they understood this hunger as his gift, and followed it willingly. By following the path of carnage, the cultists who helped free the Eldrazi saw firsthand the power of consumption, and how to turn flesh and blood into power. Only twelve of them survived the initial wave of spawn emerging from the prison, but those twelve became the first vampire bloodchiefs, the progenitors of the vampire race. Nahiri , who had remained on Zendikar to keep watch, called for aid from Sorin and Ugin. When her beacon went unanswered, alone she identified the disturbance in the hedron network and repaired it, returning the Eldrazi to their slumber. Even after Nahiri slew Zhulodok and sealed the Eldrazi in their hedronic prison again, the vampires would whisper the name of Ulamog's prophet for millennia to come as a curse against Zendikar itself. Thousands of years since they last fed on the plane, the Eldrazi stirred once more. The meeting of Sarkhan Vol , Chandra Nalaar and Jace Beleren in the Eye of Ugin chamber loosened the bonds that kept the Eldrazi in torpor, and they rose to feed on the life of Zendikar again. Across the plane, the dormant stone hedrons came to life, changing or combining into bizarre superstructures, bending the laws of nature around them. A new generation of the brood lineages shuddered into existence around their colossal progenitors, and the carnage was immediate. Each of the three colossal Eldrazi spawned its own \"brood lineage.\" The three brood lineages were composed of Eldrazi drones and other subordinate beings, each reflecting the image of its progenitor. This time only Sorin Markov found himself on Zendikar, and in the absence of his companions, he allied with the elf planeswalker Nissa Revane to combat this great danger. Nissa's plans abruptly changed from what Sorin had expected. Instead of helping Sorin reinforce the spell containing the Eldrazi, she shattered the main Hedron and released the enchantment imprisoning the titans. Nissa thought the titans would flee, that they would leave Zendikar far behind them. She was wrong, and Sorin washed his hands of her and the entire plane, choosing to go about his own business once more since Nissa wouldn't heed his instructions. Nissa took up the fight and was joined by Chandra Nalaar and two new planeswalkers: Gideon Jura and Jace Beleren . With the help of the merfolk Jori En , they studied the leylines between the hedrons and rallied the Zendikari troops against the brood of Ulamog. The four planeswalkers realized that they were helpless against large threats on their own, but that they could stand against just about any force in the Multiverse by working together. Thus they swore an oath to stand together and the Gatewatch was created. Seeing that he could not keep his promise to Ugin to not harm the Eldrazi nor allow them to escape from Zendikar, Jace decided to slay the titans with the Gatewatch's and Kiora 's help. After consulting with Nissa, he described the Leyline pattern to her that would bind Kozilek and Ulamog to Zendikar, drawing the bulk of the titans into the plane so that their energy could be dispersed into Zendikar, killing them in the process. To attract them, the remaining forces of Zendikar's defenders would pose as bait. While the plan worked at first, with Gideon keeping the Eldrazi swarms away from the army, Kiora clearing out any other swarms, and Chandra supporting them, once the Eldrazi titans were anchored to Zendikar, their destructive essence threatened to assimilate Zendikar into themselves. Afraid, Kiora tried to persuade Nissa to release the titans and allow them to flee, but Jace objected. Chandra offered to burn the Titans instead and after preventing Kiora from attacking Nissa, Jace agreed. The pyromancer then connected with the animist, allowing her to channel her pyromantic magic through Zendikar's leylines directly into the titans. In one brilliant stroke of flame, Ulamog and Kozilek were incinerated and destroyed, leaving only ashes raining from Zendikar's sky. Even though Ugin considered the two titans destroyed, it is unknown whether the flames truly destroyed the two titans or solely their planar avatars. Meanwhile, Emrakul had left Zendikar, and was gone for months by the time the Gatewatch was formed. She was summoned to Innistrad by Nahiri to take revenge on Sorin, and her presence drove Avacyn and the angels to madness. Despite her madness, though, Avacyn's presence was the only thing preventing Emrakul from truly entering Innistrad, so when Sorin arrived to put her down, it allowed Emrakul to enter the plane. While there, Emrakul wreaked havoc on the plane, twisting and corrupting many of its inhabitants into tentacled monstrosities. In the end, however, Emrakul allowed herself to be imprisoned into Innistrad's moon for an unknown purpose. Rise of the Eldrazi featured four tribal Eldrazi cards, which were cheaper to cast with an Eye of Ugin in play or could use the second ability of an Eldrazi Temple : All is Dust Eldrazi Conscription Not of This World Skittering Invasion Test cards Like planeswalkers, colorless Eldrazi (including those with devoid ) have transparent card frames , allowing the art to run to the border. The idea of the Eldrazi as timeless alien gods worshiped by ancient cultures bears similarity to the mythos of H.P. Lovecraft, which included extraterrestrial \"gods\" that would potentially destroy the realm of humanity, and warp time and space as they enter this universe. Eldrazi was featured as rules card 2 of 5 in the Rise of the Eldrazi set. Eldrazi Displacer , a Kozilek spawn, is the only Eldrazi with white in its mana cost. The Eldrazi Nest Invader , Emrakul's Hatcher , Rapacious One , Kozilek's Predator , Dread Drone , and Broodwarden lack the keyword Devoid , making them the only colored Eldrazi brood spawned by the three Eldrazi titans. The first card referencing Eldrazi is the Eldrazi Monument ( Zendikar ) from the set released in 2009, before their appearance as a creature type in the Rise of the Eldrazi. Doug Beyer (March 17, 2010). \" Gods and Monsters \". magicthegathering.com . Wizards of the Coast. Doug Beyer (March 29, 2010). \" The Eldrazi Arisen \". magicthegathering.com . Wizards of the Coast. Doug Beyer (April 28, 2010). \" The Three Brood Lineages \". magicthegathering.com . Wizards of the Coast. Kelly Digges (Know Your Spawn!). \" Know Your Spawn! \". magicthegathering.com . Wizards of the Coast. A Planeswalker's Primer to Rise of the Eldrazi: Eldrazi Wizards of the Coast (March 1, 2010). \" And Carnage Shall Follow \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (March 2, 2010). \" Zendikar's Strife \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (March 2, 2010). \" Eaters of Worlds \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (March, 2010). \" The Planeswalkers \". magicthegathering.com . Wizards of the Coast. Brady Dommermuth , Doug Beyer , Jenna Helland , et al. (April 08, 2010). \" Enter the Eldrazi, Part 1 \". magicthegathering.com . Wizards of the Coast. Brady Dommermuth , Doug Beyer , Jenna Helland , et al. (April 15, 2010). \" Enter the Eldrazi, Part 2 \". magicthegathering.com . Wizards of the Coast. Brady Dommermuth , Doug Beyer , Jenna Helland , et al. (April 22, 2010). \" Enter the Eldrazi, Part 3 \". magicthegathering.com . Wizards of the Coast. Mike Turian (April 09, 2010). \" Commonly Large \". magicthegathering.com . Wizards of the Coast. Tom LaPille (April 30, 2010). \" The Other Eldrazi \". magicthegathering.com . Wizards of the Coast. Michael Yichao (September 29, 2015). \" Eldrazi, Humans, and Kor, Oh My! \". magicthegathering.com . Wizards of the Coast."}