{"text": "Elenda of Garrano , also known as the first vampire and Saint Elenda is the legendary ancestor of the vampires of the Legion of Dusk on Ixalan . Elenda has been described by Mavren Fein as being nine feet tall with hair like a raven's wings and nails like lightning's edge, but in truth, she was of average height, with long curling locks and a youthful face that belied the deadly nature of her kind. Still devout, she carries herself with the posture of royalty. Her voice is light and quiet. Elenda has the magical ability to travel by vanishing into a dark slice in the air. Elenda was born mortal, a warrior nun charged with her brothers and sisters of faith to guard the Immortal Sun in the mountains of Torrezon . The monastery was raided by Pedron the Wicked who killed most of its occupants. Elenda survived and ran outside to fight Pedron, but the Immortal Sun had been stolen from the fiend by a winged beast in the sky. The beast took the Immortal Sun to the west, and Elenda followed it. In the west, Elenda resorted to dark magic and took on the burden of immortality until the Immortal Sun could be retrieved once again. She searched for centuries and returned to Torrezon to teach her Rite to the nobles so that they could take up the sacrifice and join her in her search. Mavren Fein was one of her early converts. Long ago, he watched as she sailed back into the west. She had never been seen since. It turned out that Elenda had found the Immortal Sun at Orazca , but the city had been deserted and was heavily protected. Awaiting the awakening of the city, she put herself in an enchanted sleep in a tomb of the bat-god Aclazotz . This event had been preserved as the tale of \"The Bat of the East\" in the Sun Empire . When Kumena awoke the city, Elenda reappeared as well. She first met the planeswalkers Angrath and Huatli , and was appalled to hear that the Legion of Dusk had become cruel invaders in her absence. She had left the Church with the knowledge of the ritual to take on her burden, learn humility, and search for salvation for all. She decided to teach them what they had forgotten. Elenda arrived in the Sanctum of the Sun to see the Immortal Sun vanish. Mavren Fein asked her aid to retrieve it again, but Elenda refused, telling the vampire that they were finally free from their ancient duty. An angry and confused Vona asked her why she had left them and denied them immortality. Elenda answered that immortality was not the purpose of her gift, but protection. Deference to forces greater than themselves and humility would lead them to salvation, not the Immortal Sun. She told that she had found the sun and decided to become its sentinel within the Golden City while awaiting the arrival of other members of her order. She asked to be brought to Queen Miralda. Vona denied her, but Mavren Fein punished her for speaking ill of the living saint. After reprimanding Vona, the three left. After returning to Torrezon, Elenda started preaching a message of humility that some of her vampiric brethren, such as Vito , refused to heed. Elenda fought alongside Azor in defense of Ixalan during New Phyrexia's Invasion of the Multiverse . Associated cards: Quoted or referred to:"}