{"text": "Elspeth Tirel is a human planeswalker from the plane of Capenna , which used to be dominated by Phyrexians . During New Phyrexia's Invasion of the Multiverse , she ascended into an archangel planeswalker. Elspeth is a brunette female human who once was clad in a flowing white robe and white gilded armor from Alara. She stands at 5’8″ and weighs 140lbs. Elspeth is a warrior , who thinks all should be free, and at her core she will fight in spite of all her trauma. Tormented by memories of her past, a time spent in servitude to the Phyrexians , she fights against those abusing their power everywhere. She harbors an intense hatred for the Phyrexians that sometimes outweighs her own better judgment. She specializes in the powerful magic of community and fortification, spells that build mighty armies, bolsters them, and protect them from harm. She uses ritualized sword fighting forms to channel mana and cast her spells . As a child, Elspeth sported thick, black eyebrows with glossy, braided hair to match. She had round cheeks and a scar along her jaw from a fall she'd taken. On Capenna , Elspeth discovered that she inexplicably emitted a faint angel-like golden glow. She is immune to Phyresis . After her presumed death from the the activation of the Filigree Sylex, she was reborn as an archangel . She returned with gleaming new armor, a golden sword in a facsimile of her swordspear Godsend , and a pair of glowing, golden wings. The scars of her past life no longer appear on her skin. As an angel, Elspeth is able to \"hear\" prayers directed at her, has increased strength, can channel her angelic light into sword attacks, and perform healing spells. After her ascension, she is able to communicate telepathically with other angels. Elspeth is centered in white mana. A young Elspeth at the mercy of Phyrexia Elspeth and her mother were welcomed by the Capennan people. It is unclear where they traveled from, though they may have been Serran refugees following the plane 's collapse. When she was thirteen years old, she and her mother were captured by Phyrexians and held in a prison a stone's throw from her childhood village. She would pray to Serra, though the Phyrexians forbade her name from being spoken. In this prison, the Phyrexians of her homeworld tended to those of their numbers they felt insane. Elspeth and her peers were a distraction meant to soothe the insanity of the flawed Phyrexians. Kept in the cells more than a week, her mother's throat was torn out in front of her by a Phyrexian. She and \" Boy \" attempted to smuggle themselves out of the facility by hiding under a pile of corpses, unaware that the stench of decay was attractive to unwholly compleat Phyrexians.  Upon being discovered and restrained for vivisection, her Planeswalker's spark ignited and she planeswalked away, landing on Theros . She spent the next few years of her young life seeking a place that was safe, suffering unknown hardships until finally, she stumbled across Bant . In Bant, Elspeth found everything that was missing from her life: community, love, and most importantly, peace. At sixteen, she was training and eager to become a Knight of Bant. She settled in the nation of Valeron and at seventeen she began her training as a squire. In a short three years she was knighted, younger than almost anyone. Her fellow knights did not know her ability to planeswalk or of her origins, she kept the nature of her origin and abilities secret and allayed any question concerning her birthplace, only admitting to not being from Valeron. In time, she earned more sigils than any other member of her order. One day, two years after she had last used her abilities, her peaceful idyll was shattered when the broken body of a planeswalker crashed down near her outpost. With the help of Bant's balmgivers and Rhox monks, she nursed Ajani Goldmane back to health. Given his condition upon arrival, she thought she had found a kindred spirit and sought to convince him to stay upon Bant. Unfortunately, after a confrontation, she was rudely proven wrong. Ajani left with only a dire warning that their worlds were closer than she thought. After this warning, her mind was continually troubled. Concerned with some of the distressing rumors she had heard, she went out with her squire Aran to search for evidence. At a Rhox monastery, they found a Grixis incursion zone. The Conflux had begun for Elspeth. She rushed back to the castle she served and took part in a disastrous defense of her home. Aran fell to the enemy, and something in Elspeth finally broke. She cast aside all the rules of civil warfare that Bant cherished and unleashed her full powers, devastating her enemies and bringing Aran back to life. All the members of the castle looked at her with newfound respect and admiration, but what she felt in their eyes was expectation and accusation, as if she had betrayed them somehow. She stripped herself of her sigils as a result, feeling they were a weight too heavy to bear. Her rank was not so easily given up though. She still led her platoon under the Knight-General Rafiq during the battle of Jhess to drive the invading forces of Esper away, but was brought low by her allder the command of an Esper mage. As a result of her injuries, she was no longer allowed to fight on the front lines, but she refused to let Bant suffer in strife. She sought some way to help and with that mind, she interrogated Gwafa Hazid in hopes of learning who had manipulated the events behind the destruction of Giltspire Castle, which marked the start of the problems on Bant. What she learned shocked her, and she went to the assembled forces at the ruins of Giltspire Castle in hopes of defending it. Ultimately, she assisted Rafiq in killing Malfegor , effectively ending Bant's part in the Conflux war. Despite how hard she had fought, her feelings had still been inexorably changed. She was brutally reminded that Alara was not her world, and she had no right to the position they had asked of her. Worst of all, Bant had been changed forever and was no longer the plane she cherished. With a heavy heart, she planeswalked away. Elspeth seeking meaning to the warning Elspeth's self-imposed exile brought her back to familiar grounds. She had spent some time in Urborg as a youth and she chose to return there, wallowing in her grief and anger. The environment suited her mood and to make enough money to eat, and perhaps to satisfy her fury, she began fighting in gladiatorial pits, misusing her training as a knight to win. It was in one such match that Ajani once again found her. The appearance of the leonin distracted her opponent enough that he dropped his guard, allowing her to land a strike that revealed a familiar mark from her past on the warrior's body. Instantly enraged, she sought to strike down her foe, and only the timely intervention of her old friend managed to save him. After the match, Ajani informed Elspeth that he had been tracking her, hoping to convince her to return to Bant. He scolded her, telling her there was no honor in what she was doing, that ultimately she could still help Bant if she would return and that she was wasted in a wretched place like Urborg. His pleas fell on deaf ears. Elspeth was without hope and she sent him away, telling him there was no point in fighting what was inevitable. Saddened, Ajani left, bestowing one last kindness upon her. He returned the armor she had left on Bant after Malfegor's fall, the armor she thought herself unworthy to wear. Later that night, Elspeth found Koth. He demanded to know where she knew of his mark and she refused. He told her of the mark, that it was a reminder of the people of his plane, of those who had fallen to the Phyrexians, and his vow to stop them. The next morning, Koth took Elspeth to a ruined structure called The Tomb of Flesh. They spoke of their homes, of the places they cherished, and once more Elspeth lamented Bant's fate. Koth used his geomancy to create a path to the tomb and conjuring a light, Elspeth saw a haunting image from her past, and once more, terrified and chilled, she fled from the dark corners of the world. Koth found her once more at the ruins of a castle, and asked her to come with him to The Heroes' Memorial . Once there, he gifted her with gems, telling her to trap her fear in them, but she simply stated that the past is not so easily forgotten. Here in the temple, Koth communed with the stone altar and learned only one thing: They must find Venser . The artificer was not hard to find, being a long-standing target for the acolytes who tended the memorial. The pair went to see Venser and the pair were shocked to find a Phyrexian vessel being rebuilt, improved in fact, to act as a planeshifting ship. When it became obvious Venser had no idea the powers he was meddling with, Koth flew into a rage and encased his head in a stone mask, coercing him to walk to Mirrodin. Elspeth was appalled at the sudden violent act, but Koth did not care, stating simply that he had no choice. He appealed to her once more to come and help him, to atone for her mistake. He did not wait for her answer, leaving her to make the decision herself. Elspeth's Blinding Radiance Elspeth followed Koth with his erstwhile guest, finally seeing the lands the Vulshok called home. Despite his dire warnings, she saw nothing, particularly threatening and Venser continued his tirade against the geomancer. Koth broke off his argument with Venser long enough to tell the pair of the conflicts raging across the surface, and of the dark threat that threatened the plane itself. Koth sought an old friend to help him tell them of the true enemy, but what he found was the surprising spread of the Mephidross , stretching farther than he could have expected. The trio looked for Koth's acquaintance but they were ambushed by a group of nim . The companions quickly fought off the nim , but once again the dark images of Elspeth's past loomed in her mind, and with a doleful sigh, she told the arguing walkers that she cannot go any further. Separating herself from her companions, Elspeth wandered until a Vulshok shaman took her in. The two conversed, and Elspeth once again lost herself in her past. This malaise did not go unnoticed, and the Vulshok berated Elspeth for her cowardice, telling her that she should be struck down for ignoring the enemies before her. Elspeth lamented that it would take more than her death to stay the Phyrexian infection. The Vulshok told the knight that if her word is worth anything, she should be fighting instead of talking. These words took root within Elspeth, and she quickly found herself drawn to the source of the Phyrexian forces, Ish Sah . From here though, she learned her companions had not been so fortunate as she had. Tracking their location, she made her way to where they were held and cut a swath of destruction to them. With her sudden reappearance, the trio overwhelmed their captors and made good their escape. She prepared to finally put her fears to rest, not knowing the sheer number of the forces arrayed against them. Elspeth, Venser, and Koth traveled to the Vault of Whispers, where they witnessed the emergence of a Phyrexian army that was invading the surface. During their observation, Elspeth froze when being in such proximity to the Phyrexians brought back memories of her captivity, and was almost captured. After several hours, the army passed, and the three companions entered the Vault, following a Myr secretly sent by Tezzeret to guide them. It led them to Geth , and in secret, they followed him into the interior of the world. They came upon a butchering room in which they engaged massive Phyrexian butchers; Elspeth slew many, but they were outnumbered and managed to escape further into Mirrodin's underground through a meat shaft. When they emerged from the shaft they encountered Ezuri , leader of a band of Mirran rebels. While Venser insisted that they had to continue to find Karn, Ezuri said that he could allow them to go no further. He revealed that the Phyrexian invasion had profited him greatly, catapulting him into a heroic leadership position that he loathed to give up. When Elspeth threatened Ezuri, however, the elf backed down and his followers fled after a display of Venser's meager magics. The companions continued further towards Mirrodin's core, eventually being met by Tezzeret. Tezzeret led the companions to a surgery room, where Elspeth, angered by the sight of Phyrexians experimenting on creatures, flew into a rage, slaying all the Phyrexians in the room in a matter of moments. They freed Melira , a Mirran born without any metal on her body, from the cages. Tezzeret said this was his gift to them; she was completely immune to phyresis . During the subsequent travels, Elspeth grew very protective of Melira. They began traveling back towards the surface but were surrounded and attacked by a massive force of Phyrexians. During the battle, Elspeth was the center of the Phyrexians' attention, slaying most of them and creating piles of dead around her so high that the other companions lost sight of her. Koth and Elspeth The companions eventually reached the furnace layer, where the Phyrexians ignored any Mirran survivors and found Ezuri's rebel camp. There they were welcomed, despite their previous encounter, and Melira's ability to heal phyresis was discovered. She healed all those in the camp that were infected by the glistening oil , healing non-stop for several days while Elspeth sat with her in the tent, speaking to her. Once everyone in the camp was healed, a council was called in which Ezuri, hoping to become more influential, invited Melira to stay with them while subtly telling the companions to leave. Melira said she would leave with the companions, however, and Elspeth and the others prepared to leave for the core to try to find Karn. While they were leaving, the camp was attacked by Tezzeret's Phyrexians, and the companions found a guide to take them further. They escaped the battle and followed the guide, whom only Elspeth was trusting. After some time, Koth, angry at their lack of progress about the surface war, took Melira and left, leaving Venser and Elspeth alone with the guide. They hurried after Koth but were ambushed by Tezzeret's Phyrexians. Elspeth went into a battle fury, wiping out the massive force, but just as she killed the last of them, an even larger force appeared. The Phyrexians carried the Planeswalkers away, but while their captors were trying to figure out how to access a doorway, Koth and Melira reappeared and freed the pair. By the time the Phyrexians realized that their captives were gone, the companions were already running. Venser's strength, however, was wearing thin, and they were forced to stop. He was able to concoct an explosive from the metal on the walls and blow up part of the tunnel, sealing it temporarily, but it was only a matter of time before a group of Phyrexians, led by Glissa, broke through. While she was taunting them, however, Tezzeret appeared and his forces did battle with Glissa's, allowing the companions to escape and reach Karn's throne room uninterrupted. There, they found Karn corrupted by the Phyrexian oil , and Melira told the companions that his heart was corrupted. Venser told the others that he was already dying and had been for years and that he was likely unable to last much longer. With his last strength, Venser gave his life and spark to Karn, curing the golem. Cured and lucid once again, Karn spoke with Elspeth, who told him that he could not kill all the Phyrexians. Karn replied that he knew, and that is why he needed their help; He asked them to begin organizing and leading the resistance with Melira to try to cleanse Mirrodin, no matter how long it would take. Purposefully and ready for the long battle ahead, the group left the throne room and headed back towards the surface to begin their war. But the war on New Phyrexia failed miserably. Elesh Norn gained an increasing influence over the other praetor's forces and eventually seized power over Sheoldred and Urabrask 's territories. This led to the slaughter of the resistance, and in a last-ditch attempt, the remainder of their forces pooled together to strike at the hierarchy while that gesture might still have meaning. Koth led a force to plant a highly destructive spellbomb at a gathering of the praetors, but the mission went awry nearly as soon as it began. Their forces were decimated to the point that Elspeth wondered if she and Koth were the last \"natural\" beings on the plane. Surrounded by the Praetor's forces, Koth told Elspeth to leave, using his power to sink her into the ground so that she would have only one option left to her. He erected a shield to protect her from the blast, but the Phyrexian forces finally broke through and a Phyrexian Obliterator grievously injured the trapped knight before she could leave. In a half lucid state, she planeswalked away, incapacitated, and delirious from her near-fatal wounds. Heliod orders Elspeth to kill Polukranos . She awoke on Theros , the world to which she had first planeswalked fifteen years earlier. She had been drawn to the plane for the divine nature of the gods, in hopes they would provide stability. In the past, she had witnessed a battle between Heliod and Purphoros , and had found the Sword of Chaos when it was knocked to the mortal world from Purphoros's hand. It was during this brief period that she met Daxos and earned the attention of Heliod. However, overwhelmed by the presence of the god, she fled, taking the sword as she went. After Mirrodin, Elspeth landed at a temple of Pharika 's worshipers, and wrote a letter to Ajani , rolled up in a bottle and then dumped in the bogs, a custom for the prayers of Pharika's worshipers. Once her strength was regained, Elspeth journeyed out, hoping to find a place in the world where she could learn of the gods and understand their abilities. This quest drew her to Akros where she joined a mercenary band to earn a place within the city. However, her presence had not gone unnoticed, for the sword she bore had been lost for years. When she found Heliod in his temple, he tried to kill her, but he was rebuffed by her magic, stunning the supposed King of the Gods. Threatened by her power and the sword, he transformed the blade into a spear he dubbed Godsend and commanded her to make her way to his main temple in Meletis . However, the journey was not to be a peaceful one. Every god wished to possess the weapon and were all driven to frenzy, manipulated in secret by Xenagos to fear what the others might do should they claim the blade. The caravan that Elspeth traveled with was set upon again and again until at last the gods nearly destroyed much of Theros in their blind desire. Kruphix commanded them all to return to Nyx where they would be unable to harm the mortal world, but Nylea was the only one aware of the threat looming upon Meletis even as he did so. Elspeth encountered Polukranos , a massive hydra that had slain countless warriors. Elspeth engaged the hydra with the help of Daxos and succeeded where so many had failed, slaying it. This feat of heroism secured her place at the temple of Heliod in Meletis as the god's champion. Elspeth kills the god Xenagos in Nyx. Months passed as she learned what the priests of Heliod had to teach, but she found she enjoyed the time spent with Daxos the most. They grew closer, but he seemed reluctant to answer her questions as she wanted him to. He pushed her away, using Heliod's dogma to keep her from learning too much. At last, they had an argument that seemed to drive a wedge between them, but Daxos apologized and asked her to travel with him. Together, they rode to the place they had met. When they returned to Meletis, they found Anthousa waiting for Daxos, and stories of the Nyxborn attacking humanity. The only option they could find was to consult the ageless sphinx known as Medomai . He had nothing but dire predictions for the pair and a vision of Akros under siege. What the pair did not understand was that the vision was not of the future. Along with Anthousa, they rode hard to defend Akros. They found the unexpected, the minotaurs having constructed a giant wall to keep reinforcements out. As they spoke of what they could do, Queen Cymede suddenly barged in, saying that they had captured a satyr that demanded to speak to Elspeth. She was led to the dungeons where she found Xenagos chained. He told her that he knew how they could destroy the army without ever battling, and she listened to him tell his plan. They would raise the river that ran through Akros and sweep the army away, but for it to succeed Cymede and Daxos would have to raise the river while the invaders were distracted. When King Anax heard this plan, he knew the perfect distraction and challenged the horde's leader to a duel, naming Elspeth as his second. The plan worked and Akros stood. Heliod kills Elspeth. After leading the armies of Akros to victory, the king ordered a celebration that was held to honor her victory. Together, alone in their tent, Daxos and Elspeth finally realized their feelings for each other. But it was not to be. Xenagos appeared as they slept, thrilled with how well she followed his plan. He controlled her and brought back her darkest memory, trapped with the Phyrexian Obliterator looming over her, but she struck out and killed it... only realizing too late that she had just killed Daxos. Outside the tent, the revel had been suborned by Xenagos, and as she fled, she saw Xenagos ascend into Nyx. She was met with scorn by the citizens of the polis and fled for her life into the wilderness. Her world was thrown into chaos as even the god she had sought to understand turned against her. Heliod was wroth, believing she was implicit in Xenagos's plan, and sought to destroy her. Cast out, she found an unexpected ally in the Leonin. With the help of Brimaz , she reunited with her old friend Ajani. He was curious about what had befallen her, but she refused to speak of how badly she'd been hurt. Instead, she swore they would set things right, and Ajani agreed to stay at her side. To do so, they would have to travel to the mysterious temple of Kruphix at the edge of the world. They traveled by river from the Nessian forest to the Siren's Shipyard, seeking the legendary mariner Callaphe . Standing amidst the shattered wreckage of ships, Ajani called up the legendary sunken ship known as the Monsoon , and to their surprise, Callaphe appeared as soon as her ship had risen from the deep. She agreed to take them to the edge of the world, but that turned out to be a lie. Upon reaching the sunken city of Arixmethes , Callaphe relevealed that her identity was a falsehood, and that she was in truth the merfolk planeswalker Kiora . Thassa confronted them, intending to deal with the lying merfolk, but not before sending the pair on their way, wishing them luck. They arrived at the edge of the world, and the god Kruphix allowed them to pass to the gateway of Nyx, the shrine of Nykthos. To gain entry to Nyx, Elspeth had to undergo an ordeal sent from the gods, and Ajani urged Elspeth to take Thassa's ordeal, but she pulled away from him at the last moment and gained entry from Erebos . She was suddenly elsewhere, back on Bant as she watched a husband she had never had depart their small cottage. She had lived with him for years, and she could not bear it as she realized it was false. It was only the start though, as she looked upon her son and daughter. The little girl, named Mina, urged her to drink from a golden goblet, strangely out of place, and she realized what it would mean to drink from that cup. Though it broke her heart, she smashed the cup and passed Erebos's ordeal. Haunted by the memories of the life she had never lived, the pair set to the task at hand. They confronted Xenagos and battled the god until at last Elspeth struck him down. As Xenagos's body fell back to Theros, Elspeth offered her life in trade for Daxos, a deal the god took gladly. Ajani insisted they could escape, the battle had taken its toll, and Nylea warned the pair that they must flee before Erebos or Heliod found them. They managed to reach Nykthos again before Heliod appeared and using her weapon fatally wounded Elspeth. Elspeth in the Underworld. Ajani took his dying friend back to Theros and prepared to fight the agents of Erebos that were coming to claim his friend, but Brimaz's warriors ambushed him, pulling him away for his good as his friend died. As her life ebbed, Elspeth prayed to the god that had killed her, asking for peace at last. However, on Theros, death is rarely the end of a traveler's journey. In the Underworld of Theros, most ordinary humans would be doomed to dwell in the eternal gray realm or to surrender their identities and become the Returned . But Elspeth is no ordinary human. She noticed a young girl who is about to touch the veil, but then she is shocked that the girl's face is a husk and the Returned dragged her underwater she drowns until her spark is reignited in a blinding light. Despite her tragic end, she still holds her reasons for upholding her honor close to her heart: her deep love for Theros, her companions, and the innocents that she has sworn to protect. Ashiok explores Elspeth's remorse and nightmare s in the Underworld . Something had been disturbing Elspeth's rest in Ilysia . The planeswalker Ashiok had been spreading their unique brand of nightmares throughout Theros, and not even the Underworld was safe from such dark power. Each night in her dreams, Elspeth relived her traumatic past, and her twisted memories were all too delicious for Ashiok to ignore. During such a nightmare, Elspeth would pull Heliod's spear, Khrusor, from her nightmare which in real life would become Shadowspear . Elspeth would eventually try to escape from the Underworld, gathering allies and followers on her path for vengeance against Heliod. Her escape attempt brought on the wrath of Klothys , the God of Destiny. Klothys sent the Nyxborn Calix to bring Elspeth back, however she would always defeat him. Calix however would learn more and more about Elspeth with every fight, improving at every step. Elspeth claimed that Shadowspear was the true Khrusor and that Heliod's spear was a fake. Due to the nature of belief in Theros, when mortals started to acknowledge Shadowspear as the true Khrusor, Heliod's spear weakened to the point of shattering when clashing against Elspeth's weapon. The God of the Sun was forced to yield and Erebos imprisoned him in the Underworld forever. By defeating his most hated enemy, Elspeth won the God of the Dead's eternal gratitude and the permission to return to the world of the living. After meeting with Daxos one last time, Elspeth planeswalked away, with Calix, whose spark ignited in the meantime, following her. At Ajani 's request, she goes to New Capenna to investigate ways to defeat the Phyrexians . Elspeth wants peace. For most of her life, she has been haunted by memories of being imprisoned by Phyrexians during her childhood. Though she escaped when her Planeswalker spark ignited, she never forgot her captors; the memory of them keeps her awake at night. Though Elspeth is constantly searching for a home where she can rest and finally stop running from her past, deep down she knows that she'll never find peace until she confronts her demons and ensures they can never trouble the Multiverse again. At some point, Elspeth found Ajani on Dominaria. The leonin told Elspeth the name of her home plane, which contains the metropolis of New Capenna , and had been invaded by Phyrexians but somehow managed to defeat them. Elspeth decided to go to New Capenna, hoping to discover the way the denizens of the plane defeated the Phyrexian invaders. Arriving in the city, she felt out of place as the plane was nowhere near as she imagined it. Elspeth began working odd jobs in the city before intervening between a group of Maestros enforcers and their victim, a shop owner. Dispatching the thugs, Elspeth was approached by Anhelo, the Maestros' vampire lieutenant, who invited her to join the family. Hoping to learn more of the Phyrexian invaders from the Maestros' art collection, Elspeth accepted his offer. Elspeth started working for the Maestros while investigating their museum. She then met Xander , the leader of the family who gave Elspeth her first taste of Halo and a mission to deliver something to Park Heights. There, she would meet Vivien Reid . After the mission, Xander tasked Elspeth to infiltrate the Cabaretti in order to find out if they truly can produce unlimited Halo. Elspeth would then get in contact with Jinnie, Jetmir 's right hand. Successfully making her way into the family, Elspeth was staffing the Crescendo when the Adversary 's agents attacked the event. She was able to escape with Giada thanks to Vivien Reid 's help. The three made their way to a cathedral, where Nixilis attacked and nearly defeated Elspeth before Giada sacrificed herself to reinvigorate and rearm her. Now wielding Luxior, a narrow sword infused with Halo , she was able to strike a deadly blow against Nixilis, and he was forced to planeswalk away to safety. After the turmoil, Elspeth gained entry to Xander 's Archives, where she learned of the plane's history and its battle with the Phyrexian threat. She and Vivien planeswalked to Dominaria to inform the Gatewatch of their findings. Elspeth was recruited by the Gatewatch to join the fight against the Phyrexians. When she arrived on Dominaria, she learned about Ajani's Compleation and took the news hard. Elspeth used the grand hall of Urza's Tower as a training ground, eventually accepting command of Saheeli 's mechanical soldiers at Teferi 's request. When the Phyrexians attacked the Tower, Elspeth led the counter-attack to provide Saheeli , Kaya and Teferi with enough time to finish their mission with the Temporal Anchor . Jodah provided her with a powerful spell created by Jaya Ballard that helped her to obliterate the first wave of Phyrexians. The use of the spell provided clarity of mind and the resolve to bring Ajani back to his original self. She wounded Rona and was confronted by Tezzeret , who unexpectedly spared her life. Regrouping with the Gatewatch and additional assembled planeswalkers, she offered to guide them to New Phyrexia. Arriving on New Phyrexia, she found that the group was partly incapacitated and scrambled by some sort of defense barrier put up by Elesh Norn. With Kaya and Himoto , she travelled to the Furnace Layer , where she was reunited with Koth , Tyvar , Jace , Kaito and Nahiri . After Jace activates the Sylex , Elspeth planeswalks with the artifact to some place \"beyond the blind eternities\". The team of planeswalkers descended with Melira to the Dross Pits , where Elspeth provided them with Halo to counteract the effects of the Necrogen . However, Jace inexplicably reacted adversely to the potent elixir and collapsed. After recovering, Jace's mind was focused on Vraska, whom he perceived to be in need of help. Abandoning the group, he set out to find her. Because he carried the Sylex , the complete group set out after him. Finding Vraska in Sheoldred's Coliseum , they found she was heavily wounded and already infected with Phyresis . Too late to save her, Jace chose to stay behind with her and relive their happy moments on Ravnica in his mind. Lingering too long, Vraska succumbed to the Phyrexian influence and infected Jace in turn. The others tried to escape but were quickly overwhelmed by the black Phyrexians. Nahiri, who was also infected, decided to sacrifice herself for the greater good. With a mighty magical blast, she exploded the Coliseum and dropped it with all remaining planeswalkers on the Fair Basilica . Nearer to their goal, the infected Jace rejoined them and volunteered to carry the Sylex to the Seedcore . Through the Basilica and the Seedcore, the team encountered the disassembled Karn, who lamented the desperate state of the plan and the sacrifices both made and looming. The last significant resistance in the Seedcore was the pair of Tibalt and Ajani, to which Tyvar and Elspeth engaged respectively. Tibalt's traumatic magic looked to have hobbled Elspeth, but her deep instincts kept her on guard, and once Tyvar disabled Tibalt she knocked Ajani unconscious and ran further into the Seedcore. Instinctively, she realized both how deep the Realmbreaker reached and the state of the Sylex, so she stabbed Jace and took hold of the Sylex. Both Elspeth and Sylex disappeared without a trace. A newly ascended Elspeth wounding Elesh Norn In the Blind Eternities , Elspeth found consciousness. She saw a vision of her mother, who showed her that New Phyrexia was ravaging the Multiverse . She saw Capenna, where Atraxa was destroying the statues of angels. Next, guided by a vision of Daxos, she saw Theros, where Ajani was corrupting the faith. Finally, she was guided by a disembodied voice to New Phyrexia, where Chandra , Wrenn and Koth were about to be compleated by Jin-Gitaxias . The voice revealed itself to belong to Serra and bestowed the power of an archangel onto Elspeth, then faded away, leaving her to intervene. Elspeth emerged from the Blind Eternities and blocked Jin-Gitaxias from advancing. The captured planeswalkers used this advantage to press back toward Realmbreaker and advance Wrenn's plan. Elspeth noticed that Elesh Norn was focusing exclusively on her, and called her out for having individual desires, a violation of her own dogma. Elspeth acknowledged that Phyrexia's ideals of unity had merit, but declared that its crusade of conquest was only conducted for Norn's selfish wishes, not for Phyrexia's. Norn's increasing rage only confirmed Elspeth's words. After fighting the Grand Praetor to a stalemate, she then flew away to cover the planeswalkers' attack on Realmbreaker, as Norn impotently screamed after her to finish their duel. Upon arriving at the planeswalkers' position, Elspeth freed Chandra from Nissa's grasp, allowing the pyromancer to help Wrenn properly bond with the Invasion Tree. Elspeth took a supportive role for the rest of the final battle against New Phyrexia. Though she was nearly overwhelmed defending the Mirran barricade, the Zhalfirin army summoned by Wrenn helped ease her burden. When the Mirrans and Zhalfirins evacuated from New Phyrexia through Wrenn's fading portal to Zhalfir, Elspeth knocked out Nissa with the hilt of her sword, allowing Chandra to carry her to safety. Elspeth remained on Zhalfir long enough to see the surviving Mirrans settle into their new plane. Though Koth was somewhat put off by her seemingly inhuman demeanor, he was still comforted by her assurance that Melira , who was mortally wounded and planning to heal Ajani and Nissa as her last act, would die valorously on her own terms. She embraced her friend, assuring him that if he ever needed her help, all he had to do was pray. Elspeth then brought Koth to Melira's medical tent so that he could see her off in her last moments, before flying away, illuminated by the five suns of Mirrodin now orbiting Zhalfir. Due to Elspeth saving Theros during the Invasion, cults worshipping her appeared on the plane. Godsend — a holy swordspear crafted by Purphoros A mask of the Returned — A deathmask forged for her in the Underworld , using the two jewels of Godsend. Shadowspear — Heliod's spear, Khrusor, was pulled from a nightmare and turned into a real-life weapon. Luxior — A Halo -infused sword. A narrow weapon with an orb of Halo instead of a steel guard. Halo runs up tracks in the fuller, infusing the blade with a faint light. Abandoned in Jace's corpse and retrieved by Kaito Shizuki . The Filigree Sylex , taken from Jace Beleren after he activated the artifact , she planeswalked the Sylex into the Blind Eternities . Elspeth is the primary protagonist of the Theros Beyond Death and March of the Machine trailers. She also appears in the Phyrexia: All Will Be One trailer. Elspeth had been theorized to be an angel of New Capenna . This was later confirmed in March of the Machine with the printing of Archangel Elspeth . Elspeth becoming an angel had been planned for well over a decade. In the video game Magic: The Gathering Arena , Elspeth is voiced by Erin Yvette . Associated cards: Depicted in: Quoted or referred to: The Magic Creative Team (January 8, 2014). \" Planeswalker's Guide to Born of the Gods \". magicthegathering.com . Wizards of the Coast. Inside R&D: Journey into Nyx, Part 1 (Video). YouTube. Magic Creative Team (May 26, 2014). \" Journey's End \". magicthegathering.com . Wizards of the Coast. Mike McArtor (May 30, 2014). \" From Alara to Theros \". magicthegathering.com . Wizards of the Coast."}