{"text": "Erebos ( EH-reh-bohs ) is the God of the Dead on Theros . He was compleated during New Phyrexia's Invasion of the Multiverse . According to myth, when the sun first shone on Heliod , the first shadow was cast. When Heliod saw it, he feared and banished it beyond the Rivers That Ring the World, the five rivers that form a boundary between Theros and its Underworld . That shadow was Erebos, the god of death. In time, Erebos accepted his role, knowing that although Heliod had banished him, he would always stand behind the sun god. This, however, is only Erebos' mythical origin, held by the mortals of Theros. As explained by Kruphix , gods are born from mortal beliefs, not the other way around. More precisely, Kruphix, as the god of wonder and the unknown, was the firstborn. Death came next, ultimate and inescapable. Then followed the gods of sun and sea, forest and forge. As such, Erebos was born before Heliod and is the oldest of the five major gods of Theros. Erebos rules over death and the Underworld. Because of his origins, he is also the god of misfortune, ill fate, begrudging acceptance, envy, and bitterness. Because the dead leave their earthly wealth behind, Erebos has become associated with that wealth, as well as with the abundance of (to him, pretty but valueless) gold in his realm. It may seem that Erebos is connected to Nyx more closely than the other gods, thanks to black 's association with darkness, but this isn't the case: Erebos's realm lacks both the sun and the night. Erebos is a jealous and tyrannical ruler, proud of his domain as lord of all that ever lived. He is an effective warden and lord of the Underworld realm. However, he is not without compassion, but his compassion is limited to feeling on behalf of others what he feels, and his acceptance of his fate means that his lieges, the dead, must accept theirs. He envies the sunlit world of the living, but only in a daydream-like way. Erebos knows that all that lives will eventually join him, which affords him a kind of satisfaction and certainty. When others suffer, it brings Erebos peace, but not glee, because the alienation and banishment of others enable them to identify with his own. He doesn't take pleasure in the suffering of others, but he sees it as a necessity in the order of Theros. Erebos creates monsters to guard his realm. The god of the underworld is worshipped by those who exalt death, those who desire wealth, and those who pray for acceptance of their fates. The first group is the smallest but the most dangerous because they seek to bring about a confrontation between Heliod and his shadow. The second group is the largest. The final group is Erebos' favorite — those who have been cast out and who seek peace with their fate. Erebos' Whip, Mastix. Erebos wields Mastix , a golden-handled whip with an impossibly long lash. The whip is a means of inflicting pain when he must, but its more frequent function is as a snare to pull the reluctant dead into his realm. After the demise of Xenagos , Heliod instructed his champion, Daxos , to remove all traces of the other gods from the great city of Meletis . The other gods, refusing to stand for such an affront, called upon their champions from the Underworld; with this, the gods were at war. And when gods clash, mortals suffer the consequences. One such consequence took the form of rifts to the Underworld from which countless monsters poured forth. Erebos was consumed by this conflict. He hated Heliod most of all, and in his rage, he neglected to keep a tight grip on the souls under his purview. When the planeswalker Elspeth Tirel managed to defeat Heliod, Erebos took the defeated sun god and placed him beneath a giant boulder in the Underworld, where he would suffer for all eternity, or until he was forgotten by his worshippers above. As for Elspeth, Erebos gifted her his eternal gratitude — and safe passage back to the mortal realm. During New Phyrexia's Invasion of the Multiverse , Erebos was compleated. The character of Erebos is inspired by Hades , the Greek god of the underworld, dead, and riches; and Erebus , Greek primordial deity of darkness (even in their name). Erebos's whip is inspired by the snake tail that King Minos has in Dante Alighieri's Divine Comedy . Erebos narrates the trailer for Journey into Nyx . Associated cards: Depicted in: Quoted or referred to: The Magic Creative Team (August 21, 2013). \" Planeswalker's Guide To Theros, Part 1 \". magicthegathering.com . Wizards of the Coast. Theros: Godsend, Part I Journey into Nyx: Godsend, Part II"}