{"text": "Eron the Relentless is the immortal Goblin King of the Koskun Mountains of Ulgrotha . Eron was originally a street urchin and petty thief in Aysen . This changed when he visited the Floating Island and met the Wizard Savant Bernatheen. The Savant promised to cast a spell on Eron if he would retrieve a book of dark magic from Grandmother Sengir 's library, in Castle Sengir . Eron agreed. The theft went incredibly well. After hours of searching in the library, Eron found Grandmother Sengir asleep near a tome and stole it. When he successfully presented the book to the Savant, Eron took a gamble and asked that the last spell in the book was cast as his reward. After the spell was cast, Eron found out that he was immortal and immune to aging. Even though he would regenerate every damage, however, scars and minor aches would never completely heal. Bernatheen was later found out by Baron Sengir and twisted into a greater werewolf as punishment. Now immortal, Eron would face whole packs of guards armed with only a knife. On one occasion, he even cut himself into pieces to escape from prison. After a few months, however, Eron grew bored and traveled the Homelands for a year, searching for adventure. He traveled to Koskun Keep , where he declared himself King of the Goblins. He was immediately killed, only to get up again. After trying to kill him again, the goblins eventually accepted him as king, to get rid of the current ruling family. Even if Eron is appraised as a demigod by the goblins, he has been assassinated twenty-seven times. Each time he is murdered, he grows more determined and his ideals about justice seem to degenerate even further. In particular, retribution is one of Lord Eron's favorite punishments. When one of his lieutenants gets out of hand, he has them brought forth before a court of their peers. There, he will accuse them of the crimes, present sufficient evidence, then condemn them to death. But just at the last moment, Eron will bring forth a partner or loved one of the criminals, and offer the doomed lieutenant a deal - if they let the loved one die in his place, the lieutenant will be let off with only disfigurement and torture. It is known that Eron will sometimes change the nature of the deal and that if the lieutenant chooses the loved one to die instead of themself, Eron will have them killed anyway, after making the doomed one watch Eron's henchmen torture and disfigure the partner. While Eron can be a maniacal ruler, his primary concern is with the future of all the people of the Homelands and his place among them as the Goblin King. Baron Sengir has tried many times to meet Eron, a fellow immortal, but the latter has always refused. Eron, however, fears that the Baron is just biding his time, awaiting the right moment to strike. Eron tries to get food and supplies to the villages of the Dark Barony , but he isn't sure whether what he sends reaches them. Eron formed a treaty with Aysen, in which he agreed to keep his subordinates from invading in exchange for trade of food and goods. Eron does know that if the food supplies should stop, his subordinates would throw him into a mineshaft and declare war on the rest of the Homelands. This, however, would be hampered by the mysterious force that has recently taken control of the Great Wood and destroys every war party sent while leaving trade caravans unmolested. Even if Koskun Keep is a refuge for the criminals of the Homelands and Eron himself turn a blind eye to most of what happens in his realm, he has taken a special dislike to the thieves Chandler and Joven , which deprived him of his Ebony Rhino . If he ever catches them in Strongrock , he has sworn to make them pay for a very long time. Eron is also interested in conquering the Anaba minotaurs, that he uses as bodyguards, to bolster his forces. In order to do so, he sends goblins scouts into every corner of the mountains, hoping to find the Anaba hidden homeland and bring it in his sphere of corrupting influence. Quoted or referred to:"}