{"text": "Eruth of Lambholt is a young woman from Innistrad who gained notoriety for her clairvoyant dreams. She is now a gibbering lunatic living in the Natternols . Eruth grew up in Lambholt frail and restless, never comfortable, always on edge. Her nightmares began in her youth, slowly becoming more frequent until they wore away at her sanity.\nEvery night, she dreamed that she was a different person, usually someone unknown to her. Every dream ended with that person about to die violently, but she always awoke before the moment of death. And every dream corresponded with an actual death. Some dreams took place before the death, but others were after or even at the exact moment of death. With the arrival of Emrakul , Eruth seemed to have crossed over into utter madness. Her abilities garnered the attention of the Inquisitors, who came to Lambholt seeking information, but because they were unable to change her prophecies they instead declared her a heretic and planned to execute her with an execution-blade. Evading the cathars, she fled Lambholt to the Natterknolls, where she met the entity the \"Dark Lady,\" who helped her evade future captors. Her waking hours were a constant stream of incoherent babble, fueled by the horrors of her nightmares. Once in a while, in the midst of the nonsense, she pronounced chilling words that foretold a great coming doom and then, as if unaware of the message she delivered, she continued her senseless raving. After arriving in Traublassen , Eruth was imprisoned in the local keep, publicly for her health and protection, but privately because the townsfolk feared her prophecies and the town's lord hoped to offer her as human sacrifice for the entity Umbris . Umbris however refused the sacrifice, as he was unwilling to confront the \"Dark Lady\". Eruth was freed by the former cathar Torens . She encouraged him to break the magical circle imprisoning Umbris with his holy mace. The entity accepted a temporary truce and freed the villagers from their evil overlord. Torens decided to return to unfinished business back in Gavony. Eruth stayed behind in Traublassen to give guidance to the newly-freed villagers. Depicted in: Quoted or referred to:"}