{"text": "Etherium is a magical aether -infused alloy found on Esper . Another name for the same substance is filigree . According to the myth, etherium was created by the sphinx Crucius , and since then almost all of Esper's inhabitants have etherium fused with their anatomy. The body's functions are kept up through a series of complex enchantments. The stocks of etherium are measured in rods . Ultimately the Ethersworn are planning to fuse every living being with this metal. The greatest masters of the craft abandon tools all-together, shaping the metal with hand and mind alone. The inhabitants of Esper believed that all life and every physical form was incomplete without some connection to the Aether via filigree or etherium fusing. As they could not create new etherium themselves, their supplies of it were very limited, so mages began to use more subtle fusions with lower-class life forms. It is unknown how Crucius made the alloy; even Sharuum could only show how to thin existing etherium. The Seekers of Carmot believed that the substance was made from the materials known as sangrite and carmot . They possessed the Codex Etherium , which supposedly reveals the location of both; however, it was revealed by Tezzeret that the Codex was a fraud. The reason why the Esperites could not craft new etherium was because both sangrite and carmot are found on Jund , which was inaccessible to the planebound inhabitants of Esper. Carmot is a type of red stone. As Crucius was himself a planeswalker , he could obtain sangrite and carmot from Jund. Sangrite forms as reddish cylindrical spikes in volcanoes or deep caverns. No one knows how sangrite is created, but some believe that when a creature dies on Jund, its life-force disperses into the air and settles in crystals that already exist in volcanoes and caves. Others point to the thick concentrations in dragons' lairs as evidence that sangrite is a crystallized form of dragon's breath that contains the life-force of its prey. Sangrite was revealed to be the petrified blood of a dragon who dies in battle Infused with life essence, crushed sangrite is an incredibly potent form of energy. Dragons sometimes consume entire crystals, which grant them intense, but short-lived, strength and power. Tezzeret and Nicol Bolas fought over mining rights on an unnamed plane, where Tezzeret claimed the ores needed to create etherium came from. It is unclear if this was on Esper, Jund, or some other plane. After the Conflux , the Seekers sent emissaries into the other shards , seeking carmot at any cost. In the dubiously canonical Test of Metal , it was revealed by Tezzeret that he was the Carmot, but it is unknown whether he meant only himself, all Esperites, or humans in general. Later, the human Breya was the first to create etherium from carmot harvested from Jund. To commemorate this, she replaced most of her body with self-crafted etherium. Notable items made of etherium are the \" Filigree Texts \" and Tezzeret's Infinity Globes ."}