{"text": "The Eye of Ugin is a secret underground cavern on the Akoum continent of Zendikar . Here, the spell that kept the Eldrazi imprisoned was focused on the key hedron that connected all the leylines of the hedron network. Shortly after his ascension in the long distant past, Sorin Markov 's attentions were drawn to the Eldrazi, monstrosities from the Blind Eternities that consumed one plane after another. Sorin decided to ally with two other planeswalkers and defeat these abominations. Nahiri , a Kor lithomancer and native of Zendikar, would force the Eldrazi to take physical form; Sorin would use his life leeching magic; and Ugin , an ageless Spirit Dragon originally an Elder Dragon would defeat them with his own brand of colorless magics. But the plan went awry; the Eldrazi were forced into physical form, but the Three weren't powerful enough to defeat them. The three were forced to compromise. Instead of killing the Eldrazi, they imprisoned them on Zendikar. Sorin lured the Eldrazi to the plane, directing their hunger to that unique mana, Ugin used his invisible breath to combat the Eldrazi and his colorless magic to bind them to the plane, and Nahiri constructed a massive network of stone hedrons , whose power would form the bars of a planewide prison, forever preventing the Eldrazi from leaving. Ugin arranged the hedrons to direct leylines of energy, which were not to be disrupted . The planeswalkers concentrated the power of their imprisonment spell in a secret location deep inside Zendikar's mountains of Akoum : a subterranean chamber which came to be called the Eye of Ugin. To make sure that the imprisonment would not be broken, the three planeswalkers sealed the chamber with a mystical lock: the Eye of Ugin could only be reactivated by the presence of three planeswalker's sparks — and the colorless, invisible breath of Ugin, the spirit dragon himself. Their mission complete, the planeswalkers disbanded. Sorin and Ugin left the plane. The centuries passed and Nahiri's teachings about the Eldrazi became garbled; Talib , Kamsa and Mangeni became the revered gods of the Kor. When vampires (which hadn't been seen on the plane in the earlier days) built a shrine near the Eye, the prison of the Eldrazi became unstable, and the brood lineages spilled over the plane again. Nahiri awoke from her slumber in the chamber and called for help to Sorin and Ugin but they didn't respond. She succeeded on her own, and restored the prison. Confused why Sorin hadn't shown up when she called for him, she decided to find him and planeswalked away from Zendikar. Much later, Nicol Bolas became aware of the Eye and sent Sarkhan Vol to guard it. Chandra Nalaar discovered this place by following a map she first found on Kephalai , with Jace Beleren chasing after her. The vampire Anowon served as a guide for both Jace and Chandra as he led them to the Eye of Ugin. When Chandra and Jace confronted Sarkhan at the Eye, they found out that colored magic was absorbed immediately, taking no effect. Moreover, the place was keyed to a specific event, the presence of three Planeswalkers, and the Breath of Ugin . During their fight, Chandra used an invisible flame spell against Sarkhan, thus unknowingly loosening the bonds of the Eldrazi. When Eldrazi brood began attacking elven villages, the local planeswalker Nissa Revane began investigating the source of the attacks. She would have fallen to the brood herself, if not for the timely return of Sorin Markov. He liberated the slave Anowon and demanded that the two take him to the Eye of Ugin. Once the group arrived at the Eye of Ugin, Nissa's plans abruptly changed from what Sorin had expected. Instead of helping Sorin reinforce the spell containing the Eldrazi, she shattered the main Hedron and released the enchantment imprisoning the titans. Nissa thought the titans would flee, that they would leave Zendikar far behind them. She was wrong, and Sorin washed his hands of her and the entire plane. Two other planeswalkers arrived to fight the Eldrazi: Gideon Jura and Jace Beleren again. Jori En - Gideon's merfolk friend - had found clues that Zendikar's leylines and hedrons were crucial in order to find a way to stop the Eldrazi again. Jace and Jori En figured out that they had to travel to the Eye of Ugin because that was where all the leylines connected. There he found Ugin himself rebuilding the chamber and the hedron network. The Spirit Dragon revealed how the network might be used to again immobilize the Eldrazi titans, but Jace realized that the same trick might instead serve as a first step in killing them. Ignoring Ugin's dire warnings, Jace left the Eye and made his way back to Sea Gate to pass this information on to Gideon."}