{"text": "The Fallaji Empire was a great alliance of several different tribes of desert nomads on the continent of Terisiare of Dominaria . The Fallaji were a deeply religious people, distrusting of artifice and magic until the war against the other nations of Terisiare called for the technical prowess of Mishra and the allied Brotherhood of Gix . The Empire's natural territory stretched from across The Great Desert in the center of Terisiare but also had a significant portion of conquered lands at one point or another in the war. They also roamed across the Kher Ridges into the Western Desert . Their history was recorded on knotted cords. Suwwardi, a militant tribe of the Fallaji. Mishra was captured by and later united the empire under this tribe. Tomakul, the ruling tribe before the Suwwardi, centered on the eponymous city. Farid was a member. Tomakul was one of the main cities of The Fallaji Empire. Considered by outsiders to be the most civilized Fallaji settlement, it also served as the de facto capital of the empire. Tomakul was recognized by foreigners for its golden onion-domed palaces. Much trade ran to and from the city, and merchants were abundant in the commons. The tribe of Fallaji that founded it, also known as the Tomakul, held much sway over the other tribes via their accumulated prestige. Zegon , a coastal city on the southern coast. During Urza's time, it was ruled by a council. Fifty years before his birth, it had been ruled by the last warrior-queen Nedastophalites. This was the Golden Age of the Zegoni people because she won them freedom from the ruling Fallaji tribe of that time, the Tomakul. The ancestors of the Fallaji emigrated to Dominaria via planar portals from Rabiah . During the Brothers' War the tribes were united at last under the Suwwardi tribe, but would later be ruled by Mishra. The Fallaji formed the main body of his army. Nearly all the Fallaji were killed in the Last Battle, and a few hundred years later the only surviving Fallaji were known as desert nomads and wanderers with no association with the once-mighty empire. Tomakul and Zegon were ruined. A tiny remnant of the Fallaji can be found on Almaaz , while some others integrated into Argivian society. An item called nabiz was a well-received ration given to Fallaji soldiers. Fallaji coins were made of gold and stamped with an image of the qadir's face. Associated cards: Referred to:"}