{"text": "Femeref is a strong religious state in Jamuraa on Dominaria . Archers of Femeref. Art by Zoltan Boros and Gabor Szikszai. Centuries ago, when the land was ruled entirely by Zhalfir , an internal religious dispute led the church to secede. They had objections to the Shadow Creed's treatment of the dead. The church created its own province called Femeref after the Zhalfirin word fethe , meaning \"judgment.\" The fledgling nation was ruled by a grand assembly known as the Council of Voices . In time, Femeref grew apart from Zhalfir, aided by the discovery of rich gold deposits. Eventually, tales of the mineral wealth within Femeref's deep mountains spread to the Suq'Ata Empire. The empire annexed the lands bordering Zhalfir and began to mine the mountains, pushing the dwarven residents into Femeref. The leaders of Femeref happily accepted the new refugees, as their skills would increase Femeref's gold yield substantially. The Zhalfirin Void The land of Zhalfir was phased out by Teferi Planeswalker during the Phyrexian Invasion. Four hundred years after, when the temporal crisis threatened to destroy the Multiverse, the Zhalfirin time rift was sealed by Jeska without Teferi's guidance and the necessary synchronization with Zhalfir's return, causing the land to be (probably) forever doomed to non-existence out of time and space. The Femeref nation is thus the only heir and bearer of the legacy of the five-millennium old civilization and nation. As of 4562, Femeref was ruled by a magistrate, Sidar Teshunda, who was advised by the ten-member Council of Voices in the Great Chamber. Council members include Councilor Gbega, Councilor Jabras, and Historian Awateh. When Femeref was threatened by a Phyrexian Colossus, it fell into infighting and paranoia. It was only Esteemed Speaker Niambi who was able to convince Teshunda to grant the Efravans refuge. Terorq , a mining-city ( Teruworq = good gold ). Safe haven for the Ekundu dwarves. Nyomba , hometown of the sorcerer Waffa ( Nyumba = home , Ethereal Champion ). Tulumai , the capital of Femeref ( Tumai = hope ). Located at a deep inland bay that leads south to the Jaema Sea . Sewa , a coastal town near the Zhalfirin Void. Quoted or referred to:"}