{"text": "Flavor text Real-world quotations Flavor text is the italicized text (but not in parentheses) on a Magic card that serves to provide a mood or give background information on the game world, but has no effect on gameplay. Each set has a person assigned to it who is responsible for overseeing names and flavor text. In the past, this was a single person who oversaw all the names and flavor text of all the sets, but a number of years ago, R&D began switching to different people from set to set. That person, known as the creative lead , works with a collection of writers (both internal and external to Wizards of the Coast ) who make up the Creative Writing team for the set. Each card is put into a special online database with the information of what is needed from the writers. Each member of the Creative Writing team for the set writes several suggestions for every name and flavor text. The creative lead will then go through all the suggestions picking what they think are the choices that work best. They then work with the editing lead of the set to make sure the names and flavor text they've selected will work. (Certain choices, for instance, might not physically fit on the card or might conflict with choices made in a nearby set.) The Set Design lead (along with other members of R&D) will also give notes on the chosen names that the creative lead can respond to. Freelance writers are paid if their submissions are accepted by the creative team. Real-world quotations (mostly literature, the bible and so on) were a thing in early sets, but nowadays they are mostly avoided. A few versions of iconic cards (e.g. Wrath of God , Lightning Bolt , Disenchant ) may have no flavor text, even though there is room for it, as flavor text could be seen as detracting from the overall aesthetic of these staples. Any italicized text in parentheses is not flavor text, but reminder text . From the Comprehensive Rules (September 1, 2023— Wilds of Eldraine ) 207.2. The text box may also contain italicized text that has no game function. 207.2a Reminder text is italicized text within parentheses that summarizes a rule that applies to that card. It usually appears on the same line as the ability it’s relevant to, but it may appear on its own line if it applies to an aspect of the card other than an ability. 207.2b Flavor text is italicized text that, like the illustration, adds artistic appeal to the game. It usually appears below the rules text. 207.2c An ability word appears in italics at the beginning of some abilities. Ability words are similar to keywords in that they tie together cards that have similar functionality, but they have no special rules meaning and no individual entries in the Comprehensive Rules. The ability words are adamant, addendum, alliance, battalion, bloodrush, celebration, channel, chroma, cohort, constellation, converge, council’s dilemma, coven, delirium, domain, eminence, enrage, fateful hour, ferocious, formidable, grandeur, hellbent, heroic, imprint, inspired, join forces, kinship, landfall, lieutenant, magecraft, metalcraft, morbid, pack tactics, parley, radiance, raid, rally, revolt, secret council, spell mastery, strive, sweep, tempting offer, threshold, undergrowth, and will of the council. 207.2d Similar to ability words, flavor words appear in italics at the beginning of some abilities. Flavor words provide a flavorful description of abilities, but they have no special rules meaning and are not listed in the Comprehensive Rules. While an ability word ties together several abilities with similar functionality, each flavor word is tailored to the specific ability it appears with. From the glossary of the Comprehensive Rules (September 1, 2023— Wilds of Eldraine ) Starting with Mirage expansion that flavor text team always included a four-letter piece of flavor text. Mirage had \"Heel\" on Ray of Command , Visions had \"BOOM!\" on Magma Mine and \"Next!\" on Goblin Recruiter , Weatherlight had \"Ewww!\" on Mwonvuli Ooze , Tempest had \"Here\" on Jinxed Idol , Stronghold had \"Mine\" on Cannibalize , and Exodus had \"Stay\" on Monstrous Hound . The team decided to end the trend in Unglued with \"Mooo\" on Hungry Hungry Heifer in extra-large type. However, Time Spiral had \"Obey\" on Word of Seizing as an homage to this tradition, and Zendikar Rising would later print \"Hush\" on Drana's Silencer , and Adventures in the Forgotten Realms had \"Don't\" on Split the Party . Un-cards may care about flavor text. Flavor text matters is featured in Unhinged ( Carnivorous Death-Parrot and My First Tome ) and Unstable ( Ineffable Blessing ). The List of secondary characters is a comprehensive sortable table that lists every character that is mentioned in flavor text, but only played a minor role or even have never appeared in the storyline . Rei Nakazawa (March 21, 2002). \" Adding a Little Flavor \". magicthegathering.com . Wizards of the Coast. Jay Moldenhauer-Salazar (March 21, 2002). \" Clash of the Empires \". magicthegathering.com . Wizards of the Coast. Jay Moldenhauer-Salazar (June 07, 2004). \" Perspectives of a Writing Grunt \". magicthegathering.com . Wizards of the Coast. Jay Moldenhauer-Salazar (October 10, 2005). \" Urban Flavor \". magicthegathering.com . Wizards of the Coast. Ben Bleiweiss (March 20, 2002). \" Fire and Ice \". magicthegathering.com . Wizards of the Coast. Mark Rosewater (March 18, 2002). \" The Write Stuff \". magicthegathering.com . Wizards of the Coast. Mark Rosewater (March 25, 2002). \" Add Text to Flavor \". magicthegathering.com . Wizards of the Coast. Randy Buehler (March 22, 2002). \" Unlikely Flavorful Inspiration \". magicthegathering.com . Wizards of the Coast. Magic Arcana (February 08, 2002). \" The most flavor \". magicthegathering.com . Wizards of the Coast. Matt Cavotta (March 08, 2007). \" Breathe Deep, Smell the Words \". magicthegathering.com . Wizards of the Coast. Matt Cavotta (May 31, 2007). \" Behind The Cardboard \". magicthegathering.com . Wizards of the Coast. Doug Beyer (July 22, 2009). \" Flavor of the Constellari \". magicthegathering.com . Wizards of the Coast. Doug Beyer (February 17, 2010). \" Staging an Intervention \". magicthegathering.com . Wizards of the Coast. Doug Beyer (May 05, 2010). \" Form of the Writer \". magicthegathering.com . Wizards of the Coast. Doug Beyer (June 30, 2010). \" The Lich Get Licher \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 05, 2011). \" Mail Bonding \". magicthegathering.com . Wizards of the Coast."}