{"text": "Garruk (pronounced GAIR-ruck ), called the Wildspeaker , is a planeswalker with warrior - druid abilities and a special affinity with animals and beasts . Garruk is a giant of a man, having used growth and vigor magic so frequently that he's permanently enhanced his own physical size. His height is 8 feet 2 inches (2.5 meters) and his weight is 480 pounds (217 kilograms). He is left-handed. His rusty helm usually covers his hair and the top half of his face. A thick fur cloak adorned with yellowing horns covers his shoulders, while his chest is bare except for a single strap slung crosswise to hold a weapon over his back. Strips of worn leather make a skirt to cover his belly and thighs. His preferred weapon is a huge axe. Garruk is an exceptional tracker and can move in complete silence. He can see (or sense) trails of magic, including those left by planeswalking. Garruk's philosophy is to live naturally, be one with nature, aspiring to become a predator. He is gruff and impatient, uncomfortable in a conversation, or \"civilized settings\", and prefers the wilds. Garruk perceives those who don't understand him as considering him a monster. Garruk has an uncanny understanding of the animal's mind. After defeating particularly difficult prey, Garruk sometimes \"connects\" them to himself, gaining their strength. He was driven to kill by the curse of the chain veil, leading him to hunt planeswalkers as they were the \"prey\" he desired. However, after his curse was removed he was free of this mania. The curse had turned his blood black and oily, which Oko noted weakens magic that is exposed to it, however, he lost this quality after his curse was removed. Garruk's center is in green mana. He had access to black mana while under the Chain Veil 's curse but lost it after being cleansed of the curse by the Cauldron of Eternity . Young Garruk and his father In his youth on an unnamed plane, Garruk lived on a farm with his father - a taskmage named Raklan . On his tenth birthday his father taught Garruk his first spell, but the day took a turn for the dark when a Sheriff from Lord Faldus came to conscript Garruk into Faldus' army. Raklan told Garruk to run and hide in the forest until he told him that it was safe to return. As Garruk fled the pursuit of soldiers over the next few weeks, his father spoke to him through an artifact that he had given Garruk. He warned of the evils and deceptions of people and instructed Garruk to always listen to nature. Seven years passed. Garruk, having bound several large creatures, sought the men who had killed his father. He rampaged through the town near his former home until the Sheriff confronted him. After a short encounter Garruk was brought to the jail where his father died. Garruk had planned for that treachery and called a wurm that devoured the Sheriff. He took the Sheriff's helm and wandered back into the wilds. When Garruk's planeswalker's spark ignited, his first planeswalk was to Shandalar . Having heard of a huge predatory creature called the Ursoth on the plane known as Shandalar , Garruk planeswalked there and hunted the Ursoth with the help of his summoned beasts. When another planeswalker, by the name of Liliana Vess , killed one of his beasts he flew into a rage and tracked her down, assaulting her in an ancient Onakke temple. The ageless necromancer was initially overpowered by Garruk, forcing her to use the artifact known as the Chain Veil she'd been sent to claim from the temple. Using the Chain Veil, Liliana overpowered him with a surge of black magic that cursed him, warping his summoning powers and wracking his body. Desperate for a cure, Garruk planeswalked to a plane he had promised himself he would never visit again: the world-spanning metropolis of Ravnica . Here, he confronted Jace Beleren and demanded to know where Vess was. After a short conflict, which resulted in an enraged Garruk completely overpowering Jace's best efforts before coming to his senses right before the killing blow, Jace told him her last known location . Garruk traveled to an unnamed plane, working as a bounty hunter for a gorgon in return for information on Liliana's location. Although the gorgon betrayed him, a token placed on the bounty returned to her allowed him to gather the info desired about Liliana. Garruk, Relentless After an extended period of tracking, in which he approached any being that may have had contact with Liliana, he finally tracked her to the distant plane of Innistrad . As soon as he landed upon the plane in Kessig , he began searching ferociously for the death-mage. He crossed her path once in Nephalia , but was beset by her ghouls. He slew all of the undead that swarmed him, but it was enough to allow Liliana to escape, and more of his defenses crumbled as he succumbed to the horrible curse inflicted on him. He became mindless, wandering in circles and yelling incoherently at anything that crossed his path, be it man or animal. Truly, it seemed the end for the once-great hunter. Far away, the archangel Avacyn cast a spell called the Cursemute , and though it was not intended for the planeswalker, he was still affected by the magic. The holy magic washed over him and dulled the Chain Veil's influence, the curse was pushed into remission, temporarily freeing Garruk. He regained his senses for the moment and wandered to the road Liliana had taken. He knew that he could continue to track Liliana, but there was another hope if he chose to take it. He turned his back on the light and chose to continue tracking Liliana, knowing he'd have to kill her before he lost himself again. His quest brought him to the town of Torbach and he sought shelter in the house of a dead woman. People believed Garruk had killed her, and the mysteries surrounding the strange bestial man brought Garruk to the attention of Odric , a high-ranking officer in the church's service. Odric trapped Garruk and sought to kill him, but spared his life at the insistence of his second in command . However, guilty of his crimes or not, Garruk would be thrown before Avacyn to answer for them. Odric drugged the planeswalker and prepared him to travel back to Thraben to stand trial. However, as the Curse progressed, Garruk became enraged and escaped Odric and his Riders. Garruk cursed hunting other Planeswalkers across the Multiverse Sometime after leaving Innistrad, the Veil's Curse continued to worsen. His connection to nature and beasts was dulled, while his desire to hunt increased. While Garruk still hunted Liliana, he now viewed all Planeswalkers as the ultimate prey, losing the difference between being a hunter and a murderer. He had embraced the darkness, each kill causing him to throw more of his humanity away and become a greater monster of a man. During this time, Garruk was confronted by a planeswalker known as Vronos , the \"Gray Fencer\". The elite inquisitor attempted to bring the tainted hunter back to the plane under Avacyn's command, in the hope to heal his curse. Vronos was quickly dispatched after a brief and disjointed clash. Garruk took the walker's mask as a trophy. Garruk's plight caught the attention of Jace, who was now looking for a way to fix Garruk. According to Onakke prophecy, the curse would transform Garruk into a demon known as the Worldslayer. Garruk traveled to Shandalar to complete his transformation, which would have destroyed the plane itself. After a battle in the Onakke Catacomb on Shandalar, a suppression Hedron was used to stop Garruk's transformation into a demon . According to some sources this was done by Jace, himself. However, Jace was still unsure about Garruk's condition following the confrontation and sought him out. Masking himself as Liliana, Jace once more appeared before Garruk. However, the ruse was not effective and Garruk explained that though he was cursed, he enjoyed what he had become and wanted nothing more than to be left alone. With a final warning, Garruk told Jace that if he didn't heed his wishes, he wouldn't escape their next meeting. After Jace left, Garruk relaxed as he had projected an aura of power to Jace when in reality he was still weakened. Shortly after Jace had left, Garruk was confronted by another planeswalker. The unnamed ice-wielding planeswalker whom he nicknamed \" Icy \". As it happened, \"Icy\" had been hired by Vronos for \"a great deal of money\" to bring Garruk back to Avacyn on Innistrad. Garruk pointed out Vronos's mask hanging from his belt and, as Icy tried to not-so-subtly planeswalk away, Garruk decapitated him, noting his slowness. He then made his way toward his next unknown destination. While Bolas carried out his plans to harvest the spark of Planeswalkers on the plane of Ravnica, he devised a way to keep Garruk out of the war, thinking he would kill the planeswalkers that were meant to fuel his ascension to godhood. Garruk, Cursed Huntsman. On Eldraine , Garruk stalked a fey planeswalker called Oko . Oko managed to trap Garruk in a net of thorn-laced vines. Oko mesmerized Garruk, turning him into a slave bodyguard called Dog . Oddly enough, he looked very much at peace. Oko observed that his glamour worked so much better when people wanted to be helped. Later, Oko had Garruk save the Kenrith twins when they were ambushed by a large horde of Redcaps . After driving the creatures off, he walked with Will as his master conversed with Rowan . Rowan noted that Garruk was deadly, but not a threat, and could tell something pained him inside. After parting with the twins, Garruk killed the guards of the High King at Oko's behest, before the fey planeswalker kidnapped the man. During that winter, as Oko laid a trap for the Kenrith twins, Garruk was sent to collect Cerise and Sophos , her unicorn . After returning to the fairy circle, he was left to guard the prisoners (Rowan, Will, Cerise, and Cado ) as Oko arranged for the High King to turn stag to be killed and spark war throughout the Realm . Those gathered noted that their griffin , horses, and unicorn were all oddly comfortable around Garruk, some strange quality of his seemingly calming them. While watching over them, Garruk conversed with Will, who offered to remove the hedron from him, which they thought was the cause of his curse. As the hedron was removed from Garruk, the curse ran wild, driving him into a frenzy. As Garruk rampaged, injuring Cerise, Cado's griffin attacked, but was corrupted by Garruk's bare hands, the curse seeping into it. Infected, the griffin itself was driven insane, its pain seemingly giving the Garruk some clarity as he grappled it and wished it a peaceful rest before snapping its neck. With that, he turned to find the planeswalker who had enthralled him, the vine dome around them withering away at his touch. He tracked the planeswalker easily enough, although he was being followed by the twins. As he tried crossing a river within the Wilds , his curse surged causing him to seemingly be devoured from the inside. Undines awaited in the water, hoping to drag him under as a meal but were driven off as a strange abomination arose from the depths to attack Garruk. Regaining his composure at the promise of battle, he wrestled with the beast until he snapped its' spine, turning his attention to the twins afterward. Faster than either could react, he snatched up his axe and rushed past Will, aiming towards Rowan who had made it to the bridge that crossed the water. However, to both their surprise, he had spotted the four-armed, tentacled, howl-back before they had assaulted the beast. Rowan aided the man, learning the creature could devour magic and redirect it to Garruk's misfortune. As the battle ended Garruk found himself thrown against the side of the bridge, battered and bruised, his prey limping off with 3 fewer arms than it had before. Garruk freed from the curse of the Chain Veil His massive weight tipped him over to plummet into the waters below, quickly sinking within the dangerous depths. As he sunk, Will rushed to save him, diving in at his own risk and fending off the horde of undines that wished to feast on the larger man. The boy fought to drag his massive form to the surface once more, even forming ice around his body to cause him to float, but it was too late for both. Will barely reached the surface, pulling the man into the large chalice that had strangely appeared in the water. Unbeknownst to the unconscious Garruk, the chalice had forcibly pulled the curse from his form, his body left as nothing more than a dirt-smeared corpse with matted hair. Garruk awoke once more, the chalice deeming him worthy and granting him life. However, the unconscious form of Will, whom he remembered being the only person to worry about him despite his condition, was floating before him. He swam the boy to shore to his sister. After Will awoke, he listened to them discuss how they needed to save their father, which resonated with him and his memories of being unable to help his own. Agreeing to help them, he enchanted their horses and ran down the trail of the Wild Hunt , following their magic until they came upon the stag being surrounded by the hunting elves. The knights of Ardenvale arrived then, stopping the elves from slaying the stag, but a spirit arose from a nearby well and caused confusion. During this distraction, Oko took the form of the elven queen Ayara and shot the stag in the chest with an arrow. Garruk worked to stop the planeswalker from flying away as he took the form of a raven, then a drake, before finally being pinned to the ground by the twins. He wished to kill the man but hesitated at Rowan's protest, which is all the time the man needed to planeswalk away to freedom. He stayed out of the turmoil that followed, only approaching those gathered after the elves left and the true history of the twins came to light; both planeswalking away in a brilliant show of lightning and ice. He desired to follow Oko and kill the man for what he had done to him, but something else stirred within him, the memories of Will risking his own life trying to pull him from the river. After it became clear the twins would not return soon, he gave their parents his word he would find them and watch over them, something that bewildered the king and queen . When asked why he would do such a thing, Garruk told them \"They helped me. I will help them\" and left the plane of Eldraine behind him, following the trail the twins had left. Garruk followed Rowan and Will to Kylem . After seeing that the twins were safe, he left them alone. Garruk's Axe by NERF Garruk was the first Planeswalker ever designed, with the playtest name of Fendari. Garruk has spent some time on the plane of Zendikar , having hunted wurms (and baloths, as seen in the first part of The Veil's Curse ) in the Turntimbers of Murasa and having recognized the scroll which was the crux of the conflict in Fuel for the Fire . Garruk narrates the trailer for Innistrad and appears in the Throne of Eldraine and ManaStrike trailers. At San Diego Comic-Con 2014, six black on black Planeswalker cards could be bought together with a NERF Garruk Axe. An inflatable version was made for Gamescom Cologne, Germany from August 13-17, 2014. Magic 2015 key art Garruk was notably absent from War of the Spark . According to Mark Rosewater , because his hunter personality didn't fit story-wise and because R&D had other plans for him (i.e. his storyline in The Wildered Quest ). Also, Mark Rosewater confirmed that Nicol Bolas specifically spent energy for Garruk NOT to appear on Ravnica because he would have killed planeswalkers before the dragon could harvest their sparks. Garruk received cross-promotional cards in Lord of Vermilion II , Lord of Vermilion Re:2 , and Lord of Vermilion III . A far-speak amulet. His giant axe. Captain Vronos ' mask. A hedron embedded in his neck. - Removed by Cerise . Associated cards: Depicted in: Quoted or referred to: ↑ Played out in Magic 2015/Duels of the Planeswalkers ."}