{"text": "Gerrard Capashen is the protagonist of The Weatherlight Saga , the epic Magic storyline beginning with the Weatherlight expansion and continuing through Apocalypse . Gerrard's quick reflexes and athletic build were supplemented by advanced combat training. His charisma and sharp wit made him a natural leader, but his impulsive streak made some of the crew wary of his command. Gerrard was the final product of Urza 's bloodline project , meaning his family line had been manipulated by Urza in order to create a perfect human who could stand against the Phyrexians and be the heir to Urza's Legacy . Gerrard was born into the Benalish Clan Capashen , but his family was murdered by Phyrexian raiders when he was just a little boy. The silver golem Karn , part of the Legacy himself and given to Clan Capashen by Urza to protect that bloodline, took the little boy to an ally of Urza, the Jamuraan warlord Sidar Kondo , who adopted the boy. Gerrard and his protector Karn became valued members of Kondo's tribe. Gerrard became especially close to his adoptive brother Vuel . But the Phyrexians, trying to eradicate all of Urza's plans against them, followed him even there. They sent a human native of Rath , Starke il -Vec , to infiltrate Kondo's tribe. When Vuel had to go through an initiation ritual, Starke poisoned the paint with which ritual tattoos were placed on his body. Vuel collapsed while trying to climb a cliff wall, but was saved by Gerrard. As tradition required the rite to be faced alone, Vuel failed. Starke manipulated Vuel even further, making the boy believe Gerrard was trying to take his birthright, and suggesting that Vuel do the same to him. Thus Vuel stole the Legacy items Gerrard possessed and disabled Karn, selling these items to finance an army. Vuel led this army against his former tribe, eventually leading to the death of his own father. However, at the time of Vuel's war, Gerrard was not with the tribe anymore: he had gone to train under another ally of Urza's, Multani of Yavimaya . Here he befriended the elf Rofellos and the cat -warrior Mirri . During their training, they had many adventures, including a journey into the land of the cat-warriors. During this journey, a cat-warrior named Keilic fell in love with Mirri, and Gerrard was forced to oppose him in a shamanistic ritual to win the right to marry Mirri himself. Nothing would have made Mirri happier though, for Mirri was in love with Gerrard. She never told him this and Gerrard never considered her anything more than a close friend as a result. He only agreed to the ritual to help her avoid marrying Keilic. After discovering what Vuel had done, and also finding out that Vuel had mysteriously disappeared, Gerrard, Rofellos, and Mirri joined the crew of Captain Sisay , with Gerrard having lost a tavern wager over a contest of knife-throwing against her. Sisay was part of the Bloodline Project herself and was captain of the Skyship Weatherlight , a flying ship that was also part of the Legacy. As part of the Weatherlight crew , Gerrard helped Sisay track down various Legacy items. She didn't know their full importance, but she did know that they could help defeat the Lord of the Wastes who had killed her parents. Unbeknownst to them at the time, the Lord of the Wastes was another name for Yawgmoth , the ruler of the Phyrexians. During this time Gerrard fell in love with the ship's navigator, Hanna . The feeling was mutual and for a while, they were happy together. When the ancestral home of crew member Crovax was assaulted, the Weatherlight crew went to help. It turned out the attackers were Phyrexians looking for Bloodline subjects, who wanted Gerrard most of all. During this battle, Rofellos was killed, which was too much for Gerrard. He had enough of people dying because of him. He, Mirri, and Crovax quit Weatherlight . Gerrard became a soldier for the Benalish army, rejoining Clan Capashen. Here he uncovered the corruption of commander Alaric . One day, Tahngarth visited him. The minotaur was Sisay's right hand and had come to inform Gerrard about the captain's abduction. Gerrard didn't want to rejoin the crew, but couldn't let his old friend down either. Onboard, Gerrard discovered that it was none other than Starke who had apparently betrayed his masters and had supplied Sisay with information about the Legacy. Gerrard suspected Starke had a hand in Sisay's abduction, but she had been abducted to the plane of Rath, and Starke was the only native of that plane he knew. Thus he tracked the man down and saved him from Maraxus of Keld , a mercenary Starke's Volrath had sent after him.. Starke joined the crew and revealed why he had helped the Phyrexians: they kept his daughter Takara prisoner. Weatherlight then picked up some other new members: the wizard Ertai , former crewmember Crovax, and also Mirri, since Gerrard insisted she would come along. Another surprise came when Gerrard discovered another part of the Legacy that Sisay had managed to retrieve in his absence: his old guardian Karn. Still frozen in the statuelike state Vuel had left him in all those years ago after a truly horrific experience, Gerrard managed to reanimate him with the instinctive knowledge of artifice he had as heir to the Legacy. After arriving on Rath, the evincar Volrath sent his flying ship Predator to intercept Weatherlight . In the ensuing battle, Gerrard received a cut on the left side of his face from Greven il-Vec and was knocked overboard, falling into the Skyshroud Forest . There he discovered the prophetess Oracle en -Vec who told him he was the Korvecdal , the person who would lead the Kor , Vec and Dal tribes, as well as the Skyshroud elves , against Volrath and all who dwell in the Stronghold , Rath's seat of power. He was brought to the home of the elvish lord Eladamri , who had taken Mirri and Hanna prisoner for intruding his woods. Gerrard explained the situation and the two were released. They were reunited with the rest of the crew, although Karn and Tahngarth had been captured by Volrath's forces, and the planeshifting powers of the ship were broken. While Ertai worked to open a nearby portal, the others launched an attack on Volrath's Stronghold to free their friends. As the Rathi tribes attacked the Stronghold, Weatherlight journeyed to the Stronghold's center via the Furnace of Rath and the Death Pits of Rath . When they finally arrived, the crew managed to free Tahngarth and Karn but also had to fight the fallen angel Selenia , Crovax's love, who was now under Volrath's thrall. Crovax killed her, but this triggered a curse on him and turned him into a vampire . Gerrard sent the others to take him back to the ship, while he had Starke lead him to the Dream Halls where Volrath resided. In the Dream Halls, Gerrard suddenly had flashbacks to his youth and the actions of Vuel, and realized the truth: Volrath was Vuel! After his war against his father, Vuel had been told by Starke that Yawgmoth had chosen him to be the new evincar of Rath. Vuel had been transported to Phyrexia and compleated into a more powerful, shapeshifting form. Angered by his brother's betrayal, Gerrard attacked but had to fight a mind-controlled Sisay and Takara. Takara blinded her father, but with the help of a returned Tahngarth, Gerrard managed to subdue the two women without permanently harming them. Volrath then tried to take over Tahngarth, but Gerrard stabbed his brother. After he died, Gerrard discovered that Volrath had used a scapegoat and that he had just killed another shapeshifter , like the ones they had previously encountered in the Stronghold. Gerrard, Tahngarth, Orim, Starke, Sisay, Hanna, and Takara escaped the Stronghold and the Weatherlight made it through the portal. Unfortunately, Ertai couldn't make it back to the ship in time and Crovax had gone insane, leaving the ship. Mirri had followed him, which had lead to her death by his hands. After going through the portal the Weatherlight crew crashed on the plane of Mercadia , where they held a sober memorial for their fallen friends. After Weatherlight crashed, most of its crew members left, only to have their ship, with the healer Orim and all their wounded still aboard, snatched away by a giant wave conjured up by the Cho-Arrim , who believed Weatherlight was a sign that their god Ramos had returned. The rest of the crew was then captured by soldiers from Mercadia City . Gerrard made a deal with the Magistrate , promising to train his forces and lead them against the Cho-Arrim rebels, and in exchange, the crew could reclaim their skyship. Gerrard discovered halfway through his attack that Orim had learned much about the Cho-Arrim during her stay among them and that they were actually decent people while the Mercadians were the villains. Gerrard turned against his forces, but Weatherlight and its crew were captured. Gerrard and his friends then made another deal with the Magistrate: they could go free if Orim and Hanna would retrieve the Power Matrix from the Saprazzan merfolk . Instead, Orim and Hanna made a pact with Saprazzo against the Mercadians, and rescued the others out of jail. In exchange for helping the people of Mercadia rebelling against the Magistrate and his forces, the crew got to use the Power Matrix to upgrade Weatherlight' s engine so they could leave the plane. As Gerrard led several people of his group to retrieve the Bones of Ramos , missing items from the Power Matrix, Takara betrayed them and stole the items. She teleported back to Mercadia City where she captured Squee , Hanna, and Karn, and reveals her true identity: Volrath. Gerrard managed to free his friends and recapture Weatherlight , although Volrath escaped back to Rath. The Magistrate was deposed by the rebelling people of Mercadia and Weatherlight planeshifted back to Dominaria . But the crew did not get much time to rest, for shortly after they arrived home, the Phyrexian Invasion began. Hordes of Phyrexian soldiers entered Dominaria, pouring through portals blacker than night.  The crew warned the people of Benalia, but the officials thought they were troublemakers and threw them in jail. They escaped and fought the invaders, but could only save a few from the onslaught. To make matters worse, Hanna had since been infected with a Phyrexian plague from when she was injured by a piece of Rathi metal, but now it became truly malignant. Advised by the mysterious blind seer whom they met in the prison, they traveled to Llanowar where they won the battle and were reunited with Eladamri, who had escaped the Phyrexians in Rath along with a Vec woman named Liin Sivi and came to warn the people of Llanowar. Gerrard and Eladamri tried to use the Dream Halls to cure Hanna but to no avail. The blind seer sent Weatherlight to Koilos , where the decisive battle of the first stage of the Invasion would be fought, but shortly after their arrival, Hanna died. The leading general of the Invasion, Tsabo Tavoc , manipulated Gerrard's grief over Hanna to gain control over his mind, and only with the aid of his friends and Karn breaking his oath of pacifism could he get free of her hold. Freed of Tsabo, Gerrard led Weatherlight through the next stage of the Invasion, scoring some small victories, but his grief made him fatalistic. After the Rathi Overlay took effect, Weatherlight once again had to fight Predator and although the battle was won, Gerrard and Squee were captured by a new minion of the Phyrexians: Ertai, the mage Gerrard had to leave behind on Rath. In the Stronghold, Gerrard discovered that another former friend, Crovax, had become the new evincar and took control of the invasion after Tsabo failed to bring Gerrard to Yawgmoth. Crovax then transported Gerrard to Phyrexia, where he pledged his loyalty to Yawgmoth, who promised he could bring Hanna back from the dead. Yawgmoth had Gerrard fight another former defender of Dominaria he had corrupted: Urza. Robbed of his powers as a planeswalker within the Ninth Sphere, Urza could not best the skill of Gerrard and was decapitated. Gerrard got his reward but finally realized that Yawgmoth couldn't truly recreate Hanna, only a replica of her. Gerrard stabbed the replica, but Yawgmoth had placed his consciousness in her, thinking it the last place where Gerrard would strike. In a knee-jerk reaction, Yawgmoth flung Gerrard and Urza's head, which he was still holding, out of Phyrexia. Emerging in the throne room of the Stronghold, Gerrard confronted and killed Crovax, after which he was saved by Weatherlight . The Stronghold was then consumed by lava since the stone dwarves set off the volcano it was located in ever since the overlay. Just before this happened though, Yawgmoth himself entered Dominaria in the form of a gigantic black cloud that killed and zombified whomever it touched.  He spread all over the world, killing countless refugees and animating the dead. Gerrard and his friends tried to channel the mana from the Null Moon into a destructive beam to eradicate Yawgmoth but failed to fully kill him. Without any further options, Urza, who was still alive since decapitation isn't lethal to planeswalkers, asked Gerrard to take out his powerstone eyes and place them in two sockets in Karn's chest. This completed the Legacy, forming that which legend refers to as the Legacy Weapon. Tahngarth's axe was imbued with all its energy and with one strike at the tentacles that Yawgmoth was attacking Weatherlight with, a light spread all over the world, eradicating his essence wherever it touched the ancient evil. Then Gerrard, Urza, Karn, and the Legacy disappeared, and Weatherlight sank off of Urborg. One year after the invasion, after Freyalise 's memorial service, the surviving Weatherlight crew members were visited by Karn. But this was not the Karn they knew. He had transcended into a planeswalker, thanks to the essence of the Thran artificer Glacian that had survived within Urza's powerstone eyes, and remarked that both Gerrard and Urza were now a part of him. This Karn has since been involved with the creation of Mirrodin and the Mirari , but there has been no mention of Gerrard as a persona in his head. Many centuries later, Gerrard's heroism protecting Dominaria was still remembered. Among the angels and clerics of the Church of Serra , Gerrard was honored as a martyr. Jhoira sought out members of House Capashen, still a major family of New Benalia after many generations, to be part of the new crew of the reassembled Weatherlight , as she felt that a Capashen on the crew was almost required given Gerrard's role as one of its two famous captains. Though not a planeswalker, Gerrard traveled through the Multiverse as a crewmember of the Skyship Weatherlight . Dominaria Mercadia Phyrexia Rath During Weatherlight design and development, Michael G. Ryan was put in charge of establishing Gerrard's mannerisms and style of speech. The original inspiration for Gerrard was Han Solo . Michael Ryan is a huge Harrison Ford fan. In an alternate reality, Gerrard supplanted Volrath's role by turning against his own progenitor, Urza. Associated cards: Depicted in: Quoted or referred to:"}