{"text": "Geth was a Moriok lich -head who was instrumental in the fall of Memnarch . He was one of the Seven Steel Thanes of New Phyrexia , known as the Thane of Contracts , before being Compleated fully into the Phyrexian Insect Vishgraz by Ixhel . Geth ruled the Mephidross from the throne in the Vault of Whispers , owing his power to having control over the only Vampire in the Dross. This would eventually, however, lead to his downfall. One of his many subjects, a man named Yert , ended up allying with Glissa Sunseeker during her trip into the Dross. She slaughtered Yert's Reaper, a very powerful zombie, and then felt sorry when he broke down crying as a result. He agreed to help her achieve her goals so long as she would help him get a new zombie to control. Geth angered at Glissa's impertinence, ordered his pet vampire to attack, which she defeated after grievously wounding it. With no choice, Geth told Glissa what she wanted to know which got her to leave more quickly. Unfortunately, the vampire's wounds were severe and only an extensive feeding would save it. So Yert was fed to the vampire, ensuring the traitor's death. He did not stay dead, unfortunately, and rising as a vampire himself he overthrew Geth after beheading him. Geth, however, managed to preserve his head as a Lich and agreed to help Glissa acquire the Shield of Kaldra from the new vampire scourge that was sweeping the Dross from his former throne. In exchange for his help though, he wished them to help him acquire a new body. After Karn ’s return to Mirrodin , Geth became one of the guardians of the Mirari and was placed upon a Memnite which would serve as his new appendage. It was revealed that after Glissa Sunseeker disappeared following the events of the Fifth Dawn , Geth returned to the Mephidross in his new state, where he struggled to recover control over the nim . During this time, the Phyrexian corrosion of Mirrodin began in earnest, and Geth was offered a new, Phyrexian body - arachnoid, repulsive, and unnaturally strong. Using this power, he wiped out contenders to the Vault of Whispers , claiming it back as his own. He rested in Ish Sah, controlling the black lacuna, biding his time, and learning about the Phyrexian invaders. He knew that soon, he would have to repay them for his powers, but for the moment, they - and he too - were content to wait. He informed Roxith where he could harvest flesh and revealed he was somehow aware the Thane allied with Kraynox . Unlike the other thanes , who preferred violent subjugation, Geth used backhanded, binding magical contracts to enslave his subjects. The other thanes thus viewed him as weak and ridicule his human origins. Geth was one of the Thanes who aided Urabrask's rebellion against Elesh Norn . Geth had begun to make contracts with various aspirants throughout Phyrexia, those who had not been fully compleated or whose compleation had gone wrong, offering them protection and safety in exchange for service. Atraxa eventually sent the Phyrexian angel Ixhel to assassinate Geth. When Ixhel confronted Geth, he sowed doubts in her about her place in Phyrexia, and after a short fight, Ixhel decapitated him. Vishgraz Ixhel, feeling a strange affinity with Geth despite her contempt of him, killed one of Geth's contract-holders named Belaxis and used parts from his and Geth's bodies, among others, to create a new Phyrexian creature named Vishgraz , who retained some of Geth's personality and memories. Vishgraz awoke to life under the blinding white sky of the Fair Basilica. Ixhel stood over them and gave them the command to destroy any dissenting Phyrexian faction with their deadly poison. Vishgraz obediently complied, eager to take their place in the great lineage of the Mother of Machines. However, when Vishgraz began their invasion, they found their limbs disobeying their commands. The parts had been stolen from other Phyrexians and still retained memories of their previous owners. Vishgraz's poison ate at them from within, driving them to irrational destruction. Upon witnessing this rampage, Atraxa branded Vishgraz a heretical betrayer to the Machine Orthodoxy that birthed them. Disgusted that Ixhel had thought for herself in making Vishgraz rather than remaining obedient to her will, told her to get rid of Vishgraz. Ixhel abandoned Vishgraz in the Dross Pits, and although she felt a strange desire to stay with him, she did not. The creature lurks there still, learning about the world into which he was brought — and taming the writhing swarm of venomous creatures that have come to follow him. Associated cards: Depicted in: Quoted or referred to:"}