{"text": "Gideon Jura , born Kytheon Iora ( KITH-ee-un ee-OR-uh ), was a hieromancer and planeswalker beholden to the multiplanar coalition known as the Gatewatch . Affectionately called Gids by Chandra Nalaar and called Beefslab by Liliana Vess . Gideon was a large, muscular man with black hair, light brown skin, and a baritone voice. Fiercely loyal, unyielding, just, and charismatic, Gideon Jura wouldn't hesitate to enter combat to defend the innocent. He was a powerful warrior-mage with the ability to make himself invulnerable. His distinctive weapon, the sural, consisted of four whip-like blades anchored to the exterior of his armguard. A man of the people, he took pride in leading his comrades towards the common good. Gideon believed that those with power should protect the weak, and took this belief personally, using his invulnerability to protect any in need. He was one to never lose faith in those he called friends, even when all others had, a belief he took to his death, giving his invulnerability to Liliana (although everyone else wished her dead), saving her from her fate at the cost of his own life. Gideon Jura was centered in white mana , though he had red tendencies and aligned himself with the Boros Legion . As he planeswalked, he disappeared in a burst of light, a golden storm. Born in a slum of Akros on Theros , Gideon never knew his father, as he had left sometime before Gideon was born. He lived with his mother until her death while he was still a young man. With no better options, Gideon joined a gang, of which he soon became the de facto leader by age thirteen. With high ideals, he led the other boys to start stealing from the mansions of the rich, taking only what they needed to survive and giving the rest away to the poor. Magic Origins key art Alas, he was caught and Gideon found himself in prison, one poorly suited to keeping him. With that in mind, the local constabulary found a man able to deal with Gideon. This man took him from prison intending to rehabilitate Gideon by teaching him Hieromancy, the magic of order. After a few failed escape attempts on Gideon's part, he eventually settled in, finding the magic fascinating and enjoying the feeling of power he was cultivating. His teacher recognized something within him though and began teaching Gideon of planeswalkers, one of whom had been his teacher, and the man that had given him his sural. He also instilled in Gideon a warning against pyromancy, the form of magic that had killed his former master. Gideon's spark ignited when he killed a much stronger opponent. The impossibility of his survival seemed so overwhelming that as Gideon tried to reconcile what he found, he achieved momentary enlightenment, a perfect perception of the entire multiverse, and slipped into the Blind Eternities . When he arrived in another world his sense of clarity quickly faded, and he returned to tell his teacher what had happened. His teacher revealed that he had been expecting it, having only ever seen one hieromancer as powerful as Gideon, the man who had taught him. He passed the sural onto Gideon that day, and Gideon left to try and find enlightenment once more. The moment that Kytheon's spark ignites from the death of his Irregulars due to his arrogance. Kytheon toiled for four years in prison. When the Kolophon came under attack by harpies and cyclopses , Gideon's teacher, the prison warden Hixus , freed the prisoners that were willing to defend the keep. Kytheon saved the day, leading his irregulars and using his new-found hieromancy. Afterward, he was championed by the God Heliod to defeat an even greater menace, the titan of Erebos (who was also another god). Using Heliod's spear and with the help of his troops, Kytheon accomplished this. Impelled by his hubris, he then threw the spear at Erebos himself. Erebos easily changed the course of the spear, killing all the irregulars. Shocked and shamed by their deaths at his hand, Kytheon then made his first planeswalk to Bant. There he became known as Gideon. As described in the novel, The Purifying Fire , Gideon heard legends in his travels referencing a large naturally occurring fountain of white mana that took the shape of fire on the plane of Regatha . It was called the Purifying Fire by the Order of Heliud , the group that watched over the flame. With interest, Gideon pursued this legend hoping to study it, and was initially denied his request by the head of the Regathan Order, Walbert. Walbert finally acquiesced if Gideon would do him a favor and tasked Gideon with recovering the planeswalker known as Chandra Nalaar when she left Keral Keep . Gideon followed Chandra to Kephalai where he quickly found her, due to her cataclysmic theft of the Dragon Scroll . This theft led to the destruction of the Sanctum of Stars and Gideon tracked Chandra down and attempted to assist her. Unfortunately, he wasn't the only being to have found her and in an attempt to save innocent lives, he incapacitated Chandra. Eventually, he returned the scroll, having kept it in hopes that Chandra would not be executed until it was found, but with her escape, he found no reason to keep it. Gideon once again tracked Chandra, landing on the plane of Diraden in Chandra's footsteps, much to the pyromancer's immense disbelief and fury. He quickly calmed her and suggested that they would accomplish more to escape the plane, which was dominated by black mana and endless night ruled by a Vampire prince if they would work together. Chandra's last ally, a goblin named Jurl, chose that moment to attack them, and Gideon quickly subdued the being. With Jurl as their guide, Gideon and Chandra found their way to a village to speak with their wise woman, the menarch Falia. Falia appeared to be a child, but through the use of Blood Magic, had gained her wisdom from her mother, as well as slowed her aging considerably. Falia was instantly smitten by Gideon's good looks and secretly plotted to separate Chandra from her accomplice. She sent Gideon on a hunting expedition and summoned the Fog Riders to abduct Chandra. Gideon showed up at an opportune moment and slew one of the Fog Riders before they were both incapacitated. While Prince Velrav treated Chandra to his bed chambers, Gideon was handled with more ostentation for his part in the death of the Fog Rider. Gideon was tied to stakes in the courtyard with the understanding that any who should wish it were encouraged to feed on him. When Chandra awoke, she parlayed with Velrav to treat Gideon with more mercy, which resulted in the planeswalker being moved into the dungeons below. Unfortunately, as part of the price paid to have Gideon moved, Chandra had told Velrav of planeswalkers, and Velrav believed he could harness Gideon's essence to become a planeswalker himself. During the ritual that was to attempt this though, Chandra beheaded the prince, and with his death, the spell preventing them from planeswalking was lifted. The pair returned to Regatha and sought the help of Chandra's woodland friend Samir Mia Kaulda . To Chandra's shock, Samir revealed that he had already met Gideon at the headquarters of the Order. Feeling betrayed, she left him to fend for himself and stormed back to Keral Keep. The Order had laid siege to the Keep though, with the simple ultimatum to hand over Chandra. When Chandra surrendered, she only requested that Gideon escort her to Walbert. When the walkers reached Walbert, he revealed that he planned to offer Chandra to the Purifying Fire, hoping she would be cleansed and left powerless as an example to any who would oppose him. Gideon felt immense guilt, not having known of Walbert's intentions, and sought some way to help Chandra escape her fate. Finally, he found passages stating that if a person went into the fire with no regrets, that they may survive unharmed. Chandra confessed to Gideon of the accidental part she played in the death of her village and how it had haunted her ever since. The Fire spared Chandra and left her intact, and with great relish, she destroyed Walbert and his guards, cracking the foundations of the Fire's cavern and the temple above with the power of her fire magic. Gideon was the first to venture forth into the ruin and found Chandra passed out. He was aghast at what she had done but swore he would cover for her if she left and never returned. Chandra revealed then that the soldiers that had killed her parents had the same ideals as the Order of Heliud, and it was in his best interest to consider his allegiances closely, stating that anyone who exemplified the Order's ideals was to be her enemy, even Gideon. Gideon simply responded that they would meet again, and she vanished from Regatha. Gideon's Near Death Experience against the Eldrazi Despite the way the pair parted, Gideon soon began to regret the feelings that they had been left with. With some anxiety, Gideon set his sights on seeking the tempestuous world of Zendikar . Gideon tracked Chandra through the continent of Akoum, only to find her trail going cold in the mountains near the Eye of Ugin . Weary to his bones, he found the nearest settlement, Fort Keff , hoping to find some well-earned rest for himself. Around the fire, Gideon heard tales, strange and disturbing tales, from an adventurer named Tafre. He warned that the land had been acting odd, becoming far more violent than it ever had been before. With nightmarish tales still swimming in his head, Gideon went to sleep to dream of Chandra surrounded by white flames. His rest wasn't to last though, as a primal scream tore his sleep from him. A surrakar had wandered too close to the fort, and the adventurers dealt with it harshly. While it lay injured, Gideon went to it. The beast warned him of its gods who came from beyond the world, from the void with no color, who would devour all the life in their path. Among the assembled soldiers, only Gideon knew the true horrible scope of what the reptilian meant. All the next day, refugees poured in with tales of demon insects. The tales were but the heralds of the terror to come, as the brood swarmed the fort later that day. Gideon fought bravely amongst the soldiers of Fort Keff and he alone turned the tide against the brood. A cry of celebration went up, until Emrakul darkened the skies. Gideon told all the beings of the fort to flee, to follow the surrakar to the underground rivers. Battle for Zendikar key art Left alone, Gideon simply stared at the titan before him, and desperately, he tried to think of some way to fight the creature before him. Only one solution came to him, and Gideon left to seek the assistance of a group of planeswalkers he had heard rumors about on the plane of Ravnica (presumably the Infinite Consortium ). Upon arrival, his immediate efforts came to no fruition. Whatever fate befell the group he was searching for remained a mystery, but as he traveled, he became aware of an overwhelming tension between the guilds. Paranoia and hostilities were rising with the guildless caught between the political juggernauts. Though Zendikar was in desperate straits, if the guilds went to war, the entire population of Zendikar would be only a fraction of the casualties on Ravnica. With little recourse, Gideon postponed his search, looking to the guilds for some way to curb the coming war. While battling a gang of Rakdos Cultists , Gideon attracted the attention of the Boros Legion . He was approached by Aurelia , believing that he could be a potent weapon for the Legion, and offered him a battalion to lead, perhaps more if he joined them. Gideon felt the Boros had the greatest chance of enforcing some form of peace and accepted command of the soldiers, shirking her offer of membership. Gideon leads the Zendikari defensive forces at Sea Gate. Trying to fight a battle on two fronts - Ravnica and Zendikar - at once, Gideon discovered that the hedrons of Zendikar had the power of the eldrazi spawn and that they were connected by leylines . Realizing he couldn't win this battle on his own, he went to recruit the biggest expert on leylines, Jace Beleren . After failing to persuade Chandra Nalaar to join them, the pair planeswalked to Zendikar again. There, they found out that Sea Gate had fallen. They arrived in time to rescue several survivors from Sea Gate and escort them to Sky Rock , a safe zone. Having found out that Jori En - Gideon's merfolk friend - was trapped at Sea Gate, Gideon left to find her and brought her back to Jace hoping that together they might be able to link Zendikar's leylines with the hedrons to find a way to stop the Eldrazi again. After Jace and Jori En figured out that they had to travel to the Eye of Ugin in Akoum , Gideon stayed behind to organize the refugees. As he took over command, and an increasing number of refugees straggled in, he decided to take the offense and reconquer Sea Gate. Battle-hardened veterans and desperate recruits flocked to Gideon's banner, and even the vampires of Malakir joined in. At some point Gideon had heard about Noyan Dar , a leader of a group of wizards known as Roil-mages who were able to control the Roil and even use it as a weapon against the Eldrazi. Gideon paid Noyan and his comrades a visit, seeking to recruit them as allies in helping to retake Sea Gate. After witnessing a demonstration of Noyan and the other roil-mages' power, Gideon requested that Noyan join them at Sky Rock. Noyan, who had up until this point thought Gideon an idiot, agreed, only to realize soon after that Gideon had used his hubris against him as manipulation to get him to offer his help. Kiora , a Planeswalker native to Zendikar, brought her army of merfolk and colossal sea monsters to the fight. Gideon's army began an attack on the Eldrazi-controlled Sea Gate, joined soon thereafter by Nissa . The Eldrazi were driven from the city, and Sea Gate's defensive ramparts were rebuilt and fortified. The soldiers of Zendikar celebrated a hard-won victory. Then, Jori En arrived with the news that Ulamog was approaching .... The Planeswalkers enacted a bold new plan. While Gideon's troops and Kiora's forces held the city against this fresh assault, Nissa called on the elemental power of the earth to raise sunken hedrons from the ground and move them into a ring around the Eldrazi titan. Jace activated the hedrons' magic, and Ulamog was trapped! Then everything collapsed. Ob Nixilis appeared, having followed Nissa from Bala Ged . He summoned Kozilek and defeated Jace, Nissa, and Gideon. Nixilis even thought for a moment that he had killed Gideon. Gideon however survived, but was captured and tortured with the other two, until Chandra arrived in Zendikar, found the trio and freed them. The four together could finally defeat Nixilis, who retreated and swore that he would travel the multiverse to find a fitting punishment for them. Oath of Gideon - “For justice and peace, I will keep watch.” The four planeswalkers realized that they were helpless against large threats on their own, but that they could stand against just about any force in the Multiverse by working together. Thus they swore an oath to stand together and the Gatewatch was created. Seeing that he would be unable to keep his promise to Ugin to both neither harm the Eldrazi nor allowing them to escape from Zendikar, Jace decided to slay the Titans with the Gatewatch's and Kiora's help. After consulting with Nissa, he described the Ley Line pattern to her that would bind Kozilek and Ulamog to Zendikar, drawing the bulk of the Titans into the plane so that their energy could be dispersed into Zendikar, killing them in the process. To attract them, the remaining forces of Zendikar's defenders under Gideon's lead would pose as bait. While the plan worked at first, with Gideon keeping the Eldrazi swarms away from the army, Kiora clearing out any other swarms, and Chandra supporting them, once the Eldrazi titans were anchored to Zendikar, their destructive essence threatened to assimilate Zendikar into themselves. Afraid, Kiora tried to persuade Nissa to release the Titans and allow them to flee, but Jace objected. Chandra offered to burn the Titans instead and after preventing Kiora from attacking Nissa, Jace agreed. The pyromancer then connected with the animist, allowing her to channel her pyromantic magic through Zendikar's Ley Lines directly into the titans. In one brilliant blaze of flame, Ulamog and Kozilek were incinerated and destroyed, leaving only ashes raining from Zendikar's sky. After the defeat of the Eldrazi titans, Gideon stayed a while on Zendikar to help rebuild its civilization. Gideon arrived along with the rest of the Gatewatch on Innistrad after Jace alerted them of the presence of the third Eldrazi Titan, Emrakul . When the Gatewatch tried to use Ley Lines to bind Emrakul like the other titans, Gideon tried to protect his team members from the assaulting Eldrazi hordes but would have nearly been overwhelmed had it not been for the help of the necromancer Liliana Vess. Mistrusting her intentions at first, he later relented to Jace, since the telepath knew Liliana better than he did. While trying to battle Emrakul, the Gatewatch fell under its corrupting influence. Gideon was trapped in a scene where he was confronted again by Erebos along with the other members of the Gatewatch. Erebos asked Gideon to tell him his true desire, or he would wipe out his new friends. Since none of Gideon's answers found the approval of the god, Gideon had to watch as his friends fell one by one. When he was freed from the trap by Jace, Gideon fought to keep the Eldrazi away while Jace, Nissa, and their new ally Tamiyo worked their spell to seal Emrakul into the moon of Innistrad . After the battle was won, he approached Tamiyo, offering her a place in the Gatewatch. When the Soratami declined, Jace and Gideon talked and decided to offer Liliana the place instead. Chandra would blow up the construct with her fire magic, while Gideon would use his invulnerability to keep them both alive. Gideon came to Kaladesh with the rest of the Gatewatch after learning of the presence of the rogue planeswalker Tezzeret there. Having been present during the finale of the Inventors' Fair , the Gatewatch continued to lend aid to the Renegades , moving from safe house to safe house. Gideon was skeptical about this, having stood on both sides of the law, and asked himself if they should have cooperated with Baan to shed light on the threat of Tezzeret from within. This caused friction with Chandra, who saw Tezzeret and the Consulate as the same, wanting to tear it all down. Gideon reminded her that the purpose of the Gatewatch was not traveling from plane to plane to impose their judgment on the world's inhabitants. Otherwise, they would be no better than tyrants. Likewise, he tried to restrain Liliana from killing Consulate soldiers without need. Liliana instead reprimanded him for underestimating the threat that Tezzeret posed. After days, the Gatewatch learned from Saheeli Rai that Tezzeret had sequestered himself into the Aether Spire, experimenting with the invention of Rashmi. Liliana volunteered to go together with Saheeli , while the Renegades planned a diversion by attacking the central Aether Hub of Ghirapur. Gideon would instead lead various attacks to spread Consulate forces thinly across the city. Meeting again with Chandra, the two had an exchange over their previous meeting on Diraden and Chandra's actions on Kephalai . Gideon offered her physical comfort before Baral taunted Chandra to attack him. At the same time, the Aetherhub was under attack from Gearhulks and Gideon decided to protect it. He destroyed the Gearhulk by placing his indestructible body between the gears, causing it to collapse. As the Consulate lost their flagship, Gideon met with Chandra, Liliana, and Saheeli to discuss how to destroy Tezzeret's construction. The Renegade artificers had constructed a special thopter that they would send to shut down Tezzeret's invention. Again distressed by the willingness of Liliana to harm innocents, Gideon tried to argue against her plan to confront the Grand Consul, but with no success. After the thopter had been destroyed by a raid of Dovin Baan, Chandra, and Gideon improvised, entering the thopter themselves. Chandra would blow up the construct with her fire magic, while Gideon would use his hieromancy to keep them both alive. Their plan was successful in destroying the planar bridge , but Tezzeret managed to escape. After the revolt was over, Gideon inducted Ajani into the Gatewatch, telling him that they would be honored if he joined their ranks. Afterward, the Gatewatch came together to coordinate their future activities. Gideon agreed with Liliana and Jace that it would be too dangerous to leave Tezzeret alone and that their best chance would be to attack his master directly on Amonkhet. Gideon's Defeat at the hands of Bolas. Gideon arrived at Amonkhet together with the rest of the Gatewatch, finding himself in a desert filled with undead. Fighting against both undead and hungry wurms, Gideon witnessed how a divine being interceded in their favor, destroying the undead and awakening a long-forgotten yearning within him. When they arrived at Naktamun, Gideon and the Gatewatch was brought before Oketra , who recognized Gideon as one of her own, addressing him as \"Kytheon Iora\". Feeling deep devotion again for the first time since he had dared to challenge Erebos, Gideon advised the rest of the Gatewatch to learn what they could about the plane before they would make their move. He went to Oketra's temple, pledging himself to her to face the Trials of the Five Gods . He was given a cartouche that symbolized his advancement, allowing him to enter the fourth trial with a new crop headed by Djeru . Learning about the faith of the people, he began to feel uneasy but thought nothing of it. When the crop was brought before Bontu , Gideon and his new crop were brought to enter the trial. When Bontu told how none are born strong, Gideon asked her if this also holds for the gods. Bontu commemorated his brazenness and allowed his crop to begin. During the trial, he was horrified about the careless way the crop members treated the lives of their fellows, leaving wounded behind that could have been saved. When the crop came before Bontu, the god told them that their number was too great and that sacrifices of their fellow crop members were in order. Gideon was shocked when the rest of the crop cut down their comrades-in-arms and when he tried to intervene, the god's servants came to restrain him. When Bontu turned to him to demand a heart, Gideon defied her, to the shock of the crop. When they accused him of being a heretic, Bontu replied that he had not found faith and was, therefore, no heretic. Calling him out for judging a culture he did not grow up in and refused to understand, Bontu told him that even the crop members faced doubt, but that their ambition had helped them to transcend it and that this was what her trial taught. Gideon left the Monument, now at first realizing that the Anointed were those that had fallen in the trials. Rejoining with the Gatewatch, Gideon planned to free the dissenters and save the aspirants from the death that would await them in the trials. Gideon vowed to protect Samut from the dedicated before they were overwhelmed by all five gods to act as opponents in the final trial. Bound with cartouches that hindered the use of magic, they were forced to face the Worthy in battle. After the magic that had compelled them to fight dissipated, Gideon put himself between Hazoret and Djeru, \"saving\" him from the final reward of the trials. At this moment, Hazoret prophesied him that he would die by immortal hands and warned him that he was no god. In the final confrontation with Bolas, the Gatewatch was soundly defeated by the dragon. Gideon was severely wounded, lost his sural, and barely managed to planeswalk away. Gideon kills Belzenlok with the Blackblade. After the Gatewatch arrived on Dominaria they realized that Jace was missing. Nissa and Chandra soon left for their reasons as well. This left Gideon and Liliana to confront the demon Belzenlok on their own. Gideon was convinced that Belzenlok had to be defeated to free Liliana's full potential to confront Bolas once again. Even before Liliana was able to heal him, the duo had to save the people of Vess from Belzenlok's revenants led by Liliana's zombified brother Josu . Gideon later devised the plan to defeat Josu. After Josu's defeat, against Ajani 's wish, Gideon and the severely wounded Liliana teamed up with the Weatherlight crew to fight the Cabal and defeat Belzenlok. After learning of the existence of the Blackblade , they realized this soul-drinker could be a possible weapon in their fight against the Elder Demon. Together with Chandra , Gideon infiltrated the Belzenlok's Stronghold to find the Blackblade. By a series of unfortunate events, he ended up in the Fighting Pit. However he could escape and claim the Blackblade, which he ultimately used to kill Belzenlok. Gideon wielding the Blackblade Gideon traveled with the Gatewatch to Ravnica for the final confrontation with Bolas and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . He joined up with the Boros forces led by Aurelia, riding a pegasus that she'd named Gideon's Promise. During the invasion, the trapped planeswalkers met with Ravnican leaders to strategize. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Gideon, Aurelia, Angrath , and Huatli led a massive force of planeswalkers and Boros, Izzet, and Simic troops into battle against the God-Eternal Rhonas , who was leading a battalion of Eternals to destroy the gathered opposition. Gideon and Aurelia led the aerial units, while Angrath led the ground units. After battling his way to Rhonas, Gideon was able to kill the god, stabbing him in the eye with Blackblade and draining his essence. Rhonas' lazotep shell collapsed to the ground, an empty husk. Gideon sacrifices himself to save Liliana, taking the defaulting of her contract upon himself. Later, Gideon instructed Chandra to reactivate the Immortal Sun (which she had disabled), intending to use Bolas' trap against him. He rode Promise toward the dragon, only for the God-Eternal Oketra to shoot the pegasus down. However, the demon lord Rakdos caught him and brought him within striking distance of Bolas. He struck Bolas in the head with Blackblade, but the sword broke against the dragon's flesh; Bolas revealed that he had enchanted Blackblade so that it would never be able to hurt another elder dragon again. After Bolas used the power of the demons' contract against Liliana, Gideon sacrificed himself to save her, using his hieromancy to take the contract and its lethal effects upon himself. As his body crumbled away to dust, Gideon had a vision of his Irregulars in the Theros afterlife welcoming and forgiving him. Ultimately, Gideon's sacrifice was the deciding factor in the battle. Now free from her contract but retaining control over the Dreadhorde, Liliana turned the God-Eternals on Bolas, and with a distraction from Niv-Mizzet she was able to despark and defeat the Elder Dragon. Gideon's vision prior to his death, finally reunited with his Irregulars After the War, Chandra proposed that they bring Gideon's armor back to Theros . The memorial service on Theros was attended by Chandra, Jace, Nissa, Karn, Teferi, Ajani, Tamiyo, Saheeli, and Samut. Huatli recited a poem that she had written for him. A statue was erected in Gideon's honor on Theros as well. Gideon did not enter the Underworld of Theros as he died on Ravnica. Gideon's memorial on Theros. Gideon was completely designed by the author Laura Resnick for The Purifying Fire . She was allowed free rein to create his history as she wished so long as he was a white mage who worked for the Order. The earliest art description for Gideon states that his weapon is the urumi, a real-world weapon from India. The in-universe name \"sural\" appears to be derived from an unorthodox transliteration of the Tamil name of that weapon. In the video game Duels of the Planeswalkers 2012 , Gideon's voice is provided by Daniel Strange. Gideon narrates a non-canon origin in the game's trailer. In the aforementioned game, Gideon's home was given as Bant , but this was incorrect. The early versions of Duels of the Planeswalkers are considered non-canon. Gideon appears in the trailer for War of the Spark . In the video game Magic: The Gathering Arena , Gideon is voiced by Travis Willingham . Gideon used a sural as a weapon, which was lost during the events of Hour of Devastation . The Blackblade - Destroyed when it struck Nicol Bolas (Due to a spell placed on it by Nicol Bolas ages before). Associated cards: Depicted in: Quoted or referred to: Chas Andres (July 14, 2015). \" Journey of the Hieromancer \". magicthegathering.com . Wizards of the Coast."}