{"text": "Gisa Cecani (Gee-sah Seh-sahn-nee) is a black -aligned necromancer from Innistrad . She has a rivalry with her brother Geralf Cecani . Both are however quite insane. The sinister Gisa is a beautiful, young but crazed woman who knows no social restraint in proving that she is the best. As evidenced by her relatively pure approach to reanimating the undead, she is a black-aligned necromancer. Gisa believes in raising the dead directly from their graves, which is why most of her undead creations are ghouls . Gisa doesn't care about the quality of her work; undead creatures are useful for the moment and can be cast aside at will. While her brother is known to have grand ambitions, Gisa is far less formal and driven by her whims. She is one of the most powerful ghoulcallers on Innistrad. She has the ability to connect with the plane and feel every dead and dying thing for miles in every direction. Gisa controls individual ghouls through whistles. Calling large groups of ghouls requires not a whistle but a full-throated song. The siblings were scions of a noble family and distant relatives of the former Lunarch Mikaeus . They were banished from Thraben in a hushed scandal and moved to the Moorland , where they waged war against one another by raising armies of undead . Their battles prompted many of the Moorland's inhabitants to move to the Nearheath , leaving the area even more desolate than before. Now, marauding ghouls range freely through the moors, lost playthings in the mad, epic battles of Gisa and Geralf. Geralf took over Trostad, most likely massacring the inhabitants that didn't flee. In response, Gisa attacked Trostad simply to best her brother. Later on, the two would plan on waging a war against one another. Geralf had tried to set formal rules, named The Five Laws of NecroWarfare : No spontaneous awakenings. No luring, killing, and raising of bystanders or livestock. Combatants face off at a predetermined place and time. Combatants must have at least three limbs to play. Headquarters are off-limits. After Gisa retrieved the magical sword the Bloodletter, Geralf added the rule: No magical swords. Gisa however would have none of this and considered all was free game, frequently defying Geralf's rules if only to infuriate her brother. The engagement was called off when Geralf decided to invade Thraben and invited Gisa along. Geralf snuck into the city before the attack to kill Mikaeus . Later he met up with Liliana , who shortly thereafter brought Mikaeus back as a zombie . Gisa was left with tending to the siege, having gained control of Geralf's Skaabs along with her conventional undead. The army broke the outer wall of the city before being pushed back by the fire, causing Gisa to abandon the siege. Odric , a champion of the church, captured Gisa and held her imprisoned in Rider's Lock. Geralf sent a horde of skaabs to set his sister free, although she stated afterward that she didn't need his help. She wanted to reinstate the war, but Geralf was occupied with creating what he called his masterpiece, under the wing of the alchemist Ludevic . Gisa retreated to the manor of their parents, ruined by a fight between the siblings in their youth. She later revived her parents as zombies, but sent her Father back into the ground. She found a new friend in the lithomancer Nahiri and provided the ghouls to build the Drownyard temple. When Liliana Vess was going to raise an army of zombies to fight the hordes of Eldrazi that had invaded the plane, Gisa and Geralf briefly managed to put their differences aside to team up against the Eldrazi. In the two years that passed since Emrakul's sealing, Gisa took control of Liliana's abandoned zombie army and made Thraben her own, taking up residence in the ruined city's least destroyed building. She hadn't seen her brother since and sought to contact him again. After an exchange of letters with Geralf in which she begged him to attack Thraben to alleviate her boredom, only to be refused, Gisa noticed the arrival of her suitor Wilhelt at the gates of the fallen city. Wilhelt once again declared his love for Gisa and begged to be acknowledged by her as more than just an undead pawn. Tired by his insistence, Gisa easily defeated Wilhelt's army, forcing him to leave. Gisa then wrote again to Geralf, telling him of her intention to leave Thraben and move in with him (to his horror). After Gisa left Thraben, she joined her brother's lab in Havengul , but he soon found the conditions too tight, forcing her out. She took over the Engelturm left behind by the angels. At some point, she encountered Jeleva and impressed upon her that devouring Gisa's mind would somehow damage her own, leading Jeleva to instruct the local vampires to avoid Gisa. Spending her time teasing Geralf with letters and defiling the angels' work, Gisa met a compleated warrior. Geralf wrote to her, informing her that the Phyrexians invaded Innistrad and the two siblings joined forces once again, defeating the forces of New Phyrexia. Gisa once reanimated the corpse of a planeswalker killed by Garruk . Gisa's Favorite Shovel was created as the Universes Within version of Lucille from the Secret Lair Drop Series: The Walking Dead which was originally released as a Universes Beyond tie-in with The Walking Dead . Associated cards: Depicted in: Quoted or referred to:"}