{"text": "Gix was a Phyrexian demon and praetor who served as one of the highest-ranking lieutenants to the Dark God Yawgmoth .  Originally a human Thran from the continent of Terisiare on the plane of Dominaria , Gix was converted into a Phyrexian Demon by Yawgmoth himself during the events of the Thran-Phyrexian War . His demon body was built of bone, machine parts, and soft meat. The Cruelty of Gix. Gix first appeared during the final years of the ancient Thran Empire as a human rebel operating out of the Caves of the Damned , a network of tunnels beneath the Thran capital that served as home to the outcasts of Thran society. Most of these outcasts, including Gix, suffered from a deadly sickness known as phthisis , which was caused by radiation from powerstone s, the very energy source that fueled the Thran Empire and all its technological advancements. Channeling the anger and resentment of the outcasts, Gix ambushed and attempted to assassinate Glacian , the genius Thran artificer who had pioneered powerstone technology. He stabbed Glacian with a powerstone shard, thus infecting him with the same radiation sickness that afflicted the outcasts in the Caves of the Damned. As Glacian's health deteriorated over the next few years, his wife, the Thran architect Rebbec , summoned the exiled medical prodigy Yawgmoth back to the capital to treat him. During this time, Gix led multiple violent uprisings in the capital, but in the end, his rebellion was pacified by Yawgmoth , who finally devised a cure for phthisis and offered to share it with the sick inhabitants of the Caves of the Damned. Using the cure as leverage, Yawgmoth was able to coerce an oath of loyalty from Gix, who, in return for the phthisis cure (and his life), vowed to serve Yawgmoth faithfully forever. After the founding of Phyrexia by Yawgmoth, Gix became one of the first living beings to be Compleat ed, shucking aside his humanity to become a Phyrexian monstrosity and rising to serve as Yawgmoth's right-hand man throughout the Thran-Phyrexian War . At the conclusion of the War, he was banished from Dominaria along with all of Yawgmoth's minions, trapped on the mechanical plane of Phyrexia when the Thran architect Rebbec closed the portal connecting Phyrexia to Dominaria. The Thran Empire collapsed in the War's aftermath, but Yawgmoth, Gix, and the other Phyrexians remained sealed away from Dominaria for eons. Augmenting themselves with machinery and dark technology, the Phyrexians transcended their former mortal lifespans. Over the millennia that followed, Gix became a powerful demon and praetor while his master, Yawgmoth, ascended to become a god deep within the core of the plane. Five thousand years after the fall of the Thran, Gix managed to return to Dominaria during the events of the Brothers' War , when the portal between Dominaria and Phyrexia reopened due to the unwitting interference of the brothers Urza and Mishra . As the brothers' rivalry escalated into a world-shaking military conflict, Gix cultivated human servants and manipulated both sides of the war in the hopes of laying the groundwork for a future Phyrexian invasion of Dominaria. Gix found Mishra's faction to be especially susceptible to Phyrexian influence, and toward the end of the war, he oversaw Mishra's Compleation, bringing the younger brother fully into Phyrexia's grasp. Although Gix's machinations resulted in widespread disaster for the Brothers, his efforts ultimately failed when Urza unleashed the apocalyptic sylex blast during the final battle of the war, wiping out the armies of both brothers and forcing Gix to escape back to Phyrexia with a handful of human followers. In the immediate decades following the Brother's War, Gix oversaw the creation and development of Phyrexian sleeper agents to be seeded throughout Dominarian society. The first sleepers appeared on the continent of Terisiare about twenty years after the War; however, these early sleepers all looked eerily identical. This roused the fear and suspicions of the local populace, who proceeded to exterminate them. Gix developed new sleepers, these more convincingly human, but just as they were being dispatched to infiltrate Dominaria, a rift began to form between Phyrexia and Dominaria, preventing the Phyrexians from crossing over. This rift turned out to be a delayed result of the sylex blast, which had been so powerful that it had torn the very fabric of the Multiverse, creating the Shard of the Twelve Worlds and once again cutting Dominaria off from Phyrexia. This was a disastrous setback for Phyrexia, and Yawgmoth's wrath was terrible. Someone had to be punished, and the dark god's anger fell upon Gix, who had been leading Phyrexia's activities on Dominaria during the time of the Brother's War.  Gix was seized, excoriated, and cast down into Phyrexia's Punishment Sphere to be tortured indefinitely. Art from The Duelist #34. Art by Chippy Gix's punishment lasted several thousand years, but eventually, he was released from torture following the destruction of the Shard of Twelve Worlds, which once again opened up the path between Dominaria and Phyrexia. Gix was placed in command of the Phyrexian incursion into the small Dominarian nation of Efuan Pincar . Urza, now a planeswalker, discovered Gix's involvement and engaged him in a climactic battle in the former Caves of the Damned (known by then as the Caves of Koilos ). When neither combatant could gain the upper hand, Gix attempted to use a temporal shift to rip out Urza's powerstone eyes and destroy the Planeswalker. But the rogue Phyrexian sleeper agent Xantcha and the human Ratepe intervened and sacrificed themselves to disrupt the spell, causing it to implode upon Gix in a blinding inferno and annihilate him at last. Gix's legacy lingered on, however, and sixty years after the Mending , his name is still not forgotten . Although he is frequently referred to as a \"demon\", he lacks the demon type. Some likely apocryphal legends state that Gix pulled the Golgothian Sylex from Phyrexia 's deepest ichor well. Though not a planeswalker, Gix traveled through the Multiverse using the portal to Phyrexia. Dominaria Phyrexia Associated cards: Depicted in: Quoted or referred to:"}