{"text": "Golem is a creature type describing artificial life-forms created by magic, typically with powerstones providing them with energy. There is some degree of ambiguity between golems and constructs , which are powered by physical machinery. The first golem creature was Obsianus Golem from Alpha , although it only gained the golem type in Sixth Edition . Golems are usually humanoid in shape, although they are often much larger than a human and occasionally have additional limbs to help them perform their tasks. Golems can be made from a variety of materials, but the most common ones are made of metal or stone due to their strength and malleability. Golems are generally created to perform a specific purpose that would be inconvenient, difficult, or impossible for a wizard to do, such as carrying heavy objects, working in dangerous environments, or engaging in physical combat. Golems were mainly constructed on Esper , using Etherium ( Salvage Titan ). Golems on Amonkhet were formed in the aftermath of the Hour of Devastation. The Tombs of Disgrace, sarcophagi once used to imprison dissenters against the God-Pharaohs teachings, came to life and walked through the destroyed city , searching for what once had made them whole ( Hollow One ). Various kinds of golems can be found roaming Strixhaven campus, attending to the College's needs. In particular, many golems, some highly intelligent, have been excavated by Lorehold College. Enormous golems created as protectors of the Sardian Mountains . The Attendants , such as Rith's Attendant , served each of the Primeval Dragons and were designed to help awaken them. Hollow Warriors were used by the Keldons during their invasion of Jamuraa . They were powered using the life force of living beings, but could only be used for a short time before the warrior powering them became fatigued. Thran Golems were amongst the most ancient forms of golems. They inspired the young Urza , who copied their design and then used it as a basis for his more advanced golems. When Urza was dueling with Gerrard in Phyrexia , he created several golems that he brought to life by inscribing them with the word EMETH, meaning  “truth” in the Thran language. Golems on Eldraine appear to spontaneously arise from uncontrolled magic imbuing life into artificial humanoid forms, from statues to gingerbread cookies . Gingerbread golems, known as gingerbrutes, are often created in the Realm accidentally by bakers, causing mayhem throughout the kitchen before running to the Wilds where their ingredients originated. The witches of Dunbarrow craft gingerbrutes intentionally, employing them as soldiers. They are able to speek the same language as their creator. The same magic that animates a gingerbrute also makes it more delicious. Those who have eaten one report feeling a burst of energy like a long-lasting sugar rush. On Innistrad , golems like the Epitaph Golem are formed when angry geists possess gravestones and mausoleums, marauding around grafs. Through the years in which the Sun Empire was ruled from Orazca , its priests crafted huge stone guardians (e.g. Gilded Sentinel ) to protect the empire's cities and temples. The incredible magic of the Immortal Sun gave a semblance of life to these artificial creatures, endowing them with the ability to move their stone bodies, a keen awareness of their surroundings, and a limited ability to think and reason to help them carry out their orders. These stone guardians were tasked with a standing watch—constantly alert, vigilant to any danger, never sleeping, and unswerving in their duty. Most stone guardians are inactive now. The magic that gave them life has faded over the centuries in ancient ruins lying far from the old capital. Even within the golden city, many of them have become inert, and those who seek to explore Orazca or other ancient ruins must be on constant guard. Any carved figure or statue might well be a stone guardian whose magic has failed. But it might also be a guardian that is simply waiting for a threat before it activates and drives that threat away. The Ur-Golems were an ancient civilization of golems, created by Karn in his image, that lived on Mirrodin before the plane was taken over by Memnarch , who sent them to fight the mycosynth plague that eventually eradicated them. They are now only known through their etchings. Glass Golems were created by the Izzet . They are powerful but very fragile. Transguild Couriers were used by all of the guilds to relay messages between the guild leaders as they avoid face-to-face contact, but are immune to bribery and threats. Walking Archives were used by the Azorius Senate as a combination of a librarian and a library itself. The golems of Tarkir were constructed by the monks of the Jeskai Way . These golems are especially resilient and known to last over a thousand years ( Pilgrim of the Fires ). They were used to guard the holiest sites of the Jeskai and protect the secrets of the world's past. In the old timeline, ancient golems lived in the polar regions, having witnessed the fall of Ugin and the death of the dragons ( Witness of the Ages ). In the new timeline, the Silumgar are known to raid and steal the old Jeskai golems and repurpose them as treasure guardians. While the Ojutai still practice the crafting of golems, their new models are less hardy than before ( Keeper of the Lens ). This leads some mages to seek out lost lore about them. The Hammer of Purphoros and the god that wields it can create golems infused with the essence of Nyx from the earth. Other golems are often statues guarding poleis or temples dedicated to the gods that come to life when they are threatened. The most impressive of these is the Colossus of Akros . Golems were constructed by parties unknown to guard the Mage-Rings on Vryn ( Mage-Ring Responder ). Most golems on Zendikar , like the Enatu Golem , were created by the pre- Eldrazi civilizations of the plane as means to defend themselves and their holy sites. In the ages that followed, some mages found a way to recreate the process. They shape bodies from special stones and infuse them with the power of movement and limited understanding. Golems are rare and powerful, especially when shaped from stone that already possesses magical power. An example of this is the Lodestone Golem , whose very presence warps the Aether and blocks most spells. Colorless Golem artifact creatures are created by: Dread Statuary (4/2) Guardian Idol (2/2) Jade Statue (3/6) Xanthic Statue (8/8)"}