{"text": "Greven il -Vec was the man in command of the skyship Predator and the armies of Rath . Forced to be Volrath 's second-in-command, he vented his rage on anyone around him. To fulfill this role, Greven had received various Phyrexian enhancements to his muscle mass and fighting skills, making him one of the deadliest warriors of Rath. However, much to his chagrin, he was also fitted with a mimetic spine that the evincar Volrath used to control and punish the warrior. This demeaning left him extremely bitter and resentful, which he then took out on his soldiers. This, combined with his being an exacting taskmaster who was more than willing to execute weak or insubordinate soldiers, made him unpopular with his men. Greven had once been a member of the human en - Vec tribe and a leader of a nation of warriors, until like many others, he was drawn to the potential power and status offered by the Stronghold . Greven turned his back on his people and joined their oppressors, becoming il -Vec, a dishonored outcast. In the Stronghold, Greven quickly rose through the ranks due to his efficiency and deadliness, eventually being given command of the Stronghold's flagship, Predator . Greven put the vessel to good use, suppressing rebel encampments and routinely bombarding Skyshroud in an effort to root out insurgents. After the kidnapping of Captain Sisay , the evincar Volrath entrusted Greven with a crucial mission: when Weatherlight inevitably came to the rescue, he was to intercept it, steal the Legacy artifacts, and bring them and Gerrard Capashen back to the Stronghold. Greven dutifully obeyed, taking Predator to the edge of Skyshroud and laying in wait for his target. When Weatherlight arrived, Predator caught it by surprise, boarded it, and soon overpowered its crew. While his moggs hunted down the Legacy, Greven personally took charge of capturing Gerrard, easily overpowering him. However, Greven was denied his quarry when his first officer, Vhati il -Dal , tried to assassinate Greven by firing Predator' s main cannon at him. Vhati missed, but the impact knocked Gerrard overboard into the forest below. Furious, Greven stormed back to his ship and threw the groveling officer overboard before returning to the Stronghold with the captured artifacts. Upon his return, Volrath was even more furious than Greven had expected him to be. Greven tried to assure him that Gerrard could not have survived, but Volrath disagreed, demonstrating his annoyance by sending bolts of intense pain into Greven's spine for hours. Humiliated, Greven vented his rage on his new subordinate: Tahngarth . The minotaur had stowed aboard Predator in an attempt to retake the Legacy, but Greven had easily beaten him. Now in the Stronghold's dungeons, Greven decided that Tahngarth would make a good replacement for the deceased Vhati, once he had been properly changed. Greven, therefore, began mutating the minotaur's body into that of a Phyrexian. However, Greven was interrupted by alarms blaring throughout the fortress, warning of an attack. He returned to Predator and took to the skies, again battling Weatherlight . This time, the enemy ship was ready for him, dodging its bulkier nemesis and smashing it into the Stronghold using Predator' s own grappling lines. Greven briefly left the vessel to fight a rematch against Gerrard, but his enemy again eluded him. Rejoining his crew, Greven pushed his vessel to its limits in trying to catch his prey but was thwarted when Weatherlight went through the Erratic Portal , which closed behind it. Unable to stop in time, Predator smashed into the rock face, sustaining heavy damage. Greven’s ship limped back to the Stronghold, needing the aid of the captive Ertai to stay aloft. Greven was expecting a severe punishment from Volrath for his failings, but was instead given the news that the evincar had disappeared, throwing the rest of the Stronghold into chaos. Greven took charge, contacting the Phyrexian overseers about the situation. He was informed that Volrath had abandoned his throne to pursue a personal vendetta and that an emissary would come to select his successor. At this point the leading candidate was also introduced, Crovax . Greven instantly disliked him, but was prevented from slaying the upstart by the arrival of the emissary, Belbe . After restoring order to the Stronghold, Belbe gathered the three potential candidates for the evincarship. Greven was present, as his years of service and his command over his troops earned him a chance to compete. During the meeting, Greven and Crovax got into an argument that quickly descended into a fist-fight. Greven’s strength gave him the advantage, but just as his victory seemed assured, Greven collapsed in fits of pain: Crovax had worked out how to control Greven’s mimetic spine and used it to lay low his enemy. After his humiliation, Greven stalked off to personally oversee the repairs to Predator . The work made slow progress, during which time Belbe offered to consider Greven as a candidate for evincar as a reward for his lifetime of dedicated and capable service. If he won, he would not only be ruler, but would also finally be free of his hated mimetic spine. However, Greven turned down the offer, saying he had seen what having such power turned its bearer into. Greven claimed he preferred being the sword, rather than the hand that wielded it. When Crovax decided to prove his strength by attacking the Skyshroud rebels, Greven was grimly satisfied, hoping that Crovax would be killed in the expedition. However, the campaign also left the Stronghold severely lacking in troops. In order to stop a potential rebellion, Ertai came up with the plan to take 5,000 hostages from the three human communities with the promise of releasing them once the expeditionary force returned. Greven was impressed by the young mage's cunning and quickly rounded up the necessary hostages before returning to the repair work. As Greven had predicted, the Skyshroud Expeditionary Force was a disaster, resulting in heavy losses and Crovax's disappearance. Without their commander, the force slowly made its way back to the Stronghold. Greven avoided the utter destruction of the force by taking the newly-airborne Predator to retrieve them. Upon his return, Greven found to his disappointment that Crovax had in fact survived and had teleported back to the Stronghold, where he had discovered the hostages and slaughtered every last one of them. He also discovered that Eladamri had somehow been captured. Greven cared little for the details, happily getting to work torturing the elvish rebel. However, Greven was unable to break him. Frustrated but secretly impressed by the elf's resistance, Greven left the dungeon to meet with Furah , a Kor leader that had apparently betrayed Eladamri. Greven was stunned when Furah revealed he was in fact Volrath, who had returned to reclaim his title. Volrath chose the moment of Crovax's coronation to reveal his return. Greven interrupted the ceremony, announcing that another candidate should be considered, at which point Volrath shape-shifted back into his natural form, to the amazement of the court. Crovax was outraged at being denied the throne after Belbe had promised it to him, but Belbe simply proposed a duel between Crovax and Volrath to settle the dispute. The duel was vicious, with neither candidate being able to gain an advantage until Ertai interfered by magically off-balancing Volrath, allowing Crovax to triumph. Ertai's interference would earn him the new evincar's gratitude, but Greven's treachery, coupled with his earlier clashes with Crovax, meant that he could expect even more brutal treatment than he had experienced under Volrath. Greven still remained in command of Predator up to the time of the Rathi Overlay , but was kept on a tight leash by his new master. When Weatherlight appeared in Urborg to attack the newly-arrived Stronghold, Predator was sent to intercept it. Weatherlight had undergone significant changes since last the vessels had fought, so Predator proved little match for her, being unable to damage Weatherlight ’s mirrored hull and almost being cut in half by the vessel's prow ram. However, Greven and his warriors still managed to board Weatherlight and fight her crew in melee combat. Greven fought a rematch against Tahngarth, but found that the minotaur's hatred of Greven gave him a maniacal strength. Meanwhile, Greven found his own mind being dominated by that of Crovax. His body no longer his own, Greven soon fell beneath the raging minotaur's blade as Crovax threw his now-useless weapon at his opponent. Afterwards, Greven's tattered corpse was thrown back onto the wreckage of his ship as it fell into the Stronghold. Depicted in: Quoted or referred to:"}