{"text": "Griselbrand was one of the demonic masters of Liliana Vess . He granted her the power over death. Griselbrand was the most powerful of Innistrad 's demons. The archangel Avacyn and her angelic host used the Helvault , an artifact of immense power made of pure silver from their moon , to imprison Innistrad's demonic forces. Before completing their task, Griselbrand challenged Avacyn to combat. After battling for days, Avacyn used her remaining strength to drive Griselbrand into the Helvault. In response, Griselbrand threw his spear and impaled the archangel through the heart, causing Avacyn’s binding spell to rebound, resulting in both Griselbrand and Avacyn being imprisoned. Liliana Vess visited Innistrad in the hopes of destroying Griselbrand, with whom she had made a demonic pact that would result in her soul's enslavement. To this end, she opened the Helvault by forcing an ultimatum on Thalia, its guardian. Immediately after his release, Griselbrand used his freedom as an opportunity to escape Avacyn. However, Liliana tracked Griselbrand down, slaughtering both angels and demons alike, and finally cornered him. Desperate, Griselbrand attempted to sway Liliana with promises of power, but she saw through his lies and used the Chain Veil to kill him permanently. Associated cards: Depicted in: Quoted or referred to: Griselbrand has become a powerhouse in every format it has been legal. It has affected Commander, Legacy, and Modern. Usually present in Reanimator decks, many other decks were constructed that use a reanimated Griselbrand as a means rather than the ends of their deck's combo. His no-mana draw-seven ability has become the engine in decks like Tin Fins (a Storm-Reanimator strategy from Legacy), Instant Reanimator (a deck that intends to keep looping the draw-seven ability to win), and Grishoalbrand (a deck that uses another manaless effect, Nourishing Shoal , to refuel the draw). As of 2022, all Legacy Reanimator decks tend to run at least 1 copy of Griselbrand. Innistrad demons are made of pure black mana, which allows them to regenerate after death. This process can take a millennium or longer, but it is unclear if the use of the Chain Veil may have made Griselbrand's death permanent. The in-game community often gives nicknames to Griselbrand or Griselbrand-decks making playful jokes with its name. Some examples are Griseldaddy, Griselboss, Griselcannon, and Griselshoot. Reanimator Black Legacy Reanimator deck Legacy Modern Liliana Vess"}