{"text": "Gull was a human woodcutter with a bad knee from North Aerona on Dominaria . Traveling with his planeswalker sister Greensleeves , he became an experienced fighter against evil wizards. Gull lived peacefully with his sister and his younger brother Sparrow Hawk in the village of White Ridge , on the border of the Whispering Woods . Greensleeves was perceived to be dim-witted because she couldn't talk, but only chattered like an animal. One day a falling star was seen in the sky, which was reputed to be a bad omen. This was proven true when White Ridge was destroyed during a wizards ' duel . The elders and the children all died, and almost all remaining villagers decided to relocate elsewhere. Gull and Greensleeves stayed behind. Gull found the centaurs Helki and Holleb and the Two-Headed Giant Liko , stranded after the battle. Gull first treated them harshly, thinking that they were just mercenaries , but they revealed that when a wizard summoned them, they were mind controlled to fight for him (or her). That evening, one of the wizards, Towser , came to Gull and, after assuring him he had no part in the destruction of the village, asked Gull to become his new freightmaster since the old one perished in the duel. Gull, confused by the mind magic of Towser and with nowhere else to go, accepted his offer and brought Greensleeves along. Towser, as a token of gratitude, sent the centaurs and the giant back to their home. After the convoy started its journey, Gull quickly befriended Morven , an old sailor turned bodyguard, and Stiggur , the cook's boy. He even fell in love with Lily , one of the dancing girls of Towser. Another bodyguard, Kem , instead started antagonizing the woodcutter. After a difficult slog through the forest, the wagon train reached its destination: the place where the star fell. The star was revealed by Towser to be a Mana Vault , a powerful artifact which could store mana. During the night, the camp was attacked by another wizard. Gull managed to save Lily from the clutches of a Black Knight , but then the enemy wizard stormed the camp to kidnap Lily and Greensleeves. He was however defeated by a suddenly appearing Fungusaur . During the battle Gull saw Helki and Holleb again, and thought that Towser might have enslaved them; he confronted the wizard, but once again the mind magic of Towser was enough to appease him. Finally out of the Woods, the convoy stopped for the night near a swamp . During the night, though, Kem was kidnapped by Sedfe Trolls , so Gull and Greensleeves entered the bog and saved him. The convoy finally reached a coastal city. Gull was amazed by the city, the sea, and the birds he was named after . His greatest surprise was the discovery that Greensleeves suddenly could talk since it was the overwhelming magic of the Whispering Woods that had clouded her thoughts. One night, the siblings and Lily were kidnapped by Towser's minions. Back at the camp, the wizard revealed his intention to kill Greensleeves and store her power in the Mana Vault. A fight started, and Towser was forced to teleport away Gull, Morven, and Stiggur. The three found themselves on a tropical island, where they met, among others, the centaurs and Liko again. It appeared that the island was where Towser would send his minions when he didn't need them and that there wasn't any way to escape from it. Still, Gull refused to surrender and started organizing the people on the island in a ragtag army, until one day he was summoned away. Gull was summoned by Lily who, unbeknownst to herself, was a wizard. Towser had tied Greensleeves to an altar and he was ready to kill her, when Kem changed sides, remembering how Gull had saved his life in the bog. At the same time Greensleeves, who also was revealed to be a wizard (she had summoned the Fungusaur), started summoning Morven, Stiggur, the centaurs, Liko, and all the creatures of the woods who had befriended her to fight Towser's minions. Still, Towser was a veteran wizard and could control his creatures better than Greensleeves. She resolved to use an earthquake , which destroyed the cliff they were on and plunged them into the sea. A tsunami , caused by the earthquake, was coming, so Towser escaped with his flight spell. Gull, Greensleeves, and Stiggur escaped from the huge wave taking refuge in a crack in the cliffside, while Morven and Kem were swept away by the sea. After the water had settled, they found that Lily, the centaurs, and Liko had survived. Gull and his friends vowed to form an army to fight Towser, who Gull now had realized was the wizard who had killed his family, and all the evil wizards who saw people as mindless pawns. With his sister, he forms the army and fights several wizards. When Greensleeves becomes a planeswalker , he travels with her to Phyrexia to find the Stone brain . The army grows into a formidable force and liberates almost all of North Aerona . However, all the fighting and death take their toll on Greensleeves. The druid just wants some peace, in the company of her lover Kwam and her brother, who has married Lily and becomes the father of two daughters. Meanwhile, eleven wizards under the leadership of Towser and Karli have regrouped and protected themselves from Greensleeves's magic. Aided by a huge Keldon warlord with a personal grudge against Gull, they attack the army from three different directions. Gull is confronted by the Keldon warlord : before the enemy can kill the woodcutter, Greensleeves teleports herself, Gull, and the survivors of their army to their headquarters. After traveling to Lat-Nam to discover the secret of the Stone Brain, they are attacked once again by Towser's wizards. After a long battle, the army retreats in the tunnel, where Gull has a prophetic dream about his dead family: however, among them, he doesn't see Sparrow Hawk , their long lost brother, and has a revelation about the warlord's identity. Towser proposes a truce, to which Gull answers asking for a personal duel between himself and the warlord. When Gull reveals to the warlord that the latter is, in truth, Sparrow Hawk, who has been kidnapped and enchanted by Towser to be a war machine, the two brothers reconcile. However, Haakon unleashes a fireball against the two, which are engulfed in flames. This causes Greensleeves to go mad with anger and sorrow, making the \"final sacrifice\" of her ideal that every life is sacred. She blasts Haakon with a bolt, then traps the other wizards in the desert and summons a Force of Nature . Absorbing the mana of the creature, which is the mana of Lat-Nam and Terisiare itself, Greensleeves becomes a godlike being and loses herself, seeing her friends and family as mere ants compared to her. Before she can unleash her overwhelming power and destroy the isle, she is brought to her senses by her lover Kwam and sees that her brothers have survived the fireball, thanks to the enchanted might of Sparrow Hawk. Greensleeves decides to pour all of her mana into the isle of Lat-Nam, curing the land of the poison and transforming the desert into a verdant forest, thus sacrificing her planeswalker powers. In the aftermath of the Battle of Lat-Nam , Greensleeves is declared High Wizard of the Domains by her followers. She and her brothers disappear from history."}