{"text": "Halo is a magical substance made of angelic essence that rules the criminal world in New Capenna , sought after by all for its magic-enhancing and curative qualities. Halo is an iridescent magical substance that had been sustaining power and life within New Capenna for years. It comes in many forms, including crystals, liquids, and vapors. As a solution, it looks as if the cosmos had been distilled and pushed through a sieve, leaving only the base elements of existence behind in a substance that is neither liquid, solid, nor gas — more like pure magic condensed. Its taste is described as \"effervescent and clean, citrus-bright and sweet without being cloying.\" Just one taste can make a creature stronger, but too much can make them reckless. It fills the imbiber with strength, with purpose. Muscles are no longer exhausted, and senses are sharper. Most impressive is the surge of magic coursing through their body, demanding release. The elixir is harmful to Phyrexians; simply holding it made Urabrask wince. Ingesting it provides a modicum of protection against passive phyresis , though heavy exposure will overcome it. Angels can be personally depleted of halo, which can lead to their compleation, and angels on other planes may not produce halo in a way that protects them. In sufficient quantities, it can even restore the corporeal form of a lost angel, as happened with Giada. Elspeth Tirel 's sword Luxior is infused with Halo. Halo can act as preventative against Phyresis , but not as a cure. It impeded the intruders during New Phyrexia's Invasion of the Multiverse . Its relative availability in Capenna kept their defenders safe given their lack of a planeswalker co-ordinating its defense. Then, the final stand against New Phyrexia by the Zhalfirins was supported by a legion of angels, who spread Halo across the Multiverse. Halo is called the last gift of the angels before they left New Capenna. The angels are said to have built New Capenna, but after its completion the demons betrayed the angels, trapping them in a kind of stasis from which they could convert the angels' bodies into Halo. The Demon Lords used Halo to defeat the Phyrexians and then disappeared themselves. The Brokers believe in a so-called \"Doomsday Prophecy\" contained in Nido Sanctuary's vaults, which is said to foretell that when the Halo dries up, New Capenna will fail. The Adversary has been hoarding Halo in an attempt to monopolize, but the Cabaretti have kept the Halo flowing through a new supply that they unveiled during the annual Crescendo celebrations. For Streets of New Capenna , R&D wanted a resource that the various factions could fight over, but weren't interested in it being an illicit drug, so they leaned into the fantasy element to make that substance something that enhanced magic use. The song Halo Rich from the official soundtrack is related to a person about taking Halo. Depicted in: Referred to:"}