{"text": "Hanna was the blonde, and often grease stained, human navigator and engineer of the Skyship Weatherlight . She was born on Tolaria ( Dominaria ). Hanna had blonde hair and bright skin. She was usually quiet and calm, with a natural shyness that some mistook for coldness. She was deeply committed to the Legacy as well as the Weatherlight . Hanna was the daughter of Barrin and Rayne (and therefore a product of Urza 's Bloodline Project ), but decided to leave Tolaria to study artifice at the legendary Argivian University in New Argive . Her self-imposed exile came from the strained relationship caused by her father's desire to see her study magic at the Tolarian Academy . Hanna and Barrin were not on speaking terms for many years as a result. Hanna befriended Orim while at the university, and later the pair joined the crew of Weatherlight . There, she served as the navigator and put her education to use by extensively studying the Legacy artifacts. She also developed a romantic interest in their inheritor, Gerrard Capashen . After the death of their crewmate Rofellos , Gerrard left, leading Hanna to feel abandoned and betrayed by his departure. It was years before they would speak again, but the ember of love rekindled when he signed back on to rescue Sisay . Their first stop was Tolaria to recruit Barrin at Hanna's suggestion. Unfortunately, the pair's long-standing tension led Barrin to suggest his protege Ertai in his stead. The Weatherlight crew wasn't about to accept him untested, and Hanna challenged Ertai to a competition which she ultimately lost, leading Ertai to continue deriding Hanna's precious artifacts, earning him glares and no friends upon the crew. However abrasive Ertai was, he did manage to fix Rath 's location into the Thran Crystal. Hanna and the crew weren't on Rath long before they came to their first major obstacle, The Predator , which assaulted them. During Greven il -Vec's attack, Karn and Tahngarth were captured, and as Gerrard tried to rescue them, he was thrown overboard to the forests below. With the Weatherlight badly damaged, and most of its higher-ranking crew missing, Hanna took charge of the ship with Mirri 's support and landed the ship in the forest below. Hanna's plans extended beyond just fixing the Weatherlight though, and she and Mirri set out to find their mutual love's body (Mirri was also in love with Gerrard, something obvious to everyone but him). Tensions were tight between the women because of Hanna's belief that Gerrard had died, and for the obvious reasons between the two, but an attack by a shapeshifter brought things to ahead. The creature quickly subdued Mirri, but through ingenuity, Hanna managed to defeat the monster. With Hanna's help, Mirri made it to a spring where the two finally bonded. It was to be short-lived, however, as soon after they were ambushed by the Skyshroud elves and taken prisoner. They were brought before the elven leader, Eladamri , but fortunately, Gerrard had not only survived his fall but had also been found by the elves and proclaimed the Korvecdal by the Oracle en -Vec , leading to an alliance between the crew and the rebels. Reunited, the crew returned to Weatherlight to finish their repairs, and with Eladamri's assistance were able to sneak inside the Stronghold while the Rathi rebels made a frontal assault against the fortress. Inside the fortress, Hanna stayed aboard the Weatherlight preparing it for the inevitable flight. When the soltari Lyna appeared to inform her that Ertai had prepared the portal off of Rath and demanded that they leave, Hanna objected, but soon enough the rest of the crew made its way aboard with those injured while in the Stronghold. The Weatherlight crash-landed on Mercadia after departing Rath. Hanna was doing an assessment of the damage when the sudden attack of the Cho-Arrim struck. Stuck off of the ship, she could not help Orim as she was still tending the wounded aboard. With little choice, Hanna continued to plan for the eventual repair of the Weatherlight , but her plans were cut short as she and many other members of the crew were arrested and taken to Mount Mercadia , and Mercadia City atop it. There, Gerrard concocted a plan to escape, only to have it succeed beyond his wildest dreams. The Weatherlight crew began training a force to help recapture their stolen ship, and Hanna went about collecting parts for its eventual repair. Soon enough, their troops were ready to march on the Rushwood . Unfortunately, the Cho-Arrim were not what the crew had expected, and they found Orim alive and flourishing. They attempted to stop the troops they had trained themselves and ended up under arrest once more. Luckily Hanna and Squee had remained in Mercadia City, and with their assistance, the crew escaped along with the Cho-Arrim prisoners, returning once again to the Rushwood. Here, they learned of the myths of Ramos and why the Cho-Arrim had taken the Weatherlight to begin with, believing it to be Ramos come again. Hanna believed that the legendary Bones of Ramos , as well as the Power Matrix , were actually a part of The Legacy. Along with Orim, Sisay, and Cho-Manno , she went to recover the Power Matrix from the Saprazzans while the rest of the crew went to regain the Bones of Ramos. Unfortunately for the group, the Power Matrix was stolen shortly after their arrival, and the women were framed for the crime. Thanks to a quick intercession by Cho-Manno, the real thief was found, but it was too late to regain the Matrix, which had been sent to Mercadia City. The Weatherlight crew soon found themselves under arrest in Mercadia City once again, and Hanna was given the order to integrate the parts into the Weatherlight . Volrath , who had been disguised as a member of the crew, had orchestrated almost everything that the crew had been through in an attempt to arrive at this very moment. The crew proved too versatile though, and they escaped aboard their newly empowered vessel. Exchanging fire with the Recreant , Volrath's personal ship, Weatherlight managed to escape when Ramos himself came to their aid. With the ancient dragon engine 's actions slowing the Recreant , a revolution was then triggered that swept the streets of Mercadia City. Hanna contracted a Phyrexian plague during the first days of the Phyrexian Invasion , and Gerrard tried everything in his power to help her, particularly attempting to use the Dream Halls with Eladamri's help, but to no avail. Soon, Orim devised a cure, but it came hours too late to save her. Multani created a figurehead for the Weatherlight in her honor. When Barrin heard of his estranged daughter's death, he left Urza 's service, then exhumed her body to return it to Tolaria. Reburying her next to his wife, he then razed the island to glass. Yawgmoth later tempted Gerrard with the promise of bringing his beloved back to life, but that was only an elaborate ruse. When Yawgmoth entered Dominaria, he animated and bound to his will all that was dead on the plane, including the souls of Hanna, Rayne, and Barrin. Though not a planeswalker, Hanna traveled through the Multiverse as a crewmember of the Skyship Weatherlight . Dominaria Mercadia Rath During Weatherlight design and development, Melody Alder was put in charge of establishing Hanna's mannerisms and style of speech. Associated cards: Depicted in: Quoted or referred to:"}