{"text": "Homarid is a creature type for cards that depict sapient lobster-like creatures that thrive in cold water. Homarids resemble large, eight-legged, bipedal lobsters between five and seven feet in height, although some homarids are crab- or crayfish-like in appearance, possibly representing different subraces (some earlier card art depicted them with only four legs). Some, such as the deep spawn and viscerid deepwalkers , are much larger and less humanoid. Homarid warriors wield crude clubs or spears made of wood or coral; the later viscerids would remove the shells from their fallen comrades to wear as armor . Homarids appear to have a primitive animistic religion; homarid shamans were known to flood the forests of their elven enemies using elemental magic. Homarid infants are called Camarids . Originally native to the waters of Dominaria 's unnamed antarctic continent, the homarids migrated northward in the centuries after the Brothers' War as global cooling took hold on the world. Eventually, the homarids came into conflict with the merfolk of Vodalia off the continent of Sarpadia , hastening that empire's fall. They also seem to have menaced the elves of Havenwood . In the wake of the Sylex Blast , the tectonic plate extending from Argoth southwards from Terisiare was completely shattered, creating a massive trench running north-south between Terisiare and Sarpadia. After the fall of Vodalia, the homarids discovered this trench, whose cold, dark water provided them a welcome haven and northward migration route. Shortly after the Ice Age ended, the homarids came into contact with the human civilizations of Terisiare. The creatures were named viscerids by the Kjeldorans , as they were first spotted emerging from the Visceral Sea . The viscerids were a minor threat during the Flood Age due to their habit of blocking rivers with makeshift dams and causing widespread flooding, possibly as a means to create inland habitats from which to raid human settlements. During this time, the viscerids were in conflict with the merfolk of Etlan Shiis , who sought to avenge fallen Vodalia, and whose benthic explorers tracked their movements. When Dominaria's climate finally began to warm again, the homarids in the trench between Terisiare and Sarpadia adapted to the rising temperatures. Their presence disrupted deep-sea travel between the northern and southern hemispheres, making travel through the tropics extremely dangerous for merfolk and other aquatic races. The silver-bordered Old Fogey has protection from Homarids."}