{"text": "Ihsan is a servant of Baron Sengir , and was once a Serran Paladin on the plane of Ulgrotha . Lord Ihsan grew up in one of the small towns common throughout the plains of Aysen . When he was just coming of age, he was haunted by dreams and visions of confronting the Baron Sengir in his stronghold, Castle Sengir . Troubled, Ihsan sought someone to tell him what they might mean. In a small market, he found his answers. A soothsayer told Ihsan that his dreams would mean he was likely to be doomed by Baron Sengir. Undeterred by this grim pronouncement, Ihsan devoted his life to becoming a Paladin of Serra , a quasi-military order of knights devoted to the protection of the towns of Aysen, and of the ultimate destruction of Baron Sengir. After serving for many years, Ihsan bravely journeyed to the Castle of the Vampire Lord and confronted the immortal. Lord Ihsan knelt before the Baron and begged that the Sengir make him into a creature of eternity, that the Baron share his power and show Ihsan the true meaning of eternal life. He knew the only way he could defeat the Baron was to gain the strength his opponent possessed, to lull the Baron into false comfort. He would martyr himself for the good of his world, but any price would be worth it to end the Baron's reign of terror. However, Sengir, an experienced immortal, had surmised the young man's plan, that this was Ihsan's motive. The Baron proceeded to drink the lifeblood from the man. While the dying paladin begged to become a vampire, the Dark Baron smiled and spoke the words and incantations of a powerful spell he had learned from Grandmother Sengir , calling upon the magics of the swamps and bogs to fill Ihsan's body. When Sengir stood up and wiped his mouth clean of Ihsan's blood, the paladin was dead, but not undead. The Baron had turned him into a mere ghost instead of a vampire: an impotent, helpless spirit, a puppet under the Vampire Baron's control rather than a being that could fight back and eventually destroy its maker. Binding the Paladin's soul to his signet ring, the Baron ordered Ihsan to stand by his side, to act as his vassal and guardian, the commander of his forces, and companion for all of the days to come. The Baron also told Ihsan that he would never be his creature again, that he would always be the thrall of whoever owned the ring. Ihsan wept and begged for a hundred days, but the Baron paid no heed. Since then, Ihsan has been forced to do many hideous things, but the worst thing he had done was something he had never intended to do. When he confronted the Baron, he showed the vampire that he had become an enemy to unite the people of Aysen, and that they would do anything to rid themselves of his evil. Understanding this, the Baron ceased his constant attacks, acting more subtly to perpetuate his plans, waiting to see if Aysen, without a common enemy, would collapse and turn on itself. The thing that has haunted Ihsan the most in all this time was that the people of Aysen think him a traitor, instead of their savior. The Serra paladins have even vowed to destroy the traitor of their order. Irini Sengir yearns to gain control of the signet ring and to drive Ihsan mad, since, even after many years, Ihsan is still sane. She has not done so, however, fearing her master's wrath. When Leshrac visited the plane around 4500 AR, he saw a great army of vampires, reluctantly led by a giant in armor. Ihsan, Leshrac recognized him as a being once honorable, who has been forced to commit heinous acts. It is unknown if this means that the conquest of Ulgrotha by Baron Sengir is now complete. Depicted in: Quoted or referred to:"}