{"text": "Ikoria (pronounced as Ick-oria ) is a plane that is a \" Monster World\". New Phyrexia begins the invasion of Ikoria at Drannith . Ikoria was a target in New Phyrexia's Invasion of the Multiverse . With no plane of her own to defend, Vivien took to arranging the defense of Ikoira alongside Chevill and Jirina Kudro . The crystals of Ikoria began seeping glistening oil and producing copper oxide growths, but quickly the natural mutations fought against it, granting oil-vaporizing crystals to the defending beasts of Ikoria. Lukka returned to Ikoria compleated, destroying Drannith and scattering its people. However, his assimilation strategy seemed to revolve around personally amassing the monsters into a titanic humanoid monstrosity, limiting its infectious spread. After Lukka's amalgam was vaporized by Vadrok 's flame, more of Realmbreaker 's omenpaths opened to Ikoria. Vorinclex's main invasion force continued the devastation of Ikoria's human culture, but Ikoria's monsters focused their ire upon the invaders rather than the local populace. The ten Companion Legendaries, plus Zilortha, Kogla and Yidaro were amongst the defenders of the plane. Ikoria has five major geographical regions called triomes . Each triome has its unique terrain, a dominant clade of monsters, and a fearsome apex monster. The triomes came into existence due to the unique flow of magic through the land of this plane. Each region is the result of three distinct types of mana mixing. Savai consists of grassy plains atop mountainous cliff faces and swampy subterranean tunnels. Its dominant clade is cats and it is home to the apex monster Snapdax. In the lowlands of Savai lies Drannith , the largest human sanctuary on the plane and a thriving city with tens of thousands of residents. It also boasts an incredible military force that defends the city. Ketria consists of rivers and waterfalls that wind through crystalline forests and cascade down mountainsides. The dominant clade is elementals and it is home to the ethereal monster Illuna. Indatha consists of swampy pools within lowland plains, dotted with uniquely shaped trees. The dominant clade is nightmares and it is home to the death-dwelling monster Nethroi. Many generations ago, there was once a walled sanctuary in Indatha called Orn . One night, nightmares breached the gates under cover of darkness. Some residents built hot-air balloons to escape and, over time, more and more balloonists joined their vessels together, forming what's now known as Skysail . The residents of Skysail now use their mobility to avoid or mislead the monsters rather than directly fight them. Raugrin consists of volcanic mountains surrounding white-sand beaches along the coastline. The dominant clade is dinosaurs and it is home to the existence-erasing monster Vadrok. Lavabrink is a sanctuary city tucked under a huge volcanic shelf in the Ongra Range in Raugrin, where lava runs into carefully maintained canals and floodways, running out to Kauld, the lava lake. Its survival strategy is to become inaccessible, as the lava protects the city. The city is also known for its expertise in blacksmithing, metalworking, toolmaking, and sculpting, and therefore possesses the best weapons on the plane. Zagoth consists of teeming rainforests with vast lily pools and swampy wetlands. The dominant clade is beasts and it is home to the long-lived monster Brokkos. Crystals are a natural part of Ikoria's landscapes. These crystal formations are not well understood by both city dwellers and bonders, but they are known to power the growth and evolution of monsters. Throughout a monster's lifetime, it can grow, warp, and change into new forms. Some monsters simply become bigger or more powerful. In other cases, they may gain entirely new traits, like wings, extra limbs, feathers, or even extra heads. Some monsters mutate into hybrids, blending characteristics of multiple monster clades. The fear of mutated monsters is so high that in sanctuaries, humans are forbidden to even keep household plants. Many of Ikoria's crystals flare when monsters are near, and city-dwelling humans have learned to utilize them as an advanced warning system. Large crystals the size of buildings are built into the architecture of many human sanctuaries. Smaller crystals are often incorporated into military uniforms, to serve as monster-detection devices as well as to designate rank and specialty. Magic employed by the military's mages often mirrors the shapes and refracted colors of the crystals that are found in or near their sanctuaries. The crystals are nodes in the natural energy network of the plane, and the larger the crystal the more powerful the node and its draw. Bonded monsters can communicate with each other through crystals. An unnamed planeswalker, known for his meddling, changed something in the Ozolith , one of the biggest crystal formations of Ikoria. It made the monsters go mad and caused rapid mutations. While it was broken during Sundered Bond , the remnants still accelerated the monsters' growth. Monsters on this plane are everywhere. They come in all shapes and sizes, from terrifying, city-stomping behemoths to clever small beasts . Skysharks soar over herds of lumbering goriaks, winged foxes flit through crystalline forests, and brooding nightmare creatures emerge from the shadows to hunt the unsuspecting. Each possesses power beyond comprehension. On top of this, they are liable to mutate into something completely different from one moment to the other. Humans are the only \"civilized\" species to have survived on Ikoria, occupying a precarious midpoint in its monstrous food chain. They owe their resilience to a variety of strategies that have allowed them to elude extinction for generations. Most of them choose to live inside protective sanctuaries. These communities range from small wilderness outposts to massive walled cities, and each employs a combination of techniques to ward off monster attacks (both physical and magical). Bonders are humans that established an eludha , a deeply mystical bond with a monster. The eludha ties the spirit of the bonder and the monster together, helping them evolve and become stronger. Bonders are hated by the \"civilized humans\" and are considered traitors for aligning themselves with the monsters that threaten the human cities. Bonders often wear colors, clothing, or items to resemble their bonded monster. Like the increased mutation rate, intelligence, and aggression among the monsters, bonding is only a recent occurrence on Ikoria. It is caused by an unnamed planeswalker's meddling with the Ozolith . There is a sanctuary that reveals itself only to those graced by the eludha. Born from fear and malice, these individuals hunt the beasts for profit, due to a vendetta, or only for sport. Some are foreigners who had drifted to Drannith because the Coppercoats paid good bounties. Others were those whose temperament made them ill-suited to military life, which was a more polite way of saying “criminals and madmen\". Hunter bands often spent as much time fighting one another as they did hunting monsters, hence the emphasis on intimidating masks and other forms of bravado. While human cities rarely reject the presence of hunters, they are viewed with mistrust by their civilized counterparts. Most hunters use magical or physical traps to capture a monster and are easily recognized by their equipment: goggles, helmets, or visors. Ikoria's nonhuman inhabitants include a variety of species, but unlike most other planes the members of these species mutate and incorporate other creatures, creating amalgamations of numerous creature types. Humans Apes Cats Elementals Elephants Nightmares Dinosaurs , uniquely multicolored solely within this range rather than with Raugrin colors ( ) Beasts Goats Birds Sharks Leviathans Demons Turtles Insects Otters Spiders Hydras Hyenas Wolves Foxes Unicorns Gremlins Monkeys Brushwaggs Faerie Dragons Lizards Mice Represented in: Associated cards: Referred to: Chris Mooney (April 2, 2020). \" Planeswalker's Guide to Ikoria \". magicthegathering.com . Wizards of the Coast. Meris Mullaley (April 7, 2020). \" Worldbuilding Ikoria \". magicthegathering.com . Wizards of the Coast. Kendall Pepple (May 14, 2020). \" Monsters of Ikoria Art Descriptions \". magicthegathering.com . Wizards of the Coast. Kendall Pepple (May 15, 2020). \" Humans of Ikoria Art Descriptions \". magicthegathering.com . Wizards of the Coast."}