{"text": "The Immortal Sun is a powerful item once hidden in Orazca , an ancient metropolis hidden in the uncharted jungles of Ixalan . The Immortal Sun is rumored to be more valuable and powerful than any other artifact in existence, promising boundless wealth, the strength of the empire, command over nature, and eternal life. The history of the Immortal Sun is a history of its misuse by mortals. The massive stone slab was created ages ago by the ancient sphinx planeswalker Azor . Azor was in league with the Spirit Dragon with whom he had created a plan to trap the nefarious Nicol Bolas on Ixalan. Though the artifact has powerful magical properties (intended for its guardians to keep it safe), its main purpose is to prevent planeswalkers from leaving Ixalan. Azor created the Immortal Sun by imbuing it with his planeswalker's spark , thus trapping himself as well. When it is activated, the Immortal Sun generates immense heat. When stood upon, the active Sun provided god -like powers. The Immortal Sun once belonged to the kingdom that would one day form the vampiric Legion of Dusk on the continent of Torrezon , where it was kept in a hidden monastery. The power of the artifact inspired the envy of its neighbors and soon, hostile forces under the leadership of Pedron the Wicked attacked the monastery. The Sun was taken by Azor and he brought it across the sea to the continent of Ixalan . When the Sun Empire was in possession of the Immortal Sun, they built the incredible city of Orazca and ushered in a new age of prosperity and growth for their people. The Immortal Sun was embedded in the floor of the highest chamber of Metzali, Tower of Triumph . Eventually, one of their emperors used it for evil purposes. As a consequence, Azor caused the Empire to leave the city. The city itself was hidden, overgrown by the jungle. The merfolk River Heralds were then tasked by Azor to defend the Golden City and the Immortal Sun. They believed that no one should control its power. To protect its secrets, they only knew the city's general area, but not the exact location. They had been making sure no one would get there for centuries. Much later, the vampires of the Legion of Dusk came to the continent of Ixalan to retrieve their possession. They prayed its power would allow the hopes of the church to be fulfilled and eternal life would be available to all without the need to subsist on the blood of the wicked. Meanwhile, the Brazen Coalition also sought this ancient prize. They thought it might be the key to returning to Torrezon and driving out the Legion of Dusk to reclaim their ancestral lands. One of the merfolk's own, Kumena , had gone against the wishes of the rest of his people and went in search of the artifact himself, hoping to use it to kill the outsiders. Simultaneously, the warrior-poet Planeswalker Huatli was tasked by the Emperor to reclaim the Golden City for the Sun Empire. Huatli temporarily joined up with the merfolk Tishana , to prevent Kumena from gaining control over the Immortal Sun. In the race for Orazca, the planeswalker Angrath joined the fray, as well. Finally, another planeswalker, Vraska , was tasked by Nicol Bolas to retrieve the artifact for his nefarious purposes off the plane of Ixalan. She travelled together with Jace Beleren , who had lost his memory because of the battle he and the Gatewatch had with Nicol Bolas on Amonkhet before arriving on Ixalan. Kumena was the first to reach the Sanctum of the Sun . He awoke the city and the creatures within but was bested shortly after by the combined efforts of the vampires Vona and Mavren Fein . They threw him out of the window of the Tower of Triumph, but he was saved in time by his former teacher, Tishana. Tishana and Huatli started fighting with the vampires but were interrupted by the Siren pirate Malcom , who drew them out of the room they were fighting in. The song ended and Breeches (a goblin pirate) started slashing at Vona's face and eyes. Then, Angrath interrupted them all by barreling through the room they were just in. He had killed the dinosaur that Huatli had used to push him into the dirt. He swung his chains at Breeches, who was pulled towards Angrath. Then, everyone scrambled to touch the Immortal Sun. Tishana put her hand on it, Huatli put her foot on its side, Angrath stomped on the object's center, while Vona, who had just been touching it, put both hands on it once again. A current of energy rushed through them all and Huatli laughed at how good it felt. After Vraska found the Immortal Sun, she summoned Bolas ' henchman Tezzeret . Tezzeret used the Planar Bridge to spirit the Immortal Sun off the plane. It was revealed that Bolas planned to use the Immortal Sun in his plot to invade Ravnica . Bolas used the Immortal Sun to trap many planeswalkers on Ravnica after they had been lured there by the Interplanar Beacon , to harvest their sparks. Chandra , Nissa , Saheeli , and Lavinia (plus Lazav ) were tasked with shutting off the Immortal Sun. At New Prahv , they managed to do so after defeating Dovin Baan , which resulted in a lot of planeswalkers fleeing the plane. Jace had taught Chandra Azor 's nine words that would shut off the Sun, that he had dug up from the sphinx's mind. Chandra managed to shut it off with the spell after being briefly possessed and overcome by its power. Afterward, before the final battle with Bolas, they decided to reactivate the Immortal Sun to prevent Bolas from escaping. The Immortal Sun was returned to an inactive state at the very end after Bolas was defeated, but it was not destroyed in the event that it's needed again. The artifact was still intact after the War. The planeswalkers discussed antagonists that it could help defeat. Vivien specifically brought up Liliana . New Prahv was severely damaged during New Phyrexia's Invasion of the Multiverse after Vraska directed Realmbreaker to attack the Azorius guild hall and the jail in which she had once been imprisoned. The status of the Immortal Sun is unknown. Depicted in: Quoted or referred to:"}