{"text": "The Implicit Maze is a system of mana paths or leylines through the guildgates and districts of Ravnica that has manifested after the Guildpact was destroyed. At the end of the maze in the Forum of Azor lies great power. The pattern connects arcane landmarks of all ten guilds and extends in more than two dimensions. It is a code that was carved into the foundation of the entire city when it was built. The maze houses many elementals . On instruction of Niv-Mizzet and using Jace Beleren 's notes, it was discovered by Ral Zarek . The maze was created by Azor I to be revealed in case the Guildpact dissolved. In this way, the founder of the Azorius Senate tried to foster an atmosphere of peaceful collaboration. In order for it to be solved, all the Ravnican guilds must transverse it at the same time. The purpose of the maze was to determine if a new guildpact could be formed, and to determine what shape it would take if possible. However, if any of the guilds did not seek harmony with the others, Azor created the failsafe that would give the runners access to the Supreme Verdict which would eliminate the guilds in their entirety before their unfettered desires led to a war that might destroy the plane. Niv-Mizzet announced that each guild would have to send one champion as its delegate in the running of the maze. At an appointed time, the champions met at the Transguild Promenade , and embarked on a race through the twists and turns of the maze. The Maze runner who triumphed would gain the power behind it for their guild. Others were prophesied to fall to its dangers. Jace Beleren entered the race as an unexpected factor. When he reached the Forum of Azor, all the maze-runners were assembled and attacking each other. He managed to stop them momentarily, but Lazav appeared and manipulated the champions into fighting once more. The bailiff of the Forum appeared and seeing the situation, delivered the Supreme Verdict, that was to give every runner the ability to activate it. Jace connected the ten minds of the runners together to prevent any from casting the verdict. He had merged their minds, letting them peer directly into each other's thoughts, but also unraveling his own mind in the process. Fortunately, the bailiff assisted him, easing the burden he had put upon himself. In doing so, the Bailiff had declared Jace the new Guildpact , the mediator who could understand the perspective of each of the guilds. After the guild summit failed in the build-up to the War of the Spark ,  Ral Zarek proposed to construct artificial lines of energy to alter the design of the Implicit Maze, in order to alter the Guildpact that it substantiated. It was to be a machine that spanned the Tenth District , enabling the ascension of Niv-Mizzet to Living Guildpact without the consent of all the guilds . Associated cards: Quoted or referred to: The Implicit Maze is referenced in the title of Dragon's Maze . A cardboard version of the Maze was used as a gimmick during the prerelease of that set. Adam Lee (April 17, 2013). \" Barrin's Tall Tale \". magicthegathering.com . Wizards of the Coast. Gatecrash: The Secretist, Part Two by Doug Beyer"}