{"text": "Indrelon , also known as the Magic Mirror , is a legendary magical artifact found on the plane of Eldraine and the true leader of the court of Vantress . Its true name is known only in the court of Vantress while most others just know of it as the Magic Mirror. Legends say that in ancient times the world's most foolish redcap asked a question of the world's wisest sage. It is said the sage reflected on this question for the rest of his life but never found an answer. Following the sage's death, the question magically remained, swirling in on itself forming the Mirror. The question is still unknown to all but the Mirror itself, but even to the present day it still sends loremages and knights out on quests to gather mystical secrets so that one day it might piece together the answer. It is currently located far under Castle Vantress . The Castle rises like an island up from a mist-shrouded lake in a remote part of the realm called Lochmere. It is built on top of a large shaft that is normally full of water and at the bottom of this shaft is a dim, cave-like space where the Magic Mirror rests. An aspirant knight must tell the Magic Mirror a secret it did not already know and at the Mirror's inscrutable discretion, it may bestow the gift of knighthood. In return, the knights often continue to seek out new secrets for the Mirror. The mirror rewards the virtue of knowledge in all who come before it with the granting of knighthood being the most common reward, but even established knights continue to bring new secrets to the Mirror in the hope of winning additional rewards in the form of magical boons and powers. Similarly, merfolk who have no aspirations to join the court of Vantress come before the mirror in the hope of learning some of its secrets. The full extent of the Mirror's power is not known, but the scope of its knowledge is undeniably vast. Following New Phyrexia's Invasion of the Multiverse , the mirror was moved by Gerra Grandsquall from Castle Vantress and ended up in the bedroom of the giant Beluna Grandsquall in Stormkeld. Indrelon is a reference to the Magic Mirror from the Snow White fairy tale. Associated cards: Depicted in:"}