{"text": "Innistrad is a plane .  It takes its inspiration from Gothic fiction set in 18th and 19th century Germany and Eastern Europe . The plane is primarily populated by Humans but these live in fear of several classical creatures of horror and regularly fall prey to Zombies , Werewolves , Vampires , or Ghosts . Further, Demons are becoming an ever-growing threat. It is the plane where the Innistrad block takes place. Life on Innistrad is dominated by the single moon in its sky. Though the inhabitants of the plane know little about it, the moon drives the seasons and also the hunting patterns of the monsters, harvests of the Humans, etc. Human society is dominated by religion with the Church of Avacyn promising protection from the evils that lurk in the night. The church is named for an Archangel who helped to drive back the monsters that preyed on Humans. When she went missing, the power vacuum created was rapidly being filled by Demons. A secret cult of Demon worshipers named Skirsdag also emerged from this. When Avacyn was released from her prison, the Helvault , she rallied her troops to contain the Demonic threat and, ultimately, to cleanse Innistrad of all these infernal creatures. The common currency on the plane is gold sovereigns (gold coins stamped with Avacyn's collar surrounded by laurels), silvers, and coppers. Two to three gold sovereigns can feed a family for several weeks. It is also the birthplane of the famous Vampire planeswalker Sorin Markov . Innistrad was also home to other native planeswalkers, like the half-devil Tibalt , the deceased Vronos , and the Werewolf Arlinn Kord . More than 6000 years before the Great Mending , an aging human alchemist named Edgar Markov was experimenting with ways to achieve agelessness for himself and his family. When famine was sweeping the land, the demon Shilgengar convinced Edgar to start experiments with blood. Markov and his sons trapped the angel Marycz in his laboratory and exsanguinated her, prepared a decoction from her blood, and created a ritual that caused his subjects to feed on the blood of other beings. It provided sustenance to those few, but the demand for blood also culled the overall population, reducing the number of hungry mouths to feed. However, when he forced his grandson Sorin to turn, the trauma of the transformation caused the boy's planeswalker spark to ignite, sending Sorin away from the plane and his grandfather for the first time. However, worried about the state of his homeplane, he would frequently return to visit his home. Avacyn, depicted in an avatar for Magic Online Avacyn Restored Release Events Over the centuries, as vampires spread further into human lands, Sorin spent more and more time away from his homeworld, sometimes disappearing for years at a time. Vampires became disdainful of the race from which they had spawned, hunting mortal humans more and more boldly, and Sorin became distant from his lineage. From his world-hopping perspective, he could see the changes happening within his homeworld. As the vampires gained more and more power, the humans were being driven further and further back, suffering under the boots of his grandfather's legacy, and it would only be a matter of time before the vampires wiped out their former kin. When confronting his grandfather with this newfound knowledge, Edgar brushed it aside, saying they had eternity, or close to it, to find a solution. For humanity to survive and to keep vampires from cannibalizing each other once humanity perished, Sorin committed an act that forever marked him as a traitor to his race: Borrowing from long-held beliefs about the moon and the afterlife, Sorin forged a warrior who could hold back the vampires and other threats that threatened the extinction of humanity on Innistrad. He named this creation Avacyn and tasked the angel with protecting the plane in his absence. Through her, the magic of faith would create true power to fend off the darkness. She was half of the protective measure he created to protect Innistrad. The other half was the Helvault . The Church of Avacyn was born from Sorin's act, and while some of the vampires understood, most reviled him as a traitor. Unknown to Sorin, the Eldrazi stirred on Zendikar, but Nahiri had to deal with the situation alone. When she later came to Innistrad, Sorin explained that her signal for help had likely been absorbed by The Helvault, but displayed no remorse for his oversight. When Nahiri confronted him with the gravity of his mistake, Sorin became offended and angrily reminded her of who raised her as a planeswalker and advised her to pester Ugin, instead. Nahiri saw this as a betrayal of their bond and chose to physically threaten Sorin. This resulted in Avacyn 's intervention, who felt the threat that Nahiri posed to Innistrad. The two clashed until Sorin called the battle off and banished Nahiri into the Helvault. The demon Griselbrand eventually came to the Helvault , defiantly challenging Avacyn to combat. The two battled for days, out of view of all but Avacyn's host, the Lunarch, Mikaeus , and his most trusted bishops. Finally, in an act of desperate effort, Avacyn used all of her remaining strength to drive Griselbrand into the Helvault. However, as his final act, Griselbrand threw his spear and impaled his angelic nemesis. The binding spell backlashed as she was impaled, and Avacyn became imprisoned in the Helvault alongside every other demon that had been trapped within. The angel's disappearance endangered the humans of Innistrad and shattered the carefully-constructed balance between humanity and the creatures of the night. Avacyn restored Liliana Vess visited Innistrad in the hopes of destroying Griselbrand , with whom she had made a demonic pact that would result in her soul's enslavement. To this end, she opened the Helvault by forcing an ultimatum on Thalia , its guardian: either she'd destroy the rock, or her soldiers would die. This resulted in the release of both the demons and Avacyn, restoring mankind's defense against the darkness. In the aftermath of her return, Avacyn led Innistrad's humanity into a time of prosperity and peace that lasted roughly a year. After her return, the people of the remote village of Gatstaf appealed to Avacyn for aid in breaking the lycanthropic curse. Avacyn appeared to them in Gatstaf Grotto, where many had gathered to strike down what they saw as their scourge. Avacyn's message was short and simple: she could not break the curse of lycanthropy. The curse mingles the human spirit with the spirit of the wild, and the wild spirit could not be destroyed without also destroying the werewolf's humanity; those afflicted with the curse would forever have it. However, Avacyn offered the Gatstaf werewolves a special place at her side. If they promised to serve as guardians of humanity, she would transform their curse, fusing the two warring aspects and allowing them to dwell in the light of her blessing. The lycanthropes at the Grotto accepted her offer, and she transformed them into the wolfir . In a powerful wave of spells that would become known as the cursemute , Avacyn's magic spread through the plane, transforming many werewolves and many of the world's foul curses. The wolfir emerged as a new race of great wolf creatures dedicated to the principles of the Church of Avacyn. However, some of the afflicted humans were fully cured and allowed to lead normal, non-hairy lives. Emrakul arrives on Innistrad When the Helvault broke, Nahiri fled back to Zendikar, only to find the Eldrazi unleashed, continents laid to waste, and her allies seemingly having forsaken her. Enraged, she swore vengeance against Sorin, vowing to make Innistrad bleed in the same way Zendikar had suffered. She attacked Markov Manor , destroying it with lithomancy and imprisoning its vampires in a state of perpetual agony within its walls. While active on Innistrad, people turned to worship her, some ironically believing her to be an ancient vampire. She created cryptoliths across Innistrad, using them to channel Innistrad's leyline energy to summon Emrakul to lay waste to Innistrad as the Eldrazi had laid waste to Zendikar before it. As the focal point for summoning, she built the Drownyard Temple with help from Gisa 's ghouls . Upon his return, Sorin found Markov Manor in ruins, twisted into impossible shapes, its inhabitants embedded in the masonry. Nahiri had left this declaration in stone as a warning of her vengeance. Realizing his past had come back to haunt him, he hoped to gather the aid of the other vampires to confront the threat to Innistrad. A difficult task, because he was shunned by his kind. His search brought him to the remote estate of the powerful Olivia Voldaren , to entreat her aid in calling the bloodline. After failing to help Avacyn, Sorin was left with no choice but to unmake his beloved creation To secure the help of the other vampires in battling Nahiri and reclaiming Markov Manor, Sorin reluctantly agreed to destroy Avacyn. He was just in time to save Jace Beleren and Tamiyo from being overcome by Avacyn in Thraben Cathedral . Though, when he saw Avacyn was intent on their destruction, he politely offered to let her kill them before they had their talk. Upon speaking with his creation, he saw the depths of her madness and how Nahiri had turned his most precious creation against him. And despite the deal Sorin had made with Olivia Voldaren, he initially tried to reason with his angel, to take her down to the cathedral's cellar, where he could cleanse her mind of madness. Avacyn, in a moment of lucidity, blamed him for what happened, for having her made weak and corruptible so that she could be turned against the innocent. She condemned him as Innistrad's greatest evil, believing that he, her creator, was responsible for everything that she could do, and therefore was responsible for her madness. They fought a battle that nearly tore the cathedral apart. In the end, Sorin overpowered Avacyn, draining her blood and slamming her body through the chapel floor, all the way down to the cellar. There, he once again pleaded with her, offering to make her anew and cleanse her mind. But whether due to her madness or a personal revelation about her nature, Avacyn refused, stating that \"If I am not the daughter you want...then we must battle again, and again, forever. For I will never yield. I am no monster's instrument. I will not be altered by the likes of you.\" And so, one thousand years after creating Avacyn to maintain the balance between humans and the supernatural, Sorin was forced to unmake his corrupted guardian in the same spot where she was born. Head bowed with anguished regret, he looked away as he dissipated his progeny into an ashen cloud. With Avacyn's destruction, the last of Sorin's magical protections woven over Innistrad was broken. Nahiri imprisoned Sorin in stone prison With Avacyn gone, Jace tried to speak with Sorin about why he had destroyed Avacyn. But as Jace spoke, Sorin suddenly realized what Nahiri had been doing and that he had played right into her plan. Promptly, Emrakul arrived on Innistrad. Sorin and Olivia assembled a vampire army and went to war against Nahiri, while Liliana Vess tried to save the populace with a zombie army. Sorin and Nahiri battled in Markov Manor, where he was bested by the Lithomancer and encased in stone. Nahiri planeswalked away, leaving Sorin to watch Emrakul devastate Innistrad. Olivia Voldaren then taunted Sorin by proclaiming herself the new lord of Innistrad. She relieved him of his sword, leaving him to his fate. In the end, the Archangel Sigarda took control over the uncorrupted angels who stand watch over humanity, while Emrakul was banished into Innistrad's silver moon. Around two years after the Travails, and Emrakul's defeat and sealing, the Eldrazi Titan's direct influence on the plane started to wane. However, when Emrakul entered the Innistrad Moon , the day/night balance of Innistrad was disturbed. With the sun rising later and setting sooner each day, and the days getting colder, Werewolves went mad and tried to take control of the plane. With the unnatural darkness came too a weird magical frost that started covering the world. Left without Avacyn, the Humans of Innistrad started to focus on more ancient and traditional means of protection, such as sorcery. Fearing the Eternal Night , the citizens turned to the hope of the Harvesttide festival and a ritual with Warlocks of the Dawnhart Coven to restore the balance. During that period, the fallen archangel Liesa was resurrected, amassing a new flock. The Dawnhart ritual was disturbed, first by Werewolves, and then by Olivia Voldaren . The Eternal Night commenced, plunging all Humankind into despair. In the dark, the Vampires of Stensia started to collect daily blood tithes from the Humans. To cement her victory, Olivia sought to take control over the vampiric bloodlines by marrying the charmed Edgar Markov , uniting the most powerful bloodlines under her control and thus being able to overtake Innistrad. Furthermore, she captured Sigarda and planned to utilize an ancient artefact, the Moonsilver Key , combined with the archangels' blood, to take control over the angelic flights. Her plan was foiled when the spirit of the head of the Dawnhart Coven manifested and broke Sigarda's confines. This disrupted the wards of Voldaren Manor and allowed the planeswalkers of the Gatewatch to intervene. Olivia was forced to relinquish the key and flee for own life. The key was delivered to the coven, who managed to finish the ritual and caused the Eternal Night to end and the sun to rise again, ending Olivias' scheme. After the balance of night and day was restored, Teferi warned Arlinn to watch out for \"mechanical creatures.\" She and Sorin worked together to protect Innistrad, preparing it for a possible Phyrexian invasion. Eventually Innistrad was invaded by New Phyrexia. Thalia and the Gitrog monster became allies while Gisa and Geralf Cecani defeated a powerful Phyrexian invasion force attacking Havengul. As the glistening oil first affects the living mind, Innistrad's zombies were immune to phyresis, making them crucial to the plane's defense. Phyrexians, conversely, resisted both ghoulcalling and stitching. Nonetheless, thousands were killed across the plane. Coat of arms of Innistrad's four provinces. Concept art by Richard Whitters The mainland of Innistrad is split into four provinces called Gavony , Kessig , Stensia , and Nephalia , with much-unexplored wilderness lying beyond these provinces. Beyond the great seas, other continents are rumored to exist that harbor exotic species of lycanthropes. An Innistradi forest An Innistradi village Gavony High City of Thraben Tree of Redemption The Helvault Moorland Trostad Nearheath Videns Wittal Effalen Estwald Hanweir Kessig Ulvenwald Lambholt Hollowhenge Devils' Breach Stensia Somberwald Ashmouth Needle's Eye Nephalia Drunau Havengul Selhoff Unknown province Heron's Grace Orphanage Ollenbock On Innistrad, there are five tribes ; major creature types that also play a role mechanically. Each tribe is linked to an allied color combination. Humans : Humans occur in all colors but are dominantly aligned with white and green. Humans represent the victims of the other tribes and monster hunters. White aligned is isolated from the other tribes and colors in terms of mechanics and cycles. Innistrad was the first set in which Humans are treated as a tribe. Spirits : Spirits occur in white and blue, and sporadically in other colors. White spirits represent guardian spirits and blue spirits are ghosts. Zombies : Zombies occur in black and blue. Blue Zombies (or Skaab ) are tied to mad scientists, while black Zombies are more oriented to graveyard recursion. Vampires : Vampires occur in black and red. Some black creatures are double-faced cards, but many others have the \" Slith \" ability: they get a +1/+1 counter when they deal combat damage to a player. In the Shadows over Innistrad block, they are the tribe most associated with the Madness mechanic. Werewolves : Werewolves occur in red and green. Every Werewolf is a double-faced card with the transform mechanic. Until Eldritch Moon , one side of each of the Werewolf cards was a Human Werewolf, however, Eldritch Moon saw several Werewolf creatures that started as Werewolves conscripted by Emrakul and transformed into Eldrazi. Some of these conscripted werewolves came together and formed a pack known as the Dronepack. Common Innistradi The one or more languages of The Buried Lord 's tomes. Associated cards: Referred to: Magic Creative Team (August 24, 2011). \" A Planeswalker's Guide to Innistrad: Introduction \". magicthegathering.com . Wizards of the Coast. Jeremy Jarvis (September 5, 2011). \" Creating the Art of Innistrad \". magicthegathering.com . Wizards of the Coast. Doug Beyer (September 07, 2011). \" Champion of the Parish \". magicthegathering.com . Wizards of the Coast. Doug Beyer (September 21, 2011). \" Postcards from Innistrad: The Nonbasics \". magicthegathering.com . Wizards of the Coast. The Magic Creative Team (September 27, 2011). \" A Planeswalker's Guide to Innistrad: Gavony and Humans \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (October 05, 2011). \" A Planeswalker's Guide to Innistrad: Kessig and Werewolves \". magicthegathering.com . Wizards of the Coast. Doug Beyer (October 12, 2011). \" Costuming \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (October 19, 2011). \" A Planeswalker's Guide to Innistrad: Nephalia and the Undead \". magicthegathering.com . Wizards of the Coast. Ryan Miller and Team (October 24, 2011). \" The Cursed Blade \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (November 02, 2011). \" A Planeswalker's Guide to Innistrad: Stensia and Vampires \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 02, 2012). \" In These Desperate Times: A Backstory Update for Dark Ascension \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (January, 2012). \" The Worlds of Dark Ascension \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 11, 2012). \" Sorin's Homecoming \". magicthegathering.com . Wizards of the Coast. Jenna Helland (January 16, 2012). \" Preview Article: Mikaeus, the Unhallowed \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 18, 2012). \" The Prison of Silver \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 25, 2012). \" The State of the Faith \". magicthegathering.com . Wizards of the Coast. Doug Beyer (March 21, 2012). \" The Guardian, the Witch, and the Angel \". magicthegathering.com . Wizards of the Coast. Doug Beyer (April 09, 2012). \" Angel's Rise and Demon's Release \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (April 11, 2012). \" Planeswalker's Guide to Avacyn Restored: Part 1 \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (April 18, 2012). \" Planeswalker's Guide to Avacyn Restored: Part 2 \". magicthegathering.com . Wizards of the Coast. Doug Beyer and Ari Zirulnik (September 9, 2021). \" Planeswalker's Guide to Innistrad: Midnight Hunt \". magicthegathering.com . Wizards of the Coast."}