{"text": "The Inventors' Fair is a month-long event that was held in Ghirapur to celebrate the myriad inventions of the Great Aether Boom. It drew inventors and fans from across the world and featured expositions of artifice in a variety of fields. The true purpose of the Inventor's Fair was to gather all the new technology developed by the Kaladeshi to test and license them for broad use. Many of the city's newest buildings are both serving as functional spaces and have been submitted to the Fair's architecture division. They contain graceful arches, orbiting lighting, and mechanized displays of Artani Hall. And also contain brilliant designs of tracks, stages, and arenas for the races and demonstrations. The Inventors' Fair will award prizes to innovators competing in the often abstract and theoretical field of aether science. The Enlighted Keepers of the Consulate have put out a call for Kaladesh's greatest minds to present their findings in the areas of New Refinement Methods, Enhanced Power Extraction Techniques, and the reality-bending concept of Alternate Means of Matter Transportation (Teleportation). Demonstrations of a variety of new weaponry will take place under careful supervision and strict regulation. Judges will assess all kinds of weapons, from massive aether projectors to small, personal construct-mounted devices. Categories include Long-Range, Personal Defense, Aether-Firing, Vehicle-Attachment, and Construct-Attachment. The hundred-acre interactive \"zoo\" is not stocked with natural animals, but with marvelous constructs designed to mimic the wonders of nature. This magnificent park is in the heart of Greenwheel. Visitors of every age are allowed. Vehicles of all kinds compete both in their novelty of design and their performance in races. The races are the most popular events of the fair and sell out months in advance. The inventors fuel their creativity with unrestricted aether access. Whether they're a backyard tinkerer or Consulate designer, they can get out their products in front of the eyes of the public. The benefactor looking for the next big investment. They will be competing with each other every bit as fiercely as the Fair's inventors. For the right invention, offers can be high. The Inventors' Fair judges are of the highest quality, chosen for their experience, acumen, and prestige. And they have all come here hoping to be awed and amazed. It's to the inventors to win over the hearts and minds of these esteemed judges. In exchange, the most talented inventors will receive recognition and honor that will send their careers soaring. The judges are recognized by their red-painted faces. The Consulate expects to see people from all across Kaladesh arriving in droves for the chance to partake in what promises to be the most thrilling spectacle of the century. The schedule is packed from dawn to dusk daily. Head Judge Tezzeret announced that the elvish artificer Rashmi won the Inventor's Fair with her teleportation device. During the grand finale, he was about to execute Renegade Prime, Pia Nalaar , in a quicksmithing duel, until he was interrupted by the arrival of the Gatewatch . Afterward, the Consulate forces confiscated the inventions and took the participants into custody. Associated cards: Referred to: Discover Kaladesh — Wizards of the Coast"}