{"text": "The Invocation of the Founders was a powerful spell that the Founder Dragons had used to create the University of Strixhaven on Arcavios . The invocation held the power of the five elder dragons , all meshed and melded together to construct the school and safeguard it from harm. When New Phyrexia's Invasion of the Multiverse started, the Phyrexians quickly burned through the defenses of Strixhaven. Professor Vess tasked a small group of surviving students - Quintorius Kand , Zimone Wola , Rootha Squallheart , Dina and Killian Lu - to search for the Invocation of the Founders in the Biblioplex. The invocation felt and emitted traces of itself in the form of motes like dust through a sunbeam, pale blue and frail. The closer the students came, the more they lost their fatigue and despair. They eventually found a circular platform surrounded by a moat. Bobbing at the platform's center was a tangle of light like no spell they had seen before. It was a prismatic confusion of letters so dazzling they warded off Phyrexia's grasp entirely. Sentences looped out, sank back down, and reformed with new clauses and phrases. Single words burst like bubbles on the surface. Quint found out that the words weren't intangible constructs of pure magic, but that they felt like warm silk threads against his skin. He concluded that the invocation was alive. As the student prepared to cast the spell, the invocation unknotted, rearranging itself into neat segments. It now looked like a five-petaled flower, each petal a seamless blend of two colors. The muddled words reformed into recognizable sentences. They realized that they had to follow the elder dragons' example and read all five parts together. The invocation simply described Strixhaven: how the ground had this consistency, how the clouds moved and the air ebbed around the school, how the sun heated the school's roofs and lawns, and where the aquifers were. Dina chronicled the flora: where they grew, how they died, and the new life they fed. Through it all twined Killian's portion, cajoling the separate parts together as their words rose in pillars of light. They told Strixhaven what it was, and in that telling, there was no room for Phyrexia. As the spell was nearly done, Rootha was distracted by the arrival of Dean Nassari , and her part of the spell deteriorated. Instinctively, Quint reached over and grabbed Rootha's petal. It was impossible to speak two parts at once. Instead, he poured magic directly into Rootha's petal and powered the invocation with his life alone. The pillars of light flared brighter than ever. As the spell resolved, the Biblioplex buckled and broke, crashing down as the light held Quint captive in midair; the stones of Strixhaven's outlying buildings came apart like sugar cubes in tea; the invasion portals crumpled; and the Invasion Tree 's branches thrashed as the sky tried to close in on itself. Though Strixhaven was in ruins, the main wave of compleated professors and other Phyrexians was obliterated by the spell. The surviving students and deans were able to regroup, under the leadership of Professor Vess. When the group of casting students was found under the rubble, it seemed that Quintorius Kand had vanished ."}