{"text": "Ixhel is a Phyrexian angel from New Phyrexia , made by Atraxa as a weapon. In turn, she was the creator of Vishgraz . Ixhel, similar to her creator, has four arms, wings covered in veins, and a whiplike tail. As a Phyrexian of the Machine Orthodoxy , parts of her body display exposed muscle fibers, while the rest is covered in ossified plates. Ixhel's greatest desire is to see the glory of Phyrexia propagated across the Multiverse . However, she is plagued by other independent sentiments, which formed a rift between herself and Atraxa. Elesh Norn created Atraxa and bequeathed upon her a sacred duty. While Norn turned her conquering eye to the Multiverse , Atraxa would have the honor of bringing the other spheres of New Phyrexia into the fold. Atraxa knew if she were to do this, she would need a lieutenant of her own. Taking inspiration from Elesh Norn­, Atraxa created Ixhel in her image and commanded Ixhel to go forth and subdue the other praetors. As each realm fell, Ixhel grew more and more intelligent. The thane Geth had begun to make contracts with various aspirants throughout Phyrexia, those who had not been fully compleated or whose compleation had gone wrong, offering them protection and safety in exchange for service. Atraxa eventually sent Ixhel to assassinate Geth. When Ixhel confronted Geth, he sowed doubts in her about her place in Phyrexia, but after a short fight, Ixhel decapitated him. Ixhel, feeling a strange affinity with Geth despite her contempt of him, killed one of Geth's underlings named Belaxis and used his and Geth's bodies to create a new Phyrexian creature named Vishgraz . Ixhel presented Vishgraz to Atraxa, but Atraxa was disgusted that Ixhel had thought for herself in making Vishgraz rather than remaining obedient to her will and told her to get rid of the creature. Ixhel's beautiful child was branded an abomination by the Machine Orthodoxy that raised them both. This stung Ixhel to the core. Ixhel abandoned Vishgraz in the Dross Pits, and although she felt a strange desire to stay with him, she did not. As she has matured, so has her understanding of Phyrexia, and perhaps she has begun to call into question the doctrine that raised her. Ixhel's fate following the fall of New Phrexia and the New Phyrexia-Zhalfir switch is unknown. Ixhel's name may be derived from Ixchel , an ancient Maya goddess sometimes depicted as a spear-wielding warrior."}