{"text": "Jin-Gitaxias ( Phyrexian : aEDn,Gyts , IPA : [ʤiʔn ɢytx] ) was the blue -aligned praetor of New Phyrexia . He is presumed dead, devoured by his own larvae. When the Phyrexians infected Mirrodin, it was a world of five suns. The five praetors each rose under the influence of each sun. Jin-Gitaxias was influenced by blue mana, so he searched for knowledge. He grabbed everything he could and improved on it. He was cold, brutal, and believed he was the smartest of the praetors. Jin-Gitaxias' enormous body was made of chrome, with clawed arms and a curved spine. Exposed ribs and pointed vertebrae were displayed like metalwork. His face and mouth were monstrous and bird-like, with too many sharp points and long, flat teeth. His voice sounded like metal grating against metal. Obsessed with perfecting Phyrexia to its highest potential, he was the author of a revisionist philosophy known as \"Great Synthesis\", which takes some liberties with Phyrexia's core religious philosophy to make progress easier. For instance, he saw the original Father of Machines as ultimately imperfect (the same applied to the later leader ), and discarded the term \"evolution\" when applied to Phyrexia as he felt it an inappropriate term to describe what was occurring (as well as to distinguish his views of perfection from those of Vorinclex and Glissa ). Living in what was once the Lumengrid , he tended a large variety of newts that grew in vats attached to nearly every place in the facilities. His interest in perfection and natural curiosity led him to explore the occult, and it was implied that he could make use of White and Black mana. Using Sheoldred 's necromantic prophetic visions, he had access to many creature designs he could turn his newts into. He hated Vorinclex and considered Karn too incompetent to rule. He once captured Tezzeret , and brought him before Karn. Although Elesh Norn was aware of his machinations, Jin-Gitaxias appeared to keep at least a neutral relationship towards her until the end. Kaito Shizuki and Tamiyo confront Jin-Gitaxias in Otawara . As Phyrexians are soulless creatures , they inherently are unable to possess planeswalker abilities. In her bid to take over The Multiverse , the praetor Elesh Norn challenged Jin-Gitaxias to find a way to turn planeswalkers into Phyrexians. With the aid of Tezzeret , Jin-Gitaxias arrived on Kamigawa , believing the plane's dual-realm nature would help further his studies. There, he began working with the Hyozan Reckoners and the Futurist Tameshi in the Towashi Undercity. Having long coveted the secrets of planeswalking , Jin-Gitaxias began performing experiments on Kamigawa's kami , believing their ability to pass between Kamigawa's two realms made them perfect test subjects. Through these experiments, he successfully devised a way to compleat a planeswalker without removing their soul. Kaito Shizuki and Tamiyo eventually discovered his base and fought with him, during which the Wanderer appeared suddenly and cut him in half. However, his body was recovered by Tezzeret and rebuilt on New Phyrexia, where he compleated the kidnapped Tamiyo into the first Phyrexian planeswalker. At some point, Jin-Gitaxias began to perfect the glistening oil itself to be more virulent, weakening the effectiveness of Melira's healing abilities on those affected by it. He also made it much more potent, allowing it to take over organic material faster and thus reducing the necessary time to compleat those exposed to the oil. After Norn agreed to fulfill her end of her bargain with Tezzeret, she sent him to Jin-Gitaxias to build him a new darksteel body. Upon the operation's success, Tezzeret attempted to planeswalk away, but found that Jin-Gitaxias had bound him with the same material that had trapped Karn on New Phyrexia. Jin-Gitaxias revealed that he intended to warp the darksteel into blightsteel using a corrupted version of the Reality Chip. He then opened a secret compartment containing one of Urabrask's scrapchiefs, revealing that he had known Tezzeret's and Urabrask's intentions since before the rebellion began. After the scrapchief willingly granted control of himself to Tezzeret, he broke free from his containment and attacked Jin-Gitaxias. The praetor slew the scrapchief, but Tezzeret escaped before he could be further experimented upon. The Chrome Host invaded many planes during New Phyrexia's mobilization, each directed by intelligence from Jin-Gitaxias. He was present when Norn captured the remaining Mirran forces and was prepared to strike down Koth before Elspeth , now an archangel, intervened. This was the point at which Jin-Gitaxias's patience with Norn's megalomania ran out. In Norn's hysteria upon Elspeth's return, she directed an unreasonable number of forces towards killing — not compleating — Elspeth, while a second rebel force threatened Realmbreaker; meanwhile, Jin-Gitaxias's suggestion that Norn ought do otherwise was met with the loss of an arm. Jin-Gitaxias retreated and prepared his armaments: a war machine escorting a vat of his newts, his vision for the next generation of Phyrexia. However, he made the ironic mistake of attacking Norn and leaving himself open, and the Zhalfirin forces caused his war machine to collapse. Jin-Gitaxias fell into his own vat of newts, who promptly devoured him. In the Webcomic Dark Discoveries , it was revealed that Jin-Gitaxias was a parent when he threatened to feed Tezzeret to his larvae. He referenced this threat again after performing Tezzeret's surgery. During the final fight of the New Phyrexian invasion, Jin-Gitaxias appeared atop a war machine built of a vat of his newt-like progeny. Two of Jin-Gitaxias' minions, Ezuri and Tamiyo, are green-aligned - ironic, given Jin-Gitaxias' hatred of Vorinclex and his Phyrexian faction and ideology. The flavor text of Steel Sabotage ( Mirrodin Besieged ) attributes support for the Great Work to a member of the Progress Engine , whose relationship to Urabrask is unfriendly. Jin-Gitaxias is the primary antagonist of the animated trailer for Kamigawa: Neon Dynasty . While speaking the Phyrexian language , Jin-Gitaxias preferred to use complex, compounded words. As a powerful Phyrexian, Jin-Gitaxias could travel to other planes using an improved form of the Planar Bridge . New Phyrexia Kamigawa Associated cards: Depicted in: Quoted or referred to:"}