{"text": "General Jirina Kudro is a Coppercoat soldier from Ikoria . Jirina is a slim, tall woman with smooth dark skin and long, raven hair. She uses spectacles to read. Jirina is the daughter of the stern General Kudro , the leader of the Coppercoats and the city of Drannith , and one of his many staff officers. As captain of her sanctuary's military, Jirina dedicates her life to defending the civilians in her care at all costs. Amid constant monster attacks, she and her troops rely on discipline and precise tactics to keep the danger at bay. Unlike her father, though, she seemed to take a less ruthless, less antagonistic approach when it came to bonders and their monsters, tempering duty with compassion. When her fiancé, captain Lukka , bonded with a winged cat , he was banned from Drannith and became an outcast. He formed an army of beasts, that he proposed to use to defend the city. As Kudro refused to listen, Lukka killed him. Against his expectations, Jirina refused to join him. She attacked him and fled home to take command of Drannith's defenses. Jirina successfully took over command of Drannith's forces from Colonel Bryd using her position as the daughter of General Kudro. When Lukka and his army attacked, Jirina planned to keep the monsters at bay until Lukka could be drawn closer. The bonders were to deal with anything that got into the city while keeping out of sight of Lukka. With the help of Vivien Reid , Jirina's strategy worked as she confronted Lukka who found himself surrounded by the bonders. Faced with defeat, Lukka attempted to use more of the Ozolith ’s power, causing it to explode and resulting in his planeswalker's spark igniting . After their victory, the rebuilding of Drannith quickly began. Jirina took on the rank of colonel, carrying on her father's legacy of defending the city while seeking to create more humane policies for dealing with bonders and monsters. Now the city's general, Jirina survived Lukka's sacking of Drannith, leading the survivors to Lavabrink while he slowly amassed the beasts of Ikoria. On the way she was assisted by Vivien Reid and Chevill . With many wounded unable to outpace the monstrosity Lukka had formed, Jirina led them to Vadrok's lair, where Vadrok made short work of Lukka's flesh-titan and ripped him from it. At Vadrok's mercy, he merely flew off, allowing Jirina to lead the survivors away while more omenpaths opened over Ikoria. Quoted or referred to:"}