{"text": "Jolrael is one of the oldest Zhalfirin mages on Dominaria . Having retreated from civilization, she lives in the Mwonvuli Jungle which is now part of the self-contained plane of Zhalfir . Jolrael is a dark-skinned Zhalfirin woman. Jolrael, Empress of Beasts Generations ago Jolrael used to be a court mage at the royal houses of magic in Ki’pamu , the capital of Zhalfir. After enduring the taunts and imposed isolation of her peers, Jolrael forsook humanity and ordered an expedition to take her into the Mwonvuli. Although the thick vegetation forced her companions to turn back, she alone continued. Thought dead by many, she lived off her magic and the wildlife for some time before ordering the animals and native spirits of the forest, now loyal, to erect a palace for her. A capricious soul at heart, Jolrael soon tired of her home and ordered another one built. And so today myriad beautiful dwellings dot the Mwonvuli, most remaining vacant. Only once did Jolrael emerge from the deep jungle. This was to witness the return of the planeswalker Teferi . She had served in the royal court while he advised the Zhalfirin king and of all the people she ever met, Jolrael revered Teferi the most. She stayed to watch Teferi crown Queen Yormeba ruler of the nation and when he departed Ki’pamu, she returned to the Mwonvuli. Jolrael's Spirit Link ( Legends ) allowed her to commune with creatures. Teferi made his home in the Chaza Isles where he experimented with time itself. One day the experiments became too much for the time stream to handle and everything on Teferi's Isle was phased out of the present. Jolrael, having felt the enormous energy surge of the cataclysm, traveled there to see what had happened. On the island, she met Mangara and Kaervek , two mages who had also been attracted by the energy. When the three couldn't find anything of use on the now barren island, they traveled to mainland Jamuraa. Jolrael allowed Kaervek to see the wilder reaches of the continent but was very surprised to find Mangara ruling Zhalfir upon her return. Her natural distrust of humans allowed Kaervek to manipulate her into declaring war on Mangara. But eventually, she overcame that distrust and sensed the truth - Kaervek was only using her to further his ambitions against Jamuraa. She rebelled and attacked Kaervek while they were sailing in the Kukemssa Sea to Teferi's Isle, and although she was knocked unconscious, she managed to severely damage the Urborg mage. Though Teferi sank Kaervek's armada, he sent a drake to rescue Jolrael from the wreckage. After Kaervek lost the war, Jolrael retreated to the Mwonvuli once more, with only the occasional visit by Teferi. Later, Jolrael helped defend Jamuraa during the Keldon Invasion . Jolrael was still alive on Zhalfir when it was returned to the Multiverse in place of New Phyrexia . Associated cards: Depicted in: Quoted or referred to: Jolrael's name was misspelled as Jolreal in the Prophecy novel. The Story of Jamuraa Visions: The Backstory Mirage Character Profiles ↑ Wizards of the Coast (February 4, 2021). \" Black is Magic Product Details \". magicthegathering.com . Wizards of the Coast. ↑ Pete Venters (February 1997). \"Visions Told: The Resolution of the War for Jamuraa.\" The Duelist #15, 63 ↑ Jolrael, Voice of Zhalfir"}