{"text": "Josu was the brother of Liliana Vess . He was born in the Caligo Forest on Dominaria . Deceived by the Raven Man , Liliana turns her brother into an undead. Long ago, Josu suffered horrible corruption at the hands of his father's enemies. His sister was tasked by Lady Ana to gather the roots of the Esis Tree for his cure. Unfortunately, she found out that her father's dark enemies had razed the groves where the Esis Tree had grown. She only learned of this fact when she encountered a strange man who claimed to be a supporter of her father. He offered his assistance, though he warned that her family would not want her to use his cure. Liliana returned to the castle and despite the warnings of Lady Ana, she used the cure. Truly, it cured Josu of his affliction, but only at the cost of driving him insane and poisoning him anew. Realizing that she had to kill the crazed creature that Josu had become, Liliana turned his victims into zombies to fight him. At that same moment, she unlocked her planeswalker's spark and ended up on Innistrad . These events later become the subject of a book known as The Fall of the House of Vess . In Liliana's wake, their father attempted to lay Josu to rest but was himself killed instead by the undead Josu. Their mother and sisters relocated in search of both a cure and of Liliana, whom they presumed to have been kidnapped. In their mother's quest, she followed a lead of a supposed magical cure but died trying to acquire it. The sisters and cousins each tried in various ways to stop Josu or destroy him, but each failed. This paradox became known as the Curse of Vess. Josu Vess with the reanimated corpse of Kyashatar. At some point, the Cabal captured Josu and removed his face from his body, which they then attached to the corpse of a knight. In this way, the Cabal made a lich dedicated to Belzenlok . As a lich, he regained sapience as well as his knowledge from his prior life, giving him greater value to the Cabal. He was then made a lich-general for the Cabal. During Kyashatar's burial ceremony, Josu had a ritual initiated to resurrect her. The ritual was performed with wards to keep all living dragons away, so Darigaaz was unable to intervene. Shortly after Kyashatar was resurrected, the Traveler dueled Josu and laid Kyashatar to rest once again. Josu had his forces create diversions in Benalia while he led a raid on the Dawnvault and the Caligo Morass . With divine help from Serra , the Traveler destroyed Josu. He swore an oath in his destruction to rise again. Though, with his physical form destroyed, it would be very difficult for him to do so. Rael prophesied that if he should rise again, it would certainly be for the last time. With Josu out of the picture, Rael was able to once again claim Caligo and the Dawnvault for the Church of Serra. However, the Cabal soon found a way to both reconstruct and reanimate the lich that was Josu that had made them so strong. Holding court from the ruins of Vess Manor, he transformed the forest into a swampland. Liliana was able to lure her brother's lich back to Vess Manor because his curse could only be ended where it began. She broke the lich spell with the help of the Chain Veil . Before dying, Josu told her that their family had been wiped out as a consequence of her actions and that she was the real curse. Depicted in: Quoted or referred to:"}