{"text": "Jund is one of five shards of Alara . It is primarily red -aligned, with black and green as secondary colors . Jund is composed of active volcanoes, sharp mountain ledges, and lush jungles. It has a pungent sulfuric atmosphere. The hot climate, bubbling tar-baths, and volcanic activity combine with the reptilian populace to create a sense of a primeval world. The land has deep-cut valleys in it that resemble huge claw marks if seen from above. These deep gashes in the land are where the jungles and swamps are found, The active volcanoes add difficulty to the lives of its human , viashino and goblin inhabitants, but are of great advantage to the dragons that dominate it. Even many plants have moved beyond mere toxicity and have developed attack strategies of their own. According to the creatures and shamans of Jund, Jund is a world of pure freedom. Every animal can do whatever they want to do. There is no authority of Jund, and therefore the world has become crazy and wild. Since Jund lacks white and blue mana, there is no peace and thought. Instinct is the choice over control and deliberation. Life on Jund is a never-ending struggle of survival of the fittest. It is a voracious, creature-eat-creature world - almost every living thing on the plane is both predator and prey at once, constantly on the lookout for the bloody fare while trying to avoid becoming someone else's. The dragons are at the top of the food chain and feed on everything and anything below them. Fiercely territorial, they will fight over any scrap of food taken from their territory. No creature on Jund is a natural predator of dragons, although humans occasionally undertake Life Hunts against them. When a dragon becomes too ancient to protect their territory, they perform a ritual called the Shriek of Flame where they plunge themselves directly into an active volcano, causing that volcano to erupt- often eradicating much of the prey left in its territory. Some residents believe all volcanic eruptions are caused by the death of a dragon. Because of the undisputed supremacy of dragons, a geographical hierarchy has emerged among humanoids. Second on the pecking order are the Crocodile -like Viashino. Stronger than the other humanoid races, Viashino can occupy the deep jungles and swamps where hunting is harder for Dragons. They are muscular brutes that form tribes called Thrashes . Humans are next on the food chain. Humans are stronger than goblins but are generally no match for the raw strength of the viashino. As a result, humans tend to settle in the scrubby jungles at the base of mountains or the scarred volcanic flats. Human settlements are rudimentary and easily relocated. If a dragon settles nearby or resources run low, the humans pack up and move to a more hospitable location. They form nomadic tribes that are necessary for survival. At the age of ten, humans undergo a dangerous rite of passage where the warriors will climb an active volcano and are forced to bring back a glass shard to become a warrior. Shamans take a dangerous drug called Dreamfire Draught which attracts elemental entities. The young shaman must bargain with the elemental for a cure to this poison to become a Shaman. With either test, failure results in death. Humans have developed reptilian features such as forked tongues and scales covering some of their skin. In battle, a human warrior will mark a victory by weaving part of their hair into a small braid and binding it with a piece of their enemy's flesh. Occasionally, clans will gather their warriors to embark on a Life Hunt, an often suicidal hunt for the shard's enormous prey, that can even end in an entire clan's disintegration. Reaching the age of fifty is nearly unheard of among Jund's humans. As the weakest race, the rat-like goblins occupy the highest ground, such as inhospitable mountainsides and barren plateaus, which makes them easy prey for cruising dragons. Goblins are so used to being devoured by dragons, that their culture has become one that glorifies death and recognizes itself as \"divine food\". Goblins inhabit the highest regions of the mountains which are easy prey for young dragons. When the Conflux occurred, blue and white mana flooded into Jund. The food chain became disrupted and fell apart. Creatures became less violent and more thoughtful, but this created more wildness. The angry shamans struggled to keep control as the dragons flew to new lands to destroy more. New creatures and plants emerged, and the instinct of several of Jund's creatures disappeared. As Jund's edges merge more and more with the other shards, it becomes part of the new Alara. Alara as was targeted by Elesh Norn 's Machine Legion as part of New Phyrexia's Invasion of the Multiverse with a simultaneous strike on Bant, Esper, and Jund. At some point during the invasion, the Maelstrom itself awoke to fight on behalf of Alara. The Bloodhall , a huge, sangrite-rich cavern in the scar-lands above the rift valleys. The cave is sacred to Jund's human warrior-clans — but in territory unclaimed by any tribe — and frequented by hungry slimes and oozes. A narrow chasm carved by a long-defunct geyser penetrates the rock at a steep angle. At the bottom of the chasm is the Bloodhall, a circular room with red sangrite coating the walls with a glassy sheen. It is here that humans gather for the Life Hunt. Cicatrice , a region of especially rugged land, knuckled and twisted between two great rift valleys. Called scar-lands by the tribes that live in this extreme terrain, the Cicatrice is home to one of the most powerful of Jund's dragons, a red-scaled, tattered-winged monstrosity whose shadow blots out the sun and casts her quarry into darkness. She has several nests here but keeps her main hoard in an obsidian basin ringed with talonlike spikes. Hellkite's Pass The Rift Valley The Rip . Jund’s surface is covered with deep gashes that resemble claw marks. The deepest of these, the Rip, plunges nearly two miles from the scarred hilltops to its swampy, jungle-filled depths. The Seethe , a vast network of low-lying tar pits. A source of black mana, it is home to the Pitch Thrash of viashino. Varakna is the deepest tar- swamp in Jund. The Worldheart Chalice , the lair of Nicol Bolas . A volcanic cavern filled with shards of sangrite larger than a dragon, as well as the most unique formation of all: a colossal crimson helix that is the backbone of the mountain itself. It is said that Worldheart sangrite pulses with the spirits of creatures far more powerful than dragons — the ancient ones that reigned before Alara split. There is a legend that three planeswalkers made a wager to see who could find a piece of the crimson sangrite. Only one man returned from Jund with the coveted crystal, but he went insane. The other two dueled over the spoils, until one lay dying on the ground. The other disappeared with his prize and was never heard from again. Mount Jhal , the place where Malactoth 's lair was located. The Nel Toth clan The Ripclan or Tol Durek clan The Tol Antaga , Kresh 's splinter clan from the Tol Hera. Riftclan Tol Breot , led by Breot the Slayer. Half the clan was transported to Grixis during the Conflux . Highclan Tol Hera . This human tribe, led by the impetuous Javid Hera , believes that humans should not skulk in the low ground but take possession of the heights. To them, the Life Hunt should not be a rare ceremony but an ongoing war against the dragons until one or the other side is exterminated. Unlike other tribes, these humans see no evil in consuming the life energy stored in sangrite crystals to increase their power. Their numbers are small, however, in large part due to their bold forays into the high ground, but every member of the tribe is a fearsome combatant as a result. Ajani Goldmane Sarkhan Vol Nicol Bolas Associated cards: Quoted or referred to: Magic Arcana (May 21, 2009). \" The Style of Jund \". magicthegathering.com . Wizards of the Coast."}