{"text": "K'rrik ( Phyrexian : BFrrh , IPA : [kxʼərrk] ), initially known as Kerrick , was a Phyrexian sleeper agent on the Dominarian island of Tolaria . Kerrick crashed on the Tolarian beach with his ship, and was found and rescued by a young Jhoira , who was fond of contemplating the ocean and thinking of Shiv and longed for a strong man like those of the Ghitu .  She fell in love with Kerrick, since he was mature unlike the boys enrolled at the Academy (such as Teferi , the magical prodigy who had a crush on Jhoira). She built a small house on the beach for herself and Kerrick, unaware that he was a Phyrexian sleeper agent, and would visit him secretly at night. One night, Karn , the silver golem, and also Jhoira's only true friend, was wandering about the beach while having been sent back in time a few hours in one of Urza 's (here known as Master Malzra) time-traveling experiments. Karn discovered Kerrick and Jhoira but promised to tell no one about them.\nOn another such voyage to the near past, Karn discovered Kerrick stealing blueprints from Urza's lab, and so he followed him, taking advantage of the fact that he was out of phase with this \"past\" world (a side effect of the time machine). Karn followed Kerrick through the secret passage that Jhoira used to sneak out of the Academy. Kerrick unknowingly led Karn into a secret Phyrexian meeting in the woods, where Karn overheard the Phyrexian's plans of invading the Academy. When Karn returned to the present, he quickly attempted to warn Urza, but it was too late, for the attack was already upon them. Kerrick had brought Phyrexian negators into the Academy. The negators began slaughtering students and teachers alike. Karn fought his way to Jhoira's room, where he found her body covered in blood on the ground. Karn then fought and slew Jhoira's killer, a negator. After killing the negator, Karn returned to Urza and suggested using the time machine to prevent the attack. Urza agreed and sent Karn back in time once more, even though the time machine was near an overload. Karn was successful in catching the past Kerrick, even breaking his leg in the process. However, Karn was suddenly and forcefully pulled into the present. The time machine had overloaded and malfunctioned. The time machine was casting arcing rays of temporal energy and was instantly aging parts of the lab into dust. Then the machine exploded and caused the great temporal disaster in Tolaria. Urza, using his planeswalker powers, quickly petrified the students and staff closest to him (14 total, including Barrin ) and planeswalked away to safety. Urza, after returning 10 years later, found that Kerrick, the sleeper agent, had survived the anomaly. Kerrick, along with other phyrexians, was trapped in a fast-time rift . Kerrick had constructed an enormous Phyrexian fortress and army in this fast-time rift. Striving to improve his Phyrexian standing, he renamed himself K'rrik and became the lord of that fortress. He was able to spawn generations of Phyrexian Negators in one year, growing his army and devising ways to attack Urza and his team, who were rebuilding the Academy. While Urza was imprisoned in Yavimaya by Multani , Barrin's forces were finally overrun. After he sent a beacon to Urza calling for aid, Urza shook off his stupor. Multani attempted to recapture him but instead was stuck within his energy as Urza planeswalked away, first to Shiv to gather warriors and then to Tolaria to fight. In the battle, Multani observed that Urza protected all the life in Tolaria from the Phyrexians. Understanding the true danger that was K’rrik, Urza descended into the fast-time chasm and saw the horrors of Phyrexia. K’rrik disabled Urza but Multani lent Urza his strength and together they were able to kill the Phyrexian. Multani animated Tolaria's forests and the remaining negators were destroyed as well. Dominaria Phyrexia Depicted in: Quoted or referred to:"}