{"text": "Kaladesh is a plane where aether manifests more than on other planes, being present in the atmosphere. Kaladesh was introduced in Origins as the home plane of Chandra Nalaar . Slightly over a year later, it was the setting for a block of the same name . The atmosphere of Kaladesh is saturated with Aether due to greater proximity to the boundaries of the Blind Eternities . The influence and cyclical passage of Aether through the world below is the driving force of the plane. The aethersphere may be observed as twisting swirls in the sky. From time to time, this Aether comes down to the earth via rain or similar weather events. The entire ecosystem is influenced by it and grows with it in similar swirling and twisting patterns. Refined aether is the primary power source for most of Kaladesh. In Ghirapur , the raw aether is harvested from the sky via large aetherspires placed on mountaintops or thopters , refined, and then pumped through large pipelines all over the city. Kaladesh is an ethnically diverse plane where natural mages are rare. Work that would be done with magic on other planes is instead accomplished through devices. The automatons, thopters and other artifact creatures of the plane are all fueled by the aether. These artifacts are built as much for beauty as for function. Inventors are the most valued members of society. Natural mages are a rarity on Kaladesh and are regarded with suspicion and dread. Fire magic is strictly banned, and pyromancy punishable with a death sentence, since pyromantic magic interacts dangerously with the aether in the air. Religion plays next to no role in the lives of the plane's people, and magic derived from the power of the gods is unknown. Kaladesh is ruled by the Consulate . Its forces and works are nearly omnipresent. Centuries ago, Kaladesh was made up of of eleven kingdoms, and inventors sought the patronage of these courts. Over the years, social and political entanglements between these court inventors bound them together in an informal network. When the kingdoms warred in a massive bloody conflict, the inventors used their influence to negotiate a peace, and Ghirapur was founded on neutral ground. Eleven inventors - one of each kingdom - became the first Consulate . Since the discovery of harnessing aether by Avaati Vya sixty years ago, the Consulate reportedly has worked to ensure that this refined aether is accessible to all, leading to an era referred to as the Great Aether Boom. This happened around the same time as the Mending . The current era is known as the Inventor's Renaissance, with the Consuls promoting and patronizing new discoveries and scientific studies, awarding the most impressive during the Inventor's Fair. The Consulate also heavily regulates use of the aether, assigning its use among the citizens. They are opposed by Renegades , who believe that the Consulate is corrupt and constricts their freedoms. At least two members — Tezzeret and Kambal — were working against the good of Kaladesh, giving the renegades good reason to be suspicious. The tensions boiled over during the Inventor's Fair , coinciding with the return of Chandra Nalaar to her homeplane, when the Consulate confiscated the entire swath of inventions. Much of this was a cover for Tezzeret to obtain the Planar Bridge and without his initiative the Consulate buckled to the revolution. Renegade leader Pia Nalaar , thought deceased, was instated in Kambal's position, giving a stronger voice for freer use of aether. Kaladesh was a target in New Phyrexia's Invasion of the Multiverse . While most of the city of Ghirapur was evacuated, Pia worked with the city's artisans to defend the aetherflux reservoir, which if breached would destroy the city. Several days into the defense, Pia rendezvoused with Saheeli Rai , who confirmed that the reservoir was drawing the interest of the Phyrexian forces. In the aftermath of the Invasion, Kaladesh's denizens again began to question the Consulate's leadership. Pia's responsibilities became rebuilding the wartorn city. Aetherflux Reservoir. Ghirapur , the city of wonders, capital of Kaladesh, seat of the Consulate The Inventors' Fair The Gonti's Night Market . Many other locations contained in the city Devra Cliffs - a location in the northern mountains Lathnu , a mining city on the cliffs Peema , a forest whose fauna is infused with aether. Vahd , an expansive region that was once solely devoted to farming, but now has become the center of the aerowright industry. Maranjapur, a village in Vahd Panka, a village in Vahd Cambi, a village in Vahd Vinday River Mapani River Bunarat , a village burned down by Captain Baral . Most lifeforms of Kaladesh have been transformed by the aether in some way. Elves : Kaladeshi Elves are more in tune how aether influences the natural world. Humans : One of the few species whose physiology is unaffected by the aether. Vedalken : Vedalken on Kaladesh are tall, six-fingered beings that subscribe to the view that nothing is perfect. Dwarves : Dwarves on Kaladesh are primary aligned with white mana, for their strong focus on quality of their work. Gremlins : Gremlins are red-aligned creatures that are attracted to Aether and often jam artifice in their search for it. Aetherborn : A mysterious black-aligned race that spawns from use of the Aether and lives short, hedonistic lives. Giants : Massive humanoids that follow aether streams in extended migrations. Whales : Flying cetaceans that live in the aethersphere. Angels : Living inventions created through white mana. Demons : Living inventions created through the Dark Schematic , a blueprint devised by unknown artificers of the ancient past. Kaladesh is inspired by steampunk and India . Kaladesh may be translated from Sanskrit into kala ('tomorrow' or 'black') and desh ('world' or 'country'). The intended translation is \"world of tomorrow\". Associated cards: Referred to: \"Planes of Existence: Kaladesh\" — Wizards of the Coast Magic Creative Team (November 2, 2016). \" Planeswalker's Guide to Kaladesh \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (November 9, 2016). \" The Making of Kaladesh \". magicthegathering.com . Wizards of the Coast. Plane Shift - Kaladesh"}