{"text": "Kamahl was a powerful human barbarian from the Pardic Mountains of Otaria on Dominaria . He was the brother of Jeska and the pupil of Balthor . He left his mountain home to go to Cabal City to earn himself wealth and fame through pit-fighting. His fighting technique was a mixture of barbarian close-combat skills and red magic, which he combined using his prized possession, an enormous two-handed sword rumored to have been crafted from the staff of Urza . Not a great deal is known about Kamahl's childhood, save that his grandfather was the legendary lavamancer Matoc and he once kept a pet firebeast ; the creature burned off his hair, which never grew back. Upon arriving at Cabal City Kamahl was initially sneered at by the wealthy locals because of his shabby appearance and barbarian origins, but through an impressive demonstration of his magical skills, he was able to gain sponsorship and entered the pits. He first saw the Mirari when he was shown the fighters' prizes and became obsessed with obtaining them. His talent soon became clear as he won several matches, where he also befriended two other fighters: the centaur druid Seton and the Cabal dementia caster Chainer . Kamahl quickly became a crowd favorite and earned himself a small fortune through wagers. However, following an attack on Cabal city by a Krosan dragon , Kamahl's life took a dramatic turn. He aided in the city's defense, killing the enormous lizard. However, his victory was bittersweet as he first found himself buried beneath the creature's carcass, then upon freeing himself he found that his kill (and the rewards for it) had been accredited to the arrogant aven warrior Lieutenant Kirtar . As a final insult, Kirtar's choice for his prize was the Mirari, whose powerful magic called to the barbarian and amplified his already intense resentment and jealousy. Kamahl thus began his journey to claim the artifact for himself. Kirtar returned to the Order 's citadel while using the Mirari's powers to take control of it, struggling with the Order's ideals of destroying dangerous magical devices. Kamahl hotly pursued him and infiltrated the fortress, but was unable to steal the Mirari before Kirtar used the device to cast a devastating spell that crystallized much of the fortress, including captain Pianna and Kirtar himself. Whilst Kamahl barely escaped the spell with his life, the Mirari fell into the hands of its other pursuer, Ambassador Laquatus , who had become equally obsessed with the device but had to give it to one of his minions. The ambassador's minions took the artifact back to the Mer Empire . Kamahl's pursuit ended at the port town of Breaker Bay, the nearest he could get to the Empire. While he was there he entered the local pit fights but was unimpressed by the competition. He did, however, befriend a trio of youths who had been impressed by his fighting skills and asked him to train them. Kamahl did so and remained in Breaker Bay until Emperor Aboshan used the Mirari to cause a tidal wave that devastated the northern third of Otaria. The Mirari itself was taken back to the Cabal by Braids (who was sorting out artifacts for the Empire), so Kamahl returned to Cabal City to once again compete for the orb. While there, he met up with his old friend Chainer, whose skills as a dementia summoner had increased dramatically. The two formed a successful partnership that broke the record for the most consecutive wins, but they parted company when the Cabal Patriarch insisted they throw their next match. Kamahl refused, as he wanted to win or lose games by his skill rather than on the whims of match-fixers. However, Kamahl and Chainer remained friends, and when Chainer asked Kamahl to accompany him on his ritual shikar , Kamahl agreed without question. The ritual began well as Kamahl and Chainer tracked and caught new creatures for Chainer to summon in battle. However, the pair were ambushed by a druid and several wild animals that were intent on stopping their poaching. Kamahl and Chainer won the fight, but afterward, Kamahl felt a great deal of guilt: the random slaughter of animals just to feed the pits was exactly what Kamahl's other friend Seton had been trying to stop. Thankfully, Chainer felt that the ritual was now complete, so Kamahl was not forced to abandon him in the forest. As they returned to Cabal City, they found that it was under attack by the Order. Both Chainer and Kamahl entered the battle, but Kamahl was badly injured by an Order justicar. When Kamahl regained consciousness, he found himself in a Cabal hospital with snakeskin grafted over his wounds, skin that Chainer had created for him using the Mirari. Kamahl was horrified; as such a procedure went against his barbarian principles. To cleanse himself of the additions, Kamahl burnt off his skin and left the hospital, holing up in a cheap hostel to heal naturally. Ultimately, however, Kamahl was forced to confront his friend when the curse of the Mirari drove Chainer into madness, causing him to summon a vast horde of dementia horrors . Kamahl was unwilling to kill Chainer, however, and instead tried to talk him out of his insanity before it was too late. Tragically, Kamahl was unsuccessful, as the power of the Mirari overcame the dementia summoner and warped his body into a hideous mass of dementia beasts. As Chainer died, he gave the Mirari to Kamahl, who then took the Mirari and attached it to the pommel of his sword to keep the dangerous artifact in safe hands. Kamahl returned to his old home in the Pardic Mountains, where he was reunited with Jeska and Balthor. Initially, he was content simply to return home covered in glory, but inevitably the Mirari dominated his mind. He became increasingly aggressive and unpredictable (even for a barbarian) and attempted to take control of all of the tribes under his dictatorship. Jeska and Balthor tried to reason with Kamahl but were forced to oppose him as the barbarians were divided into factions and readied for war. Kamahl's supporters and his opposition met in a dramatic battle, which ended with Kamahl viciously impaling Jeska with his Mirari-sword, leaving her barely alive but with an incurable burning chest wound that gradually ate away at her. Shocked into rational thought by this, Kamahl recognized the dark influence the Mirari was having upon him and resolved to dispose of it for good. Kamahl felt a calling from the Krosan forest and thus decided to travel there to hopefully both heal Jeska and get rid of the Mirari. He was accompanied by a concerned Balthor and also pursued by his old rival, Laquatus. Kamahl, Fist of Krosa When Kamahl and Balthor arrived at the edge of the Krosan forest they were attacked by Laquatus and a shaky alliance of Cabalists and Order troops, both who blamed Kamahl for the destruction of their bases. Against such opposition, Balthor chose to sacrifice himself to let Kamahl flee with Jeska. Kamahl was not left alone though, as another old friend appeared, the centaur druid Seton, who guided Kamahl into the heart of the forest. Kamahl left his sister in Seton's care as he journeyed deeper into the forest to purge himself of the Mirari's influence. There he met with the ancient nantuko Thriss , who gave the barbarian an understanding of the druidic way of life, as well as showed him the devastation the Mirari had caused Kamahl spent much time contemplating what he had learned and gradually renounced his old ways. His meditations were interrupted by Laquatus, who had come to finally claim the Mirari for himself. Their showdown was further complicated by the reappearance of Balthor, who had been zombified by Braids and sent to take revenge on the merfolk responsible for his death. Unfortunately for Balthor, Laquatus was able to take mental control over him and instead forced the undead dwarf to battle his former pupil. Balthor begged Kamahl to end his torment and so Kamahl was forced to strike down his old mentor. Filled with rage, Kamahl then turned to Laquatus, the cause of much of the barbarian's misery, and struck the ambassador down with the Mirari-sword, leaving the blade embedded in the ground. With that act, Kamahl forsook the Mirari and his violent past, becoming devoted to a druidic life in tune with nature. Kamahl hoped that the Mirari would be out of harm's way in the forest and that he would be able to use his newfound knowledge to heal his sister and redeem himself. He was very wrong. While he fought Laquatus, Jeska was kidnapped by Braids and taken to the Cabal Patriarch , who tried to kill her, but instead turned her into Phage . When Kamahl came to Aphetto to take her back, he discovered to his horror what his sister had become. He agreed to fight her in a pit fight, hoping to find a way to bring her back to normal, but the fight was interrupted by Akroma who came to avenge Nivea 's death. The two siblings joined forces and managed to defeat her. Afterward, the Cabal and the Krosan forest allied to take on Ixidor , which Kamahl led into battle; the symbol of their alliance was the Soul Reaper , an axe made from the Patriarch's old axe and the broken halves of Kamahl's druid staff. In the battle, he was forced to fight his worst fear, which was his old Mirari-possessed persona which he managed to defeat. During the fight, innumerable deathwurms were purged from Phage, returning her to Jeska.  Kamahl, realizing that the deathwurms would consume the world if Jeska did not bind them back into her being, was forced to watch his sister become Phage once again. After leaving Jeska, Kamahl returned to Krosa, and planted himself in a deep meditation near Krosa's center point, declaring that the war was over for him.  There he stayed for a year, until Stonebrow came to fetch him.  At first, Kamahl seemed dead, having gone for an entire year without drinking or eating.  Stonebrow, in his despair, forced Soul Reaper into Kamahl's hands.  Green energy flowed from Soul Reaper to Kamahl, who was revitalized and now mentally prepared for his task. Kamahl was finally prepared to kill Phage.  Riding upon Stonebrow, with a small army of elves , centaurs, and nantuko, Kamahl arrived at Sanctum .  Entering the great city, they headed straight to the center of the battle, where Phage and Akroma were engaged in a fight to the death.  Kamahl approached them and swung the Soul Reaper; the axe claimed Phage and Akroma's lives, as well as an unexpected third life: Zagorka 's. The three women's souls and bodies flew upwards in a vortex, then combined in an explosion.  From the center of that explosion, a radiant being unlike any other was born: Karona , the False God. Flung out of Sanctum and into the desert sands by the explosion that birthed Karona, Kamahl regained consciousness.   Like most of Otaria, he felt a strong desire to find and grovel before Karona.  Before he could chase her, however, Karona came to Kamahl.  Feeling unworthy, Kamahl knelt in worship before Karona, who instead asked him to sit up straight, as they found out what the rest of Otaria intended to do. As the horde of Otarians seeking Karona charged closer, Karona flew up and fled.  Kamahl, like the rest, followed to where she descended.  Karona decided to mete out justice, killing a couple of nearby people.  She then ascended again and flew away.  All the while, Kamahl's perspectives solidified from watching Karona kill those creatures. This new resolve allowed Kamahl to unite with the reborn Numena and destroy Karona. After his death, Kamahl lived on as a hero renowned throughout Dominaria , remembered by both the common people and his sister Jeska. The Kamahlite druids, including Zyd, remained in Krosa as the world's magic and life faltered, and they were among those responsible for restoring the world to its former splendor following the resolution of the crisis. At some point in the future, a man named Baru will once again take up Kamahl's title of \"the Fist of Krosa.\" Much later, Jeska sacrificed herself to close the rift in Otaria's skies, allowing the Great Mending to begin. Immediately after, her dead brother Kamahl welcomed his long-separated sister in a white void. With the two siblings finally reuniting, she happily welcomed oblivion. Kamahl's Odyssey playtest names included “Protagonist” and “Dr. Bomb.” His first real name was Matoc, which would go on to be used for his lavamancer grandfather. Kamahl, Pit Fighter by Kev Walker Associated cards: Depicted in: Quoted or referred to: These are cards associated with Kamahlite druids: Baru, Fist of Krosa Krosan Grip Might of Old Krosa ( Modern Masters 2017 ) Molder Reiterate"}