{"text": "Kami (KAH-mee; Japanese: 神 ) are \"great spirits\", specifically the spirits (though not all are typed as such ) that associate with all things in the world of Kamigawa . Kami come in an overwhelming variety of forms, even among the same \"species\" of kami, and their brand of magic is mysterious and beyond anything mortals have conceived.  The greatest kami of all are the five myojin , rivaled only by the mighty O-Kagachi .  It was because the theft of O-Kagachi's scion, that the Kami War began. When the kami manifest into the ordinary world, their manifestation is a bit unstable and creates strange energy objects orbiting around them. When kami are killed, they dissolve into a fine mist. As they have no flesh to be compleated, they were killed en masse by the Phyrexians. About 1200 after the Kami War the kami are threatened by the growth of the modern city of Towashi. Many fled to the remains of the Jukai forest, and were hostile to humans. For this reason, Eiganjo trained many kami diplomats to try to keep the peace between the mortal and spirit realms. According to Brady Dommermuth \"[t]he overarching premise of the Kamigawa block is 'Shinto gone wrong.' In Shinto, a belief system indigenous to Japan, everything has a kami. Kami are gods of a sort; they’re the eternal essences of things, people, places, ideas, and so on. To give Kamigawa its own distinct look, as well as to reflect the fact that the plane was in turmoil, we concepted the kami as bizarre creatures that look out of place in the natural world, as though they couldn’t even realistically exist within it.\" Akuba (ah-KOO-bah). An evil, hag -like spirit-world creature. Baku (BAH-koo). A benevolent spirit with aspects of a lion and other animals that is said to eat the bad dreams of children. Bunrei (BOON-ray). A spirit created by dividing another spirit. Also, the ceremony of this act of division. Garami (gah-RAH-mee). Something that catches or snatches. Genju (GEN-joo). A great spirit of the land. Go-Shintai . Physical objects worshipped at or near Shinto shrines as repositories in which spirits or kami reside. Goryo (GOR-yo or GOHR-yoh ). The vengeful spirit of a mortal who died in anger or without the proper rites. Kaijin (KYE-jihn). A kami of water. Kirin . A mythical, otherworldly creature with aspects of a horse , a dragon , and a deer or goat . Before the war, kirin were omens of good fortune and long life. Kodama (koh-DAH-mah). A tree spirit. Kumo (KOO-moh). A spider or cloud. Miko (MEE-ko). A shrine attendant. Myojin (MYOH-jihn). “Bright divinity.” A kami of great importance. Oni (OH-nee). Demon, bloodthirsty and bent on destruction. Onna . Ghosts that take the vague form of human women. Shinen (SHEE-nehn). Metaphysical energy, “spirit fire” that heralded the arrival of a spirit in the material world. During the Kami War , the flares grew in size and intensity until they resembled raw mana. In the last few years of the war, these flares took shape and intention. Zubera (ZOO-beh-rah). The faceless kami of a human who has been pulled into the spirit world. The Dragon Spirits are powerful kami of Kamigawa . There are five, one for each color of magic. Unlike most dragons , they have neither limbs nor wings. Instead, they are giant serpentine beings akin to wurms , however, they still maintain the ability to fly. During the Kami War , they did not side with O-Kagachi (who himself is considered a dragon, but this has no relevance in the plot), but remained true to their pledge to protect several important places of the mortals. Yosei ( ), the Morning Star protected Eiganjo . He was ripped-apart in the battle against O-Kagachi, but survived and helped the Eiganjoan refugees in the battle against the hordes of the Myojin of Infinite Rage. Keiga ( ), the Tide Star protected Minamo . She was killed by Hidetsugu and his yamabushi minions during their attack on the school. Kokusho ( ), the Evening Star was the guardian of the Takenuma swamp. Ryusei ( ), the Falling Star was the guardian of the Sokenzan mountains. Jugan ( ), the Rising Star protected the forest of Jukai . In the initial stages of the war, he was summoned by the monks of the Order of the Sacred Bell to fight in the Battle of Silk . He was killed but blessed the monks with power even after he was gone. During the final stages of the war he was summoned by Sosuke and Sachi to aid the Orochi against the Soratami invaders. Apparently he had the ability to come back from the dead (perhaps all kami can). More than 1200 years after the Kami War , the dragons have been reborn and continue to be the protectors of Kamigiwa. Together, they worked to bring back the other three and themselves in new reborn forms. Ao ( ), the Dawn Sky. The reborn form of Yosei. Kairi ( ), the Swirling Sky. The reborn form of Keiga. Junji ( ), the Midnight Sky. The reborn form of Kokusho. Atsushi ( ), the Blazing Sky. The reborn form of Ryusei. Kura ( ), the Boundless Sky. The reborn form of Jugan. The All-Consuming Oni of Chaos , the mightiest of the oni. Consumed and fused with Hidetsugu . Adamaro , a kami that was once a famed human warrior. Akuta , a legendary kami of ashes and ruin. Arashi , the great kami of monsoons and typhoons. Ayumi , the kami who “reclaimed” abandoned places in the name of nature. Azamuki , a kami of treachery that resides in and influences people. Chisei (CHEE-say), a strange kami of intelligence said to reward the finding of patterns within thoughts. Dew, the Cloudhoof Kirin , spends every 1000 years among mortals before reuniting with the other kirin to discuss his experiences. Eiyo, Kami of the Honored Dead the kami of the honored fallen. Go-Shintai of Shared Purpose Go-Shintai of Lost Wisdom Go-Shintai of Hidden Cruelty Go-Shintai of Ancient Wars Go-Shintai of Boundless Vigor Go-Shintai of Life's Origin Gravelighter , the Kami of Forgotten Clearings, a territorial spirit that lives in the Jukai Forest. Haru-Onna (HAH-roo-OHN-nah). “Spring woman,” a spirit-world creature in the form of a woman surrounded with burgeoning growth. Hikari (hee-KAH-ree), the kami that guards the border between day and night. Himoto , the Kami of the Spark , a spirit in tanuki form who became Kaito Shizuki 's partner. She represents the Emperor's bond with Kyodai and is responsible for igniting Kaito's spark . Hinata , Dawn-Crowned, a kirin spirit . Hokori , a great kami of dust and drought. Horobi (hoh-ROH-bee), a powerful kami of death's wail that came into being after the Reito Massacre. Ichiga (EE-chee-ga), a mighty forest kami residing in the body of a simple monk. Ichikawa, spirit of the great river Iname (ee-NAH-may), a major kami that has two aspects — one of life and one of death. Jaraku (JAH-rah-koo), a meddlesome kami of manipulations residing in the body of a simple wizard. Jiwari (jee-WAH-ree), the great kami of earthquakes, whose appearance was always preceded by waves of shinen (“spirit fire”). Jugan (JOO-gahn), the great ryuu (divine dragon) of Kamigawa's forests. Kagemaro (KAH-gay-MAH-roh), the first human to become so evil that his spirit became an oni. Kaima , Kami of Forest Fellowship, a violent kami bonded to the Orochi Samurai Chishiro . Kaiso (KYE-so), a protective kami of lingering loyalties residing in the body of a simple samurai's attendant. Kakkazan , great kami of the Mountain Fire. The Kami of Ash The Kami of Black Glass The Kami of Exultant Revelry The Kami of Empty Graves The Kami of Imperial Dishware, a spirit with a salamander -shaped body responsible for cleaning the dishes in the Imperial Palace . The Kami of Searing Wind Kaminari (ka-mee-NAR-ee; lit. \"lightning\"), the great kami of thunder and lightning. Kataki (KAH-tah-kee), a legendary kami of retribution. Keiga (KAY-gah), the great ryuu (divine dragon) of Kamigawa's islands. Kemuri-Onna (keh-MOO-ree-OHN-nah). “Smog woman,” a spirit-world creature in the form of a woman shrouded in smog. Kira (KEE-rah) , an infamous kami that can ward itself and others against spells using coatings of magical glass. Kiri-Onna (KEE-ree-OHN-nah). “Mist woman,” a spirit-world creature in the form of a woman enveloped in mist. Kiyomaro (KEE-yoh-MAH-roh), the ancient kami of Kamigawa's first daimyo. Kodama of the Center Tree The kami of the Tree of All Seasons in Jukai forest. Kodama of the East Tree Kodama of the North Tree , the kami of the Winter Tree in Jukai forest. Kodama of the South Tree , the Kami of the Summer Tree in Jukai forest. Kodama of the West Tree Keiga (KOH-koo-shoh), the great ryuu (divine dragon) of Kamigawa's swamps. Kuro (KOO-roh), a powerful oni who took many as his minions, including the nezumi Ink-Eyes and the ogre Muzan . Kyodai / That Which Was Taken , the child of O-Kagachi, imprisoned by the daimyo Konda Kyoki , a dreaded oni whose gaze induces insanity. Mannichi (man-NEE-chee), a mischievous, strange little kami of fevers and hallucinations. Masumaro , the once-revered kami of the first human to live by the ways of the kami. Mochi , the Smiling Kami of the Crescent Moon, a powerful yet diminutive kami who attempted to manipulate Toshiro Umezawa, while secretly working with the Soratami. The Myojin of Blooming Dawn The Myojin of Cleansing Fire , the kami of justice. The Myojin of Cryptic Dreams The Myojin of Grim Betrayal The Myojin of Infinite Rage , the kami of passion and all red magic. The Myojin of Life's Web , the kami of creation, patron spirit of all green-aligned things, and the god worshipped by the Orochi and the Jukai Monks. She had Michiko captured, hoping that her death would end the Kami War. But the princess escaped, and not much later her forest was attacked by the Moonfolk of Oboro. The Myojin of Night's Reach , the kami of power and black magic. The Myojin of Roaring Blades The Myojin of Seeing Winds , the kami of knowledge. The Myojin of Towering Might Nikko-Onna (NIK-koh-OHN-nah). “Sunlight woman,” a spirit-world creature in the form of a dazzling woman. O-Kagachi . The great kami of all things; all kami are in a way part of the O-Kagachi. Its manifest form resembles an unbelievably immense eight-headed serpent. Oyobi (OY-oh-bee), a great kami of the sky and of winged creatures. The Patron Kami , the great spirits embodying each race of Kamigawa. Pipe, the Skyfire Kirin , spends every 1000 years among mortals before reuniting with the other kirin to discuss his experiences. Ryusei (RYOO-say), the great ryuu (divine dragon) of Kamigawa's mountains. Scale, the Infernal Kirin , spends every 1000 years among mortals before reuniting with the other kirin to discuss his experiences. When living among mortals, he often takes the form of a disease known as the Black Wind or the Weeping Plague. Seizan (SAY-zahn), a powerful, evil oni known for its ability to deceive. Sekki , the great kami of the turning of the seasons. Shimatsu (shee-MAHT-soo), an oni overlord. Shirei (SHEE-ray), a legendary kami, a kind of shepherd of the dead, who watches over the disgraced and abandoned battlefield called Shizo . Silverbeard, the Celestial Kirin , spends every 1000 years among mortals before reuniting with the other kirin to discuss his experiences. Soromaro (SOH-rah-MAH-roh), the once-respected kami of a famous half-human, half-soratami wizard. Terashi (tay-RAH-shee or teh-RAH-shee ), the great kami of the sun and justice. The patron kami of the Towabara Plains . Thorn, the Bounteous Kirin , spends every 1000 years among mortals before reuniting with the other kirin to discuss his experiences. Towazu (toh-WAH-zoo), or The Unspeakable, the great kami of things unspeakable, also called the kami of the forbidden. Summoned by students at the Minamo school and afterwards began appearing before great seekers of knowledge and owners of arcane scrolls, leaving their owners comatose or insane with the arcane knowledge it imparted. Yosei (YO-say) , the great ryuu (divine dragon) of Kamigawa's plains. Yomiji , the kami who guards the passage from life into death. Yukora , a terrifying, murderous oni that was magically imprisoned for decades by 99 powerful kannushi. Yuki-onna (YOO-kee-OHN-nah). “Snow woman,” a spirit-world creature in the form of a beautiful woman impervious to cold. Urami (oo-RAH-mee), the Oni of Insatiable Hunger. A legendary oni caged underground for centuries. ↑ In the Japanese version of the game, the word Kami is also used for the subtype God , which are not present in the Kamigawa block . Magic Arcana (September 14, 2004). \" A Kamigawa Glossary, Part 1 \". magicthegathering.com . Wizards of the Coast. Magic Arcana (January 24, 2005). \" A Kamigawa Glossary, Part 2 \". magicthegathering.com . Wizards of the Coast. Magic Arcana (May 31, 2005). \" A Kamigawa Glossary, Part 3 \". magicthegathering.com . Wizards of the Coast."}