{"text": "Kamigawa (kah-mee-GAH-wah); Japanese: 神 河 ; literally: \"river of the gods\" or \"divine river\") is a plane strongly based on Japanese culture, and was the setting for the Champions , Betrayers , Saviors , and Neon Dynasty expansions and their corresponding books. The plane is a globe with multiple continents, although only one has been featured in sets. The world of Kamigawa, positioned far from any other world we know, is governed by the interplay between the mortals and the kami , minor gods or spirits of the world. The Kakuriyo (kah-koo-REE-oh) or Reikai (RAY-kye) is the spirit world where the kami dwell; its other half is that of the Utsushiyo (oot-soo-SHEE-oh) where mortals live. Together they form a sphere that makes the whole of the world. In the many millennia before the Kami War, the denizens of Kamigawa gave no thought to a place called the spirit world. They believed that the kami lived in the material world, the only world that mortals knew. The kami existed invisibly and imperceptibly, blessing those who lived simple and devout lives. Once in a great while, a kami would \"make itself visible\" - or so the mortal world thought. The result would be a glowing light deep within a forest of bamboo, for example, or a disembodied shadow on the ground at dusk. These fleeting manifestations bolstered mortals' belief and encouraged their shrines, offerings, and oblations. But the truth was more complicated. The veil between the utsushiyo and the kakuriyo, the material and spirit realms, was complex and variable. Each world could influence the other: Kami grew more powerful based on the number of mortals who worshipped them, and mortals could draw power from the kami through arcane means or through strong faith. In Kamigawa, every person, idea, and object had a kami, and the veil between worlds was no exception. In fact, the kami of the veil was perhaps the greatest kami of all, because without it, there could be no difference between flesh and spirit, between mortal and god. That kami was O-Kagachi . Map of Kamigawa during the Kami War Around 3200 AR , damage caused by the ringing of the Apocalypse Chime on Ulgrotha weakened the veil between the material realm and the spirit realm. This enabled the daimyo Konda and his moonfolk accomplices to use powerful magic to pull an aspect of O-Kagachi , the supreme kami of all kami, through the veil, thus beginning the Kami War . Lord Konda's act greatly enraged the spirits, who turned against the physical world with a vengeance. The kami began to attack the physical world to reclaim That Which Was Taken , though most mortals knew nothing of Konda's crime nor understood why their gods had turned on them. Fearful and confused, humanity fought back, but the kami's numbers were endless. And since many spirits who manifested in the physical world could be defeated in battle but were able to return for future conflicts, it was ultimately a losing battle for the mortals. With each spirit that manifested in the material world, the veil frayed a little more. After many years of these small breaches, the nature of the divide between worlds began to change. Mortals began to wield arcane energies that were never accessible to them when the veil was intact. Spirits took shape in ways that seemed to ignore the difference between life and death. Shinen, \"spirit fire,\" had become a hallmark of danger during the early years of the Kami War, because it heralded the arrival of a spirit in the material world. Whenever the veil between worlds was breached, there was a chance of flares of ectoplasmic energy. In the days of old, this energy was harmless, like foxfire. But as the war continued, the flares grew in size and intensity until they resembled raw mana, with the power to blind eyes, burn flesh, or taint minds. The war finally ended in its twentieth year when Princess Michiko Konda, with the aid of the black magician Toshiro Umezawa and other allies, managed to free the kidnapped scion (which took the name Kyodai ) and defeated O-Kagachi and Lord Konda. The death of O-Kagachi caused the barrier between the two realms to break down, thus precipitating the merging of the two realms (Kakuriyo and Utsushiyo). After the prosperous reign of Michiko Konda, her descendants worked tirelessly with the great kami Kyodai to maintain her legacy and uphold order and justice in Kamigawa. However, as generations passed, these noble pursuits gave way to dynastic in-fighting. Eventually, an emperor died young without an heir, creating a crisis of succession. Some believed it should be her brother, others her husband. With no guidance, Eiganjo descended into all-out war, and it spread across the kingdom when local lords saw the opportunity to seize individual power, fed by the Myojin of Grim Betrayal . Many died, noble and peasant alike. The Yamazaki clan had served the Konda military for decades and earned a reputation for their unshakeable sense of duty to their citizens. A young Yamazaki soldier felt the two warring successors were betraying and endangering the Kamigawan people. Inspired by his own ancestor's story of challenging a deadly imperial decree, he took it upon himself to end the contest for the throne. He successfully assassinated the late emperor's husband, but when he went for the brother, he found his target armed and ready for battle in the throne room. Upon seeing such confrontation in her chambers, Kyodai had enough. She stripped the Konda family of their hereditary duty as rulers. From then on, they would be ordinary citizens, and the emperor would never again be chosen by blood. Now, the kami would elect rulers for their noble qualities and commitment to the nation. The dragon-kami previously had been some of the mortal realm's strongest protectors, and with most of them lost in the Kami War, malevolent forces soon began to wreak havoc. During the Shattered States Era, a wave of oni attacks swept across the land, culminating in a devastating event known as the Night of Withering that threatened the entire Plane. To fight back, the orochi enacted a powerful ritual to resurrect Jugan , their original protector. The ritual was successful, and together Jugan and Ryusei defeated the oni incursion. With the guidance and wisdom of Kyodai, the Imperials ushered in an age of collective peace and prosperity. The arts flourished until performers lined every street, and strides were made to improve relations with the kami so mortals could live a harmonious life filled with magic. Minamo Academy was rebuilt with the promise of transparency to conduct research that would improve lives. New laws were written to ensure fair treatment of every citizen—mortal or spirit—renewing the faith in their leaders. As decades and centuries passed, the mortals of Kamigawa noticed an increasing number of kami inhabitants sharing their homes. A few of these kami were friendly, but many more were upset, even dangerous. Having spent their lives in service to the kami, the monks of the Order of Jukai went to investigate. They discovered strange rifts in the atmosphere that ejected confused kami onto the Plane. The mortal and spirit realms had begun to overlap, and they would eventually merge into a single unified realm. The Jukai brought this discovery to Eiganjo and Otawara , and they collaborated with the Imperials and Minamo to develop what would later be known as \" merge gates .\" The Minamo scholars used their knowledge to invent the gate mechanisms. The Imperials used their infantry to erect them. But it was the Jukai who would greet the kami and welcome them to their new home. Through their combined effort, the mortals built gates around every new rift, ensuring the kami could safely become part of a new unified Kamigawa. For much of Kamigawa's history, power was concentrated in the hands of the elite: the Imperials who ran the Plane with Kyodai's blessings, various warlords, and those who could channel the power of the kami. More recently, however, Kamigawa has found itself facing significant disruption to this status quo as new innovations have made access to power more widely and cheaply available to all. Key among these innovations were two: enhancers invented by the akki artisans of Sokenzanshi , and the method invented by the Saiba Futurists of drawing power directly from the spirit realm. The akki artisans had a long tradition of invention and ingenuity, as well as effectively using their scarce resources to great effect—including kami-granted powers. Thanks to the enhancer, even though few people had as deep relationships with the kami as some Imperials and the Order of Jukai , they were now able to apply more efficiently whatever powers they had been granted. At the same time, the Saiba Futurists were conducting experiments with merges to test the nature of the spirit realm. As an unintended side effect, they discovered a way to draw on magic directly, without needing to form a bond with kami. Though the Sokenzanshi artisans and the Futurists weren't directly working together, these two technologies soon combined to form the basis of the boom in new technology that exploded across the Plane. However, all this modernization isn't without its detractors. The Imperials have been trying to control the flow of new technology, attempting to maintain the stability that they see being pulled out from under their feet. And the boom of all this technology has seen the rise of a new group that calls itself the Order of Jukai, who believe that this unrestrained use of technology is drawing on power in a reckless, dangerous manner that threatens to irreparably damage the fabric of the two realms. Among the kami, opinions are mixed. Some kami are resistant, while others are more eager to see how things will change. Whatever their opinions, though, many see the appearance of new kami aligned with technology as a sign that the soul of Kamigawa itself has been irrevocably altered by this changing landscape of technological and social upheaval. More than 1,200 years after the events of the Kamigawa block , the two realms of Kamigawa are merging, and one day they will exist as one. Some wonder about what's beyond the merge gates , or how denizens of both realms will be affected when the merge is complete. The Imperials are still the main power in Kamigawa. The Kamigawans have discovered electricity, experienced an industrial revolution, and entered a computerized era. The Utsushiyo has transformed into a futuristic world of cyberpunk ninjas and samurai, where tradition and modernity meet. The kami feel threatened by the growth of the modern city of Towashi . Many have fled to the remains of the Jukai forest, and are hostile to humans. For this reason, Eiganjo trained many kami diplomats to try to keep the peace between the mortal and spirit realms. Some Kami have adapted to the electricity, taking on industrial-style bodies. Seeking information on the spirit realm and the planeswalker's spark , Tezzeret was sent to Kamigawa by the New Phyrexian praetors to investigate. Clashing with the Emperor , he destabilized her spark with the prototype Reality Chip before escaping. Years later, Jin-Gitaxias traveled to the plane himself to continue his research, eventually unlocking the secret to compleating planeswalkers before implementing it on his first subject, Tamiyo . The Emperor was able to briefly stabilize her spark, reconnecting with Kyodai and ending the Asari Uprisers ' rebellion before naming Light-Paws her regent and departing again. New Phyrexia begins the invasion of Kamigawa at Towashi . Kamigawa was a target in New Phyrexia's Invasion of the Multiverse . Because of the pace of Kamigawa's development, Jin-Gitaxias's intelligence on the plane was already outdated when the invasion began; however, the slow uptake from the Samurai meant those on the front lines were the first compleated, whereas the more technologically-inclined ninjas were better suited as defenders. With the citizenry familiar with the idea of interplanar assault, no time was wasted on skepticism. The Kami, incompleatable, were simply slaughtered, shrouding the streets with their residual mists. During the invasion, the Boseiju District was the invasion force's prime target, and Boseiju itself was corrupted by the compleated planeswalker Tamiyo . The tree burst apart, and glistening oil ran from between the splinters. The trees lower branches, usually inhabited by kami, were split apart. Tamiyo was then faced by Kaito and her adoptive son Nashi. After trying to recruit Kaito and Nashi to the ranks of New Phyrexia, Tamiyo engaged Kaito in battle. At the last possible moment, the Wanderer appeared and killed Tamiyo. However, a spiritual memory of what she once was manifested and comforted her son, and later took up residence in their home. The Wanderer somberly realized that Tamiyo had chosen her own death, as she had halfheartedly aimed her attacks and had silently beseeched the Wanderer to look after Nashi in her stead. With Kyodai distracted from her duties guarding the barrier between realms, oni began escaping into the mortal realm. In the aftermath of the Invasion, the Wanderer lost her spark in the Great Pruning . Now relegated to Kamigawa, the Emperor chose to travel the plane while Light-Paws continued ruling as regent in her stead. There are five primary geographical locations on Kamigawa, each parallel to the five basic lands of Magic . Each area is guarded by a dragon spirit loyal to the material inhabitants of its location. Towabara —  A massive plain , which name means \"eternal field\", at the center of Kamigawa. Within the Towabara was the Araba , the \"ruined land\", a blasted place filled with craters from kami attacks. Eiganjo Castle was in the center of the Araba. It was the fortification of daimyo Takeshi Konda and his samurai . The humans ride gigantic trained moths into combat. The castle was assaulted by O-Kagachi in the Kami War and badly damaged. Towabara was guarded by Yosei , the Morning Star. More than 1200 years later Eiganjo remains the Imperial political center as well as the location of the shrine of Kyodai and the residence of the Emperor. Old architecture is incorporated into new designs, thus a sense of balance between the new and the old is maintained. Pilgrims frequently visit to seek an audience with the Emperor. Minamo Academy —  The Minamo Academy is a school that teaches powerful spirit and human magics. It is built upon the largest waterfall in Kamigawa, north of Eiganjo. Minamo is led by the Soratami, who guide the headmaster and his faculty. They are often prayed to by the staff of the school. Soratami are magic practicing moonfolk that live in the clouds above the academy. The school is besieged and ravaged by Hidetsugu , an ogre whose pupil was killed by a Minamo student . Minamo Academy was guarded by Keiga , the Tide Star. The academy is also located north of the Jukai Forest. A less-traveled path between Eiganjo and Minamo skirts the northwest edge of the Jukai Forest. It is about a day's ride long by horseback. Takenuma —  Takenuma is a large area of swampland , west of Eiganjo. Here bandits and Nezumi (rat-folk) live. There are also a multitude of Oni ( demon spirits ) who live in the darkest regions, leaving the place corrupted and void of sunlight. Here the most brutal battles are fought against the kami. Kokusho , the Evening Star, watches over the vile swamps. Sokenzan Mountains —  The Sokenzan mountain range is the largest in Kamigawa and it lies south of Eiganjo. Akki , cunning goblin creatures, live here, among bandits and renegade samurai called ronin. Godo , a famous warlord of the bandits, lives here. Hidetsugu , an O-Bakemono (powerful shaman ogre) summons Oni spirits here. Deep in the Sokenzan mountain range lay the Tendo Peaks , the steepest mountains in Kamigawa. The Heart of Frost, one of the Tendo Peaks , was haunted for some time by a Yuki-onna . The Sokenzan is guarded by Ryusei , the Falling Star. The foothills of the Sokenzan border Takenuma to the northwest, and Towabara and Jukai to the north. 1,200 years later Sokenzanshi was founded. It is an industrious city using the lava from the mountains to sustain its arts and crafts. Natural springs surround it. The Sokenzan became the center for the Asari Uprisers , a rebel organization desiring freedom from Imperial tyranny. Jukai Forest —  A thick forest that harbors many varying kinds of kami. It lies east of Eiganjo. Here, an order of monks train to tune themselves in with nature and the spirit world. Kitsune (fox-folk), live in the Jukai along with the Orochi (snake-folk), who tend to stay on the Western fringes. No one has ever discovered what lies to the east of the Jukai Forest, and all exploration attempts have failed. Jukai Forest is watched over by Jugan , the Rising Star. Circa 1,200 years after the Order of Jukai was established to preserve nature and reverence for the spirits. They cite visions of the spirit world being shattered, hence they have taken into their own hands the destruction of technology. More than 1200 years later, the city of Towashi has been established in the former territory of the Jukai. This angered the spirits, forcing a compromise between the Emperor and the kami to prevent another war. Now it is the metropolitan center of the planes. Otawara — a Soratami city resting on clouds, in the sky of Kamigawa. Oboro Palace — the floating palace of the Soratami. It is kept secret from those who dwell on the grounds of Kamigawa. The only non-Soratami ever to set foot in Oboro were the human disguise-genius Sakashima , the ronin kanji mage Toshiro Umezawa , and the famed Akki wizard Kiki-Jiki , Mirror Breaker. Shizo, Death's Storehouse — Shizo is a battlefield cursed by the death of 891 samurai in a single confrontation. It is a loathed sight to all who view it. Now, only a single spirit, Shirei, Shizo's Caretaker , stays there. He walks through the dead and prevents lower souls from leaving Kamigawa. Mikokoro (MEE-koh-KOH-roh) — A sacred island of crystal that sits amid one of Kamigawa's seas. Also known as the Eye of the World and the Shrine of Enlightenment. Common Kamigawan It occasionally uses Japanese numerals. Moonfolk write using a unique calligraphy \"Hayaku ikee\" translates to \"Move it\" Hidetsugu's ritual language Kitsune Orochi It includes hissing sounds. Nezumi-tongue Like its real-world influence, Kamigawa operated on Ryō . Circular copper, silver, and gold coins are used by most races on the plane, including humans, kitsune, and nezumi. Copper coins with a hole cut in the center were used as offerings to kami before the Kami War , representing the circle of life. In the modern era, credit chips attached to citizens' wrists are preferred, but gamblers still carry translucent physical banknotes. Kamigawa uses numbered years, although they are not given a name and their start is unknown. As the year 1053 occurred during the Age of Enlightenment, it is possible years are marked following the Kami War . Kamigawan months are numbered, and there are at least ten of them. The eighth and ninth months have at least 29 days. Dates are recorded as a string with the two-digit month followed by two-digit day, a period, and the year (e.g. the first day of the eighth month of 1053 was 0801.1053). Time is recorded in 24-hour notation. A holiday called the Lantern Festival begins by 0914 and runs until 0918. Humans Kami Dragons ( focus) Kirin ( focus) Myojin Oni ( ) Phoenixes ( ) Zubera Kitsune Moonfolk Nezumi Akki Orochi O-bakemono Kappa Insects Domesticated semi-sapient moths Nantuko Plant Hydras Jin-Gitaxias Kamigawa and its block were originally named \"Inreikai\" ( Japanese: 陰霊界; literally: \"World of Shadowy Spirits\"), but was changed to its backup, Kamigawa, because of pronunciation difficulties. In an alternate reality, Kamigawa was home to a race of mountain-dwelling humanoid birds called tengu , who replaced the akki as red's primary race and featured a ninja faction called the \"Order of Smoke.\" Represented in: Associated cards: Referred to: Planes of Existence: Kamigawa , magicthegathering.com (Flash) Planes of the Multiverse: Kamigawa , magicthegathering.com Magic Arcana (September 14, 2004). \" A Kamigawa Glossary, Part 1 \". magicthegathering.com . Wizards of the Coast. Magic Arcana (January 24, 2005). \" A Kamigawa Glossary, Part 2 \". magicthegathering.com . Wizards of the Coast. Magic Arcana (May 31, 2005). \" A Kamigawa Glossary, Part 3 \". magicthegathering.com . Wizards of the Coast. Grace Fong , Emily Mei , and Ari Zirulnik (February 3, 2022). \" Planeswalkers Guide to Kamigawa: Neon Dynasty \". magicthegathering.com . Wizards of the Coast."}