{"text": "The Kami War ( Japanese: 神 乱 ; rōmaji : Kamiran ; literally: \"Anarchy of the Kami\") was a devastating, twenty-year conflict between mortals and the kami (spirits/gods) on the plane of Kamigawa . It was the central event of the Kamigawa Cycle . Konda , Lord of Eiganjo , the most powerful ruler on the plane, instigated the war in an ill-fated bid to ensure the eternal dominance and prosperity of his kingdom. After months of preparation, and with the help of his moonfolk and wizard allies, Konda enacted an arcane ritual that allowed him to pierce the veil between the mortal and spirit worlds and kidnap a god. The target of his raid was no ordinary kami, however, but the child and scion of O-Kagachi , the Great Old Serpent and the mightiest of all the kami. Konda tore the god-child out of the spirit realm and brought it into the physical world, imprisoning it in a stone disk which he then set up within his inner chambers as a talisman of power. From that day forward, Konda ceased to age. He spent most of his time locked away in his inner chambers, basking in the aura of his divine prize and envisioning a long era of glory and prosperity to come. The Kami War. However, Lord Konda's act greatly enraged the spirits, who turned against the physical world with a vengeance.  The kami began to attack the physical world in an effort to reclaim That Which Was Taken , though most mortals knew nothing of Konda's crime nor understood why their gods had turned on them. Fearful and confused, humanity fought back, but the kami's numbers were endless. And since many spirits who manifested in the physical world could be defeated in battle but still return for future conflicts, it was ultimately a losing battle for the mortals. The war finally ended in its twentieth year when Princess Michiko Konda , with the aid of the black magician Toshiro Umezawa and other allies, managed to free the kidnapped scion (which took the name Kyodai ), and to defeat both O-Kagachi and Lord Konda. The Reito Massacre Battle of Ganzan Pass Battle of Akagi River Battle of Silk Battle on the Sokenzan Plateau Assault on Eiganjo Castle Battle at Kamitaki Falls Razing of Jukai Forest Final Battle at Jukai Forest Lord Konda's breach of the Spirit World, and thus the Kami War itself, was originally made possible by the Great Destruction on the plane of Ulgrotha , which sent shock waves throughout the Multiverse and disrupted the stability between the physical ( utsushiyo ) and the spiritual realms ( kakuriyo ) of Kamigawa. Represented in: Associated cards: Referred to:"}