{"text": "Karona was the manifestation of all Dominarian mana , brought into being by the aggregation of Akroma , Phage , and Zagorka being slain by Kamahl 's Soul Reaper . During her brief existence she further devastated the already war-torn continent of Otaria and disrupted the very fabric of magic on Dominaria . Her abilities stemmed from that of faith, that anything a being could believe of her, she could accomplish. Karona first existed thousands of years before the time of the Thran , in the age when the Numena rose to power. These three wizard-kings spread out from Otaria, conquering all lands they touched until there was no ground that they did not claim. Their dominion lasted for a thousand years and their powers grew to godlike proportions, but in time the three tyrants turned upon one another. During this conflict, their powers accidentally gave birth to the being they called Mother; the living incarnation of magic itself. This magnificent and mighty entity called itself Karona, and the Numena knew that she was a threat of the greatest measure. Laying down their rivalries, they focused on destroying her before she could discover the scope of her full powers. Karona existed for only thirteen months before the Numena managed to destroy her, though the effort cost the Numena both their power and their very lives. Yet even in death, the spirits of the godlike Numena lingered in the void, determined to live again one day - and so too did Karona. The war between Phage and Akroma - accompanied by the Numena's long-awaited return after 20,000 years - triggered the confluence of ancient magic that allowed Karona to be reborn. The simultaneous deaths of Phage, Akroma, and Zagorka at the apex of the battle ignited the cataclysmic blast of magic from which Karona emerged anew, wrought from the fused bodies of the three great women. Overflowing with a power she barely understood, Karona's very existence tormented her. She was plagued by the question of her life's meaning; the chaos Karona caused stemmed from that need to discover her place in the greater scheme of all things. Karona became misguided in her role as magic incarnate, reflecting basic human emotions such as fear, greed, and aspiration. Karona discovered that nearly every creature , human or beast , praised her completely and without hesitation. Karona soon assumed that she must be a goddess due to her phenomenal powers and the praise she received. A misconception propagated by all those who bent their knee to her. The confused Karona attempted to seek out one who would equal her in both status and power - someone from whom she could learn. Karona summoned five portals to search for her equal, each representing a color of magic. Through these portals came those who could not equal Karona - Teferi for white, Lowallyn for blue, Yawgmoth for black, Fiers for red, and Multani for green. Her meeting with Yawgmoth scared Karona - she was told that the only god to exist on Dominaria was Gaea , who was hurt by Karona's presence. Karona began to liken herself to Yawgmoth and decided that if the gods would not accept her, then she would destroy them and assume power. With a newfound sense of identity, Karona sought to follow Ixidor, the mortal avatar of the Numena Lowallyn. Kamahl had enlisted Ixidor's help in convincing the reborn Numena to defeat Karona, and they began their quest at the Grand Coliseum . Here, Kuberr built his new fortunes and faced with Karona's imminent arrival, the three fled to Averru , assuring Kuberr's assistance in once again defeating Karona. She arrived too late to stop the trio, but her very presence led to the destruction of the Grand Coliseum as her worshippers tore the foundation apart in their need to reach the shining goddess. Thousands died as the stones fell upon them and once again, Karona fled the scene. Hours later, Karona arrived above Averru and there in the skies of the city, was a dream-given flesh, a being that was her equal. The being, which called itself Arien, called for her to come near, and new emotions welled within the goddess. Attracted to Arien like a moth to a flame, Karona tried approaching the strange being but suddenly found herself under attack from the three Numena. Unable to escape, Karona endured endless barrages of magical attacks, losing much of her power in the process. Only Kamahl's intervention stopped the Numena's assault. Arien had been a trap concocted by the Numena to bind her to their will, and Kamahl chose to see her banished from their world instead. Karona arrived at the Blind Eternities , which held the pathways of numerous beings throughout history. Desperate to escape this strange place, Karona followed a random path to another plane. Instantly, yellow skies stretched above her. Baffled at her location, Karona asked for help from the locals, and she repeated Gerrard Capashen, a name she had followed to reach this place. The local's reactions were far from welcome as they decried her as being associated with the Cho-Arrim rebels and the \"heretic.\" Terrified, Karona fled by moving to another plane. The next plane was a place filled with floating meadows . The air refreshed the weary limbs of her two disciples, Sash and Waistcoat. A being calling herself Serra came to them, telling the trio that they could not stay there. After explaining their plight, the angelic figure only mused the fact that Karona reminded her of another being named Urza , who had unintentionally caused great damage to the multiverse in his efforts to protect Dominaria against the Phyrexians. Serra's only advice was to remind Karona that she was Dominaria's magic and Dominaria was her true home. Rejected from two planes, Karona planeswalked to the remnants of Phyrexia , which had been decimated by the Nine Titans . Looking at the blasted landscape made Karona think of Yawgmoth and of how she related herself to him by claiming that they had both caused great devastation and been rejected by Gaea. However, the haunting voice of Yawgmoth once again broke her thoughts and he urged her to stay on his plane. Having been warned by Sash and Waistcoat that those words were identical to the ones Arien had used to lure her into the trap, Karona simply left. Once again, she picked another path towards another plane. Here, a plane of bright metal met her. On this plane, she was welcomed by a man. Karona approached the man, and he humbly confessed to being the lowly servant of Lord Macht , the creator of the plane. However, as he was the only person in sight, Karona easily saw through the man's ruse, and she embraced him, knowing him to be Lord Macht himself. He told her of his involvement with the Mirari and the tragedy it had caused, which he felt responsible for. Karona insisted it was not his fault any more than it was her fault for being what she was. Having been freed from his conscience, the grateful Lord Macht transported Karona back to Dominaria. Driven mad by her power, or perhaps by her contact with Yawgmoth, Karona attempted to take over all of Otaria by gathering those who praised her into an army. She wracked the continent with war, destroying entire cities in singular fell swoops, and the number who opposed her rule dwindled. Finally, the only opposition to her draconian rule was the city of Sanctum . Kamahl, who had been instructed to stop Karona by the mysterious Lord Macht, stood against Karona with the Numena and the Mirari Sword in hand. Their stand was to be in vain though, as Karona came into her powers. She killed all three Numena with one mighty spell and Kamahl unwillingly bowed to Karona, disarmed and unwilling to fight, but for his part in the opposition Karona decreed his death. Ironically, it was the two friends Karona had truly trusted that betrayed her: Sash and Waistcoat , the two un-men, pierced Karona's belly with the Mirari Sword as she sought to strike down Kamahl. Both un-men were acting under advice from Lord Macht, who then arrived and revealed his true form. He took Karona away from that place of madness and death to Argentum, his artificial plane. The Mirari sword was removed, and as Karona died her form regressed to the three women whose deaths had recreated her, finally settling into Jeska (formerly Phage), who survived with the manifestation of her planeswalker's spark . Within the storyline fans, there are many questions regarding the exact nature of her experiences with Teferi, Serra, and Yawgmoth. In Teferi's case, in the Time Spiral novel, he told Freyalise he had never met Karona, and when doing so, she saw him as a god of white mana , which isn't Teferi's main domain. In Yawgmoth's case, in the Planar Chaos novel, Lord Windgrace told Karn he had made sure that Yawgmoth was truly dead after the Phyrexian Invasion , and therefore he couldn't be alive to meet Karona. In the Homelands comic, Serra wasted away, having chosen death over life without her beloved Feroz . Most fans agree that these contradictions are either explained by her precarious state of mind, that she created these hallucinations herself, or that Karona met with alternate-reality versions of these various characters. In the Legions novel, her name was misspelled as Karo m a. Associated cards: Depicted in: Quoted or referred to:"}