{"text": "Keld is a warrior nation in the western and northern parts of Aerona 's cold Icehaven subcontinent on Dominaria . The Keldons are known and feared as conquerors and mercenaries . The people of Keld are human , but they are like no other humans anywhere. Nearly all adults stand over six feet tall, and seven feet are not uncommon. Keldons are remarkably resistant to the cold of their homeland. They are massively muscled and have gray skin (ranging from ashy gray-white to deeper blue-gray). Their hair points sharply down in the middle of the forehead and at either temple but recedes elsewhere. Keldons value self-reliance, strength, and courage. At best they are proud, pragmatic, and passionate. At worst, they can be reckless, hot-tempered, and violent. Though they are often perceived as a horde of brutish, unthinking barbarians, a threat to civilization in all its forms, they have a deep and rich culture that goes back many centuries. Having endured devastation on a massive scale and lived through their own prophesied apocalyptic judgment, today's Keldons ﬁght to be worthy of their glorious ancestors, their unforgiving home, and their strongest champions. The warhost has long been the basic unit of Keldon society, consisting of anywhere from a few dozen Keldons to thousands. The warlords rule through strength and unity. By the power of Keldon magic, each warhost's loyalty and zeal empower its warlord. The leader of Keld is the Grand Warlord. Before the Twilight, the warlords held the title of Doyen . Nowadays, the two roles are separated. In the more civilized areas of central Keld, doyens are appointed by the Grand Warlord to settle civic disputes, while the warhosts still choose their leaders. Overseers are appointed by the Grand Warlord as her liaisons to warhosts. The Book of Keld is an ongoing, multi-generational archive of prose narratives, poems, battle reports, council meeting minutes, and genealogical records chronicling the nation and peoples of Keld. Two key chapters are Born of the Flame , telling the story of the birth of Keld, and The Twilight of Keld , concerning the place of the honorable dead and their triumphant return for the final, eternal battle for Keldon supremacy. For most of Keldon's history the prophecies of The Book of Keld were held as sacred religious texts, inspiring a military culture where only the strong survive. Many Keldons sought to gain glory in life and fight in the eternal battle at Twilight. In a post-Twilight world, many Keldons no longer see religion as the place to find answers. Even so, traditional shamans retain an important place in the warhosts. After the atrocity of the Twilight, necromancers are shunned in Keld. With the aid of the Skyshroud Elves , some Keldons have grudgingly become farmers, while many have always been herders. Most of Keld's food is imported, these days mostly through trade instead of plunder. Keld's exports are mainly steel and leather. The colos remains a key part of Kelds identity, producing milk, meat, and leather as well as serving as a mount in battle. Keldon megaliths. Art by Phillip Straub. The original Keldons came over from Parma led by Kradak to escape the cold. The mountain called to Kradak and where many turned back, Kradak continued to the very summit of the mountain where he forged a bond with the land. Thus Kradak became the very first Doyen. Using his mastery of the land, Kradak was able to cast fire magic to warm the Keldon stragglers. Jezal, the leader of these stragglers, made a pact with Kradak. Thus was the founding of Keld. A human of Keld. Art by Paolo Parente. During the time of Urza 's bloodlines experiments on Tolaria , a rogue student of his named Gatha started doing his experiments in Keld. Originally seen as weak, Gatha gained the support of the Doyen Kreyohl and was able to carry out his work in peace. His experiments transformed the Keldons into nightmarish warriors, the mightiest of which was the witch-king Kreig . However, the Phyrexians eventually caught wind of Gatha's work and invaded Keld. The researcher threw himself off a cliff to prevent the Phyrexians from discovering his secrets. Inspired by his friend's heroic sacrifice, Kreig grievously injured the Phyrexian general before tossing himself off the same cliff in defiance of his foe. The loss of Gatha and Kreig left a great power vacuum in Keld. The true-blooded Keldons regained control of the Doyen Council and made war on the Gathans. This period in Keldon history is vaguely referred to by Doyenne Tajamin as the Gathan Wars which destroyed the Gathans. On the eve of the Phyrexian Invasion of Dominaria, the Keldons launched their invasion of Jamuraa. The campaign was led by Overseer Latulla and Warlord Druik, who convinced the Keldons that northern Jamuraa was once a part of the Keldon empire. Latulla was seeking Hero's Blood that was needed to raise the honored dead that resided in the Keldon Necropolis . The Keldons' first target was Kinymu , a member of the Ki'pamu League. The initial raids were short and brutal: Keldons destroyed entire villages, routed the defending troops, and took large numbers of hostages. Latulla ordered the construction of a permanent Keldon settlement to begin on Jamuraan soil, and the league desperately massed its soldiers and weapons near the settlement site to keep the raiders contained. Without a strong central commander, however, the league suffered loss after loss as Latulla tightened her grip on the coastline. The Keldons even went so far as to begin a basic mining operation to steal the league's resources for their own. Meanwhile, Latulla continued to take hostages and retained the services of Greel , a mutated man whose life-draining powers both fueled Latulla's artifacts and terrorized her enemies. On Teferi 's authority, Barrin traveled around the league reorganizing its overall strategy and troop deployments and establishing a program of powerful aerial escorts for league shipping convoys. He also took the field alongside the league's premier general, Mageta the Lion, to maximize the league's gains and minimize its losses as the destructive war dragged on. Because of the heavy use of war machines on both sides of the conflict, Rayne was brought in to apply her exceptional skill with artifacts on the league's behalf. Jolrael , a powerful wizard and longtime friend of Teferi's, also contributed to the league's cause. The Doyen Council did not support her actions, and when Latualla and her followers marched on the Necropolis, Latulla was defeated by Doyenne Gorsha and Druik was killed. Latulla and her remaining followers were banished back to Jamuraa where they were eventually defeated and destroyed by the planeswalker Teferi and Barrin the Master Wizard. Many Keldons saw the coming of the Phyrexian Invasion as the fulfillment of the long-prophecized Keldon Twilight . Skyshroud forest overlayed in Keld and Eladamri the Elflord made peace with Warlord Astor of Keld. The battle took place on a frozen lake and was incredibly fierce. In the heat of battle, the Keldon honored dead were raised from their graves not by Twilight, but by Phyrexian necromancy. In this time of greatest atrocity, Doyenne Tajamin cast her sacred cudgel into the frozen lake, shattering it into a thousand pieces. The majority of both armies were sunk beneath the icy water. It was at this time that True Twilight occurred. The sacred ship the Golden Argosy sailed forth from the Necropolis and saved many Keldons (essentially bringing them back from certain death). The Argosy then bore them off to Urborg where they fought in the final battle of the Invasion against Yawgmoth and his forces. Keld, like all of Dominaria, was devastated by the time rifts . The red mana that the Keldons depended on for their fire magic and their survival was no longer easily accessible. Time rifts opened, releasing numerous hordes of Gathans from Keld's past. The dwindling population of true Keldons, outnumbered and starving, were overwhelmed by the Gathans and destroyed. Radha , the last descendant of the great Keldon hero Astor, led a resistance against the Gathans. With the help of Teferi , she became a great warlord in her own right and was able to defeat the Gathan Doyen Greht. She then led a campaign to once more purge the Gathans from Keld. After her victory, she attacked Keld's long-held enemy of Parma. With the sacrifice of the planeswalker Freyalise and the destruction of the Skyshroud forest, Keld's rift was finally healed allowing the nation to start the long road back to recovery and prosperity. Radha adopted many of the Skyshroud refugees, intent on turning them into true Keldons. Three and a half centuries after the Twilight, Keldons still struggle to understand what it means that they lived through it. Radha has quietly revolutionized Keld. The taking of slaves as plunder has been abolished, and Keldons now learn industries and crafts. Along Keld's warmer southern coast, some Keldons have even settled in permanent villages devoted to mining and smithing, though most remain at least partially nomadic. However, there is a growing feeling, particularly among hotheaded youth, that Keld has become too safe and has lost touch with its heritage. A prominent leader of this faction, and a possible challenger of Radha, is Garna , called the Bloodflame. Garna is a vicious, violent and xenophobic warlord from the frozen western shores of Keld, who has assembled a warhost of over a hundred Keldons who share her devotion to the old ways. In 4561 AR , there was a peace summit at Oyster Bay between the Keldons, led by Radha, and the Benalish led by Aron Capashen to end hostilities in the Ice Rime Hills . The summit was interrupted, when the planeswalkers Karn and Teferi revealed the threat of a New Phyrexian invasion and several of the Benalish knights turned out to be Phyrexian sleeper agents . The exact border of Keld has changed through the years. In some areas of south-central Keld and the warmer southern coast, nomadic encampments of old are slowly transforming into more permanent villages and cities. Recently, Keldons have also begun establishing settlements along the western coast of Northern Aerona . The Keldon Necropolis , resting place of all honored warriors The Skyshroud Forest (after the planar overlay). The Western Reaches The Mountain . A lone volcano and sacred peak. Agderisk . A port city on the southern coast. Astor : Warlord and later Doyen, sire of Radha, a great hero of Invasion Druik : Keldon Warlord during Jamuraan Campaign Fenrey : Great hero, slaughtered last of Goblins in Keld Garna , the Bloodfist. A rival of Radha. Gorsha : Doyenne and Speaker of the Council Greht : Gathan Doyen and leader Jezal : First Doyenne. Made the covenant with Kradak Lairsen : Doyen during Invasion Kradak :  First Doyen and founder of Keld Kreig : Doyen and Witch-king, mightiest Keldon ever Kreyohl : Doyen, friend of Gatha. The first to be interested in his bio-engineering. Latulla : Overseer of Jamuraan Campaign Maraxus : Renegade warlord, likely Gathan because of pale skin and uncontrollable strength Olvresk : Doyen, leader of Council at time of Invasion Radha : Warlord, current leader Tajamin : Doyenne, Keeper of the Book of Keld Trohg : Witch-king, Doyen, father of Kreig. The grandson of Kreyohl and a friend of Gatha. He was the first in his lineage to have his children enhanced before their birth. Valduk : Keeper of the Flame Varagh : Doyen from Kreyohl's time, opposed to Gatha Varden : Doyen opposed Kreig and Gatha. He got enraged when Gatha concluded his children were unfit for “the Gift” (bio-engineering). He wanted to fight but was defeated by Kreig. After Kreig killed Varden and usurped what was left of his war host no one ever dared to challenge his might again. Quoted or referred to: Keldons depicted, quoted, or referred to: Wildlife of Keld: Keld Triumphant : The Flame of Keld :"}