{"text": "Killian Lu is a human mage -student in his second year at the Silverquill College at Strixhaven University on Arcavios . He is called Killy by his friends. Killian has handsome features, a sharp jaw, and his immaculate midnight black hair might immediately draw the eye - not to mention the always-dashing monotone suit - but his implacable determination and work ethic have endeared him to both his peers and Strixhaven’s faculty. His Inkling is called Doco . Some might say that pressure is a direct result of having the Silverquill Dean, Embrose Lu , as a father. A master poet, Embrose is reportedly a stern man who drives his son to graduate at the top of his class. Enacting rigid discipline and an ever-watchful eye to catch any of Killian’s mistakes, Embrose is quick to remind Killian of the lineage of inkmasters that comprise the Lu ancestry. Killian’s failures are his father’s failures - and that of the family, by extension. Weakness in any pursuit is simply not an option. Killian trained in secret to address his shortcomings and only ever displayed detached professionalism for his fellow students and teachers. Whether due to his father’s constant vigil or his desire to master both the light and dark elements of Silverquill’s trademark magic, Killian vowed to only ever make a mistake once. If only he didn’t find the light so difficult to embrace. Angry at being unfairly sentenced to Detention Bog by his father , Killian accidentally disrupted a resurrection spell of the dryad student Dina with a wayward bolt of ink magic. The unwanted result of this coincidence was a colossal living swamp creature with a dark heart that started to destroy all living things and took off for Strixhaven as it was being lured by its magic energy. Working together, Killian and Dina managed to defeat the monster, but the Silverquill student was fatally injured. Sacrificing the last remains of the resurrection spell in her blood, and the hope of resurrecting her glade, Dina cured her newfound friend. Driven by his father to become an eloquencer, using only black magic, Killian began to despair of being ever found worthy. Tempted by a fellow student, who was an Oriq agent in disguise, he drank a potion that shut out his empathy and almost drove him into the hands of the secret mage organization. However, with the help of Doco he just in time learned to use white magic. He applied this knowledge immediately when he and his fellow students came under attack by mage hunters . By saving the day, he finally found the begrudging approval of his father. When New Phyrexia's Invasion of the Multiverse started, the Phyrexians quickly burned through the defenses of Strixhaven. Professor Vess tasked a small group of surviving students - Killian, Zimone Wola , Rootha Squallheart , Quintorius Kand and Dina - to search for the Invocation of the Founders in the Biblioplex. On the way, Embrose arrived to fight off the full group of compleated faculty, much to Killian's distress. The group found it and with a representative from each school they could activate it, but the compleated Nassari distracted Rootha enough that Quint could only try to make up her contribution with raw magic and lifeforce. The result was not entirely successful, and in the process, Quint's spark ignited and he planeswalked away. Though the invocation managed to repel the main wave of attackers, the students were wounded and Quint was missing. To Killian's relief, Embrose survived his ordeal and the Lu family remained intact. Killian appears in the trailer for Strixhaven: School of Mages . Depicted in: Quoted or referred to: ↑ a b c Marcus Terrell Smith (April 30, 2021). \" A Silent Voice Calls \". magicthegathering.com . Wizards of the Coast. ↑ Harless Snyder and Natalie Kreider (July 3, 2023). \" March of the Machine #25: Arcavios — A Radiant Heart \". The Magic Story Podcast . ↑ Jay Annelli (March 25, 2021). \" Killian's father is a dean at Silverquill. Is that Embrose? \". Archive Trap Mini . Tumblr. ↑ Chase Carter (March 24, 2021). \" Here’s an exclusive first look at Killian Lu, a new character in Magic: The Gathering’s upcoming Strixhaven set \". Dicebreaker.com. ↑ Fox Allison , Doug Beyer and Ari Zirulnik (April 13, 2021). \" The Legends of Strixhaven \". magicthegathering.com . Wizards of the Coast. ↑ Reinhardt Suarez (April 9, 2021). \" The Chains That Bind \". magicthegathering.com . Wizards of the Coast. ↑ Evelyn Teng (March 20, 2023). \" March of the Machine - A Radiant Heart \". magicthegathering.com . Wizards of the Coast. ↑ Welcome to Strixhaven! (Video). Magic: The Gathering . YouTube (March 26, 2021)."}