{"text": "Kiora is a merfolk planeswalker who made her debut in Duels of the Planeswalkers 2012 . Kiora loves the seas, above all else, finding them beautiful and full of mysteries to discover. In a bid to protect her world, she traveled the planes, seeking ways to increase her control over the seas, thinking the creatures within could stop the menace that threatened to consume all she knew. Kiora is fierce, fighting relentlessly to protect her home and the landwalkers of the plane, although she knew them not. She could be somewhat rash, unwilling to listen to Jace about their method of eliminating the Eldrazi titans, and almost ruining the plot altogether. However, she wasn't above feeling shame for her own faults. Kiora is primarily centered in blue and secondary in green . When she planeswalks, she vanishes in a fine mist. Kiora was born on Zendikar , a couple of decades before the Return of the Eldrazi . She had a younger sister, Turi . One time, when they had been exploring too far out, a serpent had cruised up out of the darkness to swallow them. Kiora had darted out in front of it, got its attention, and shouted for her sister to swim hard and not look back. Turi had looked anyway, and her panicked face was the last thing Kiora had seen before the serpent's jaws closed around her, and the world dissolved. In that moment of boiling panic, her planeswalker's spark ignited. When she'd finally gotten back, she'd made a promise to Turi to always return home. Kiora venerates the huge monsters of the sea, such as the leviathans , krakens , and other denizens of the inky depths. For her, these creatures embody the ability to withstand any persistent force: time, water, predation, and darkness. She seems calm and wise, but her dreams are as bizarre and alien as the depths from which her creatures rise. After the Eldrazi began to roam free on Zendikar, Kiora fled, seeking some way to raise enough power to defeat them, believing once more that the masters of the depths are the only creatures strong enough to repel the aetheric parasites. She has traveled from world to world, harnessing the powers of the oceans and gathering as many of its inhabitants to her as possible. In her travels, she made landfall on the shores of Theros and immediately called a gigantic tsunami to her, hoping to attract the attention of the deep dwellers. It struck the polis of Meletis and caused untold destruction, but she had little concern, only caring if her beacon had been answered. In some ways, it was successful, but it also attracted the Tritons , Theros's native merfolk. They believed Kiora to be an avatar of Thassa and she did little to dissuade them of that opinion, secretly enjoying the attention. Kiora's Power Trading on local legends, she created one for herself, borrowing identities as needed as she amassed power. One such facade she adopted was that of Callaphe , the legendary mariner said to have sailed into Nyx itself. It was this lie that brought her path across that of Ajani Goldmane and Elspeth Tirel . The pair sought out Callephe for her skills, trusting her ability to bring them to the Temple of Mystery , the ancient tree at the edge of the world. Kiora agreed to do so, but for purposes she wasn't forthcoming about, dismissing it with a wall of good cheer. She led them along for the ride as she pursued her own agenda, never letting it slip that she was not who she said she was. The truth finally came out shortly after they set off, as Kiora brought them to the sunken city of Arixmethes . It was no city at all, in truth, but a massive kraken upon whom a city had been built. The god Thassa would not allow Kiora to take the beast from her but first assisted Elspeth and Ajani in their journey. The pair taken care of, Thassa turned her attention to Kiora. After a fight involving many sea monsters and kraken (some of them summoned from other planes), Kiora escaped mostly unharmed and clutching Thassa's magical bident Dekella . Kiora restraining the Eldrazi After recovering on her homeplane and seeing the destruction caused by the Eldrazi, Kiora was joined by a couple of Cosi's Tricksters and began to assemble an army of merfolk and sea monsters. When Gideon Jura began the Liberation of Sea Gate, Kiora arrived with her reinforcements which bolstered their lines and assisted in driving the Eldrazi back. She met Gideon himself face to face and cockily asked if he had brought an army to assist her in retaking the city. A spluttering Gideon responded in kind as they both declared the leadership of two different armies. After revealing her status as a planeswalker they teamed up and continued the assault. After 2 more days of fighting, they had retaken Sea Gate. Gideon then called a meeting with his closest advisors and commanders of the allied forces (the human Tazri , the kor Munda , the vampire Drana , and the elf planeswalker Nissa Revane ) which Kiora joined as well. Minutes later, Jori En came warning them of Ulamog's arrival. The Planeswalkers enacted a bold new plan. While Gideon's troops and Kiora's forces held the city against this fresh assault, Nissa called on the elemental power of the earth to raise sunken hedrons from the ground and move them into a ring around the Eldrazi titan. Jace activated the hedrons' magic, and Ulamog was trapped! Then everything collapsed. Ob Nixilis appeared, having followed Nissa from Bala Ged . He destroyed the hedron network and awoke the slumbering Eldrazi titan Kozilek . Kiora just had summoned the giant octopus Lorthos in an attempt to retake Sea Gate from Ulamog's brood. However, upon reaching the city, they were faced with not one, but two Eldrazi titans. As the monsters saw each other as threats due to their immense sizes, they began to battle; however, this fight did not last long, as the titan destroyed Lorthos by slicing it in half using its arm blades. It then turned its attention to Kiora. The planeswalker's last coherent thoughts were that in her arrogance to become a hero in her own story she had forgotten a key aspect of her childhood Cosi stories: Cosi and no one else, ALWAYS won in the end. Kiora helps combat the Eldrazi. Jori En found the wounded Kiora amidst a mass of dead sea creatures. After battling Kozilek's brood and goblin dark-dwellers together, they retrieved Kiora's bident. Kiora then assisted the newly formed gatewatch in their plan to draw the bulk of Ulamog and Kozilek into the plane so that their energy could be dispersed into Zendikar, killing them in the process. While the plan worked at first, with Gideon keeping the Eldrazi swarms away from the army, Kiora clearing out any other swarms and Chandra supporting them, once the Eldrazi titans were anchored to Zendikar, their destructive essence threatened to assimilate Zendikar into themselves. Afraid, Kiora tried to persuade Nissa to release the Titans and allow them to flee, but Jace objected. Chandra offered to burn the Titans instead and after preventing Kiora from attacking Nissa, Jace agreed. The pyromancer then connected with the animist, allowing her to channel her pyromantic magic through Zendikar's Ley Lines directly into the titans. In one brilliant blaze of flame, Ulamog and Kozilek were incinerated and destroyed, leaving only ashes raining from Zendikar's sky. Realizing she had failed the team at the last moment, Kiora left on her own. “When your enemy flees, send the sea to pursue them.” Kiora traveled with the Gatewatch to Ravnica for the final confrontation with Bolas, and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . During the invasion, the trapped planeswalkers (including Kiora) got together with Ravnican leaders to strategize. Dack Fayden managed to touch Kiora's bident, hoping to copy the divine artifact's powers with his psychometric ability. She caught him, and the attempt made him look like he regretted his decision. She was one of the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. She declined to visit Theros again to pay respect to Gideon, being persona non-grata on that plane, and opted to return to Zendikar instead. As New Phyrexia's Invasion of the Multiverse began, Kiora returned to Zendikar , both to defend her home plane and because she felt her advantage would be greatest on familiar ground. In the aftermath of the Invasion, she lost her spark in the Great Pruning . Kiora was originally named \"Kiora Atua.\" Parallels were drawn with the Maori because in Maori, \"Kia ora\" is a greeting (meaning \"be well\") and Atua is the Maori word for \"god\" or other similar terms such as \"ancestor\" or \"spirit\". However, this connection between the planeswalker and the Maori was not intentional. In January 2014, it was announced that \"Atua\" would be dropped from her name as it was considered inappropriate and offensive by Wizards, as it disrespectfully treads on sincere beliefs. As it stands, Kiora has no official last name. However, the name briefly reappeared on the box of her Funko Pop! Vinyl Figure. In the video game Magic: The Gathering Arena , Kiora is voiced by Kari Wahlgren . A clownfish and a blue tang can be seen in the left corner of Kiora, the Tide's Fury , a reference to the movie Finding Nemo . Bident of Thassa - Stolen from the goddess Thassa of Theros , greatly increases her ability to manipulate the sea and the creatures residing within. Theros Zendikar Ravnica Associated cards: Depicted in: Quoted or referred to:"}