{"text": "Lieutenant Kirtar was an Aven leader of the Order on Otaria ( Dominaria ). A proud and arrogant warrior, Kirtar died fighting off the advancing crystals he had created after using the Mirari in the Order's Citadel. Unlike most of the Order, Kirtar gladly participated in the Cabal 's pit fights. He believed that the best way to show the virtues of the Order's beliefs was to participate in the fights and use each of his victories over the other contestants, particularly the Cabalists, as demonstrations of the Order's strength. His fighting skills and protective white magic earned him many such victories. Kirtar had traveled to Cabal City for its largest-ever tournament up to that point, where the treasure troves of the Cabal would be opened up to the victors. Hoping to claim a powerful artifact for the Order to destroy, Kirtar competed alongside other pit fighters such as Kamahl , Seton , Chainer , and Turg and was one of the favorites to win the contest. However, when the city was attacked by a Krosan dragon , Kirtar found himself having to lead the shambolic defense. He led his fellow aven warriors as well as the cabalists and Laquatus 's troops in a counterattack but was forced back until Kamahl appeared and used his fire magic to burn away the rampant growth that protected the beast. Eventually, Kamahl killed the dragon, but as the barbarian was buried beneath its corpse, it was Kirtar that received the reward, a reward that would dominate the rest of his short life. Kirtar initially showed contempt for his reward by letting one of his subordinate warriors choose his prize but was surprised when the warrior returned with the Mirari. As soon as Kirtar laid his hands on it, the mysterious orb let loose a burst of power that called out to all onlookers, making apparent the power the device possessed. Kirtar was overcome by the power the device offered him, seeing it as a way to bring the Order to glory under his leadership. With his prize stashed away safely, Kirtar left the city for the northern plains , where beast attacks were threatening multiple villages. The lieutenant and his men arrived to find creatures of Krosa running rampant. After repelling the initial threat to the villages, Kirtar decided to take the initiative and attack the forest itself in order to slaughter any dangerous animals. This was an enormous commitment and soon his troops were exhausted as the beasts and druids of the forest rushed to its defense. However, Kirtar fought on tirelessly, bolstered by the Mirari's influence. As his campaign drew on, Kirtar was joined by Laquatus, who had pursued the lieutenant all the way from Cabal City. The Mer ambassador had met the Lieutenant before during the dragon attack and had implanted false memories of friendship in the aven's mind, so Kirtar welcomed him, oblivious to the ambassador's intent to steal the Mirari for himself. Kirtar was also joined by Captain Pianna , the commander of the Northern Order. She had come to investigate what Kirtar was doing in the forest and was horrified by the slaughter, by the state of Kirtar's soldiers, and especially by Kirtar's obsession with the Mirari. She ordered Kirtar and his men to withdraw back to the Order's citadel. At the citadel, relations between Kirtar and Pianna got steadily worse. Kirtar believed Pianna was being narrow-minded in not seeing the Mirari's potential and was a coward for forcing him to retreat from Krosa. He organized a coup by the aven in the Order and went to confront Pianna herself. Demanding that he be given command of the Order, Kirtar used the Mirari on Pianna, creating a wave of crystals that engulfed her. However, the spell expanded out of control, siphoning power out of Kirtar as it spread across the whole citadel. In vain, Kirtar repeatedly tried to stop the crystal's spread as his loyal soldiers tried to get him to safety until Turg appeared out of nowhere and stole the orb from the aven's weak grasp. As he lost touch with the orb, Kirtar faded away to nothing as the spell drained away his very essence to feed itself. Associated cards: Quoted or referred to:"}