{"text": "Kobo was a human apprentice of the ogre shaman Hidetsugu on Kamigawa . Originally a budoka monk , who wanted to became a yamabushi , a kami -killer, Kobo left his monastery in Jukai and wandered to Sokenzan in hope to find a yamabushi master who will teach him. The yamabushi elders, however, refused to take a budoka into apprenticeship. Rejected by the shamans and forbidden to return, he met the ogre shaman Hidetsugu, who was looking for an apprentice. Over five years, Kobo endured a great deal of the ogre's abuse necessary for his training. His face bore countless marks of the ogre's hard methods, misshapen by many fractures and badly healed wounds. Hidetsugu trained Kobo in the ways of ogre blood and chaos magic. The young man looked like a small giant ; he was broad, muscular, with supernatural strength compared to human. This was partly a result of Hidetsugu blood-and-flesh rituals, where the youth tasted Hidetsugu's flesh and was imbued with some of his strength. When Toshi Umezawa came to Hidetsugu seeking help, the ogre performed a ritual when Kobo joined the Hyozan Reckoners ' gang. He then sent the youth with Toshi, in order to gain some \"field experience\". He and Kobo should go to Jukai, to ask Kobo's former masters about the meaning of their recent experiences with kami. Together, Toshi and the ogre's apprentice defeated three kami minions of the Myojin of Infinite Rage . Then, they met Princess Michiko Konda and her party. In the fight that followed, the parties were attacked by orochi ; Kobo fought valiantly and killed many of the snakefolk. In the end, however, he was overwhelmed by their sheer numbers and poison . The snakes tied him to several trees as a warning for those budoka who would to choose like him and leave the forest. The wizard Choryu abused the situation to drown Kobo with a river of water aimed to his helpless face, afraid of his great might. His death was eventually avenged by Hidetsugu who tortured Choryu for months, destroyed Minamo School , attacked Oboro , and consumed Mochi , because they were responsible for Choryu being with Princess Michiko's party."}