{"text": "Koth of the Hammer is a red aligned vulshok human former planeswalker from Mirrodin . His specialty is geomancy, spells that move mountains, shatter stone, and melt iron. He lost his spark as part of the consequences of New Phyrexia's Invasion of the Multiverse . Koth is an imposing, dark-skinned Vulshok man whose body is plated with stony armor. His voice is deep, rough, and rumbling. His center is in red mana. Koth's geomancy has a special strength that allows him to purify metal given the unique nature of his homeland. His ability to purify ore reflects Koth's desire to bring peace and harmony to his people. Koth is a passionate leader of his people, but he is also wise for his years, taking counsel before rushing headlong into action. But if action is called for, Koth is a decisive man of few words and can bring a mountain down on top of anyone who dares to threaten his home. He can turn his stony armor white-hot as he activates it and feed heat into metal. Koth was born as a member of the Hammer tribe, though his parents hailed from two different tribes, making him what is known as an alloy among the vulshok. His planeswalker spark ignited when the tribes of his once peaceful people fell into open war for the first time in generations. The metal they had traditionally mined from the mountains of the Oxidda Chain became strangely corrupted; the ingots forged by the Anvil tribe turned brittle and inconsistent. Each tribe blamed the others for the weakness of their sacred ore and old hatred began to reemerge. Koth believed he could use his ability to purify the ore, and with Koth's help, the solidity of the metal was restored and the skirmishes between tribes slowed. Koth's Powers When the Phyrexian corruption invading Mirrodin became obvious, he branded their insignia on his arm as a promise to his people to save them. So began his planeswalking journey. A mysterious man pointed Koth towards Urborg and The Heroes' Memorial , where the sages helped him, though initially, they distrusted him. While on Urborg, he entered the gladiatorial pits where he fought Elspeth Tirel . He refused to fight back, but when Elspeth saw the mark of Phyrexia on his arm after a lucky strike, she tried to kill him in a blind rage. She was stopped by the timely intervention of Ajani Goldmane who had come looking for Elspeth. Soon afterward, Koth told Elspeth of the Phyrexian invasion taking hold of the plane. Together the next morning, Koth took Elspeth to a ruined structure called The Tomb of Flesh. They talked of their homes, of the places they cherished, and once more Elspeth lamented Bant's fate. Koth used his geomancy to create a bridge of stepping stones to the tomb, using his demonstration as a chance to offer wise counsel to the tortured young woman. Elspeth conjured a light once they reached the entrance of the tomb. Koth saw nothing within the ruin but Elspeth, terrified and chilled, fled from the dark corners of the world only she can see. Koth found her once more at the ruins of a castle and asked her to come with him to The Heroes' Memorial. Once there, he gifted her with gems, telling her to trap her fear in them, but she simply said that the past is not so easily forgotten. Here in the temple, Koth communed with the stone altar and learned only one thing: They must find a man named Venser . The artificer was not hard to find, being a long-standing target for Windgrace Acolytes who tended the memorial. The pair went to see Venser, and Koth was shocked to find a Phyrexian vessel being rebuilt, improved in fact, to act as a planeshifting ship. When it became obvious that Venser had no idea of the powers he was meddling with, Koth flew into a rage and encased his head in a stone mask, coercing him to walk to Mirrodin. Venser needed to see the threat he was unwittingly toying with and what it had done to Koth's home, and for that reason, Koth would do anything to make him fight. Koth took his allies to the lands he called home. Despite his dire warnings, the pair saw nothing particularly threatening, and Venser continued his tirade against the geomancer. Koth broke off his argument with Venser long enough to tell the foreigners of the conflicts raging across the surface, and of the dark threat that corrupts the plane itself. Koth used his power to ferry the pair across the world in search of an old friend to help him tell them of their true enemy, but what he found was the surprising spread of the Mephidross , stretching farther than he could have expected when he left. The trio found something other than Koth's acquaintance, a shambling corpse that attacked as soon as it sensed the group. The allies quickly fought off the nim , but once again Elspeth became sullen and withdrawn, and with a doleful sigh, she told the arguing walkers that she could not go any further. Unfortunately, without her warrior's expertise, Venser and Koth fell quickly to a Corrupted Harvester and were dragged back to its lair near Ish Sah . Koth awoke under harsh lights and strapped to a table next to his reluctant ally. He quickly freed himself, but could not awaken Venser before the Phyrexians came. He valiantly fought them but was overpowered until Elspeth's sudden reappearance. With her help, the trio subdued their captors and proceeded to the Black Lacuna. Venser teleported inside for recon and Koth declared his confidence that it will all be over soon, knowing nothing of the forces massed inside the Vault. Koth and Elspeth Elspeth, Venser, and Koth traveled to the Vault of Whispers, where they witnessed the emergence of a Phyrexian army that was invading the surface. During their observation, Elspeth froze when being in such proximity to the Phyrexians brought back memories of her captivity, and was almost captured. After several hours, the army passed, and the three companions entered the Vault, following a Myr secretly sent by Tezzeret to guide them. It led them to Geth , and in secret, they followed it into the interior of the world. They came upon a butchering room in which they engaged massive Phyrexian butchers. Elspeth slew many, but they were outnumbered and had to flee. They managed to escape further into Mirrodin's underground through a meat shaft. When they emerged from the shaft, they encountered Ezuri , the leader of a band of Mirran rebels. While Venser insisted that they had to continue onward to find Karn, Ezuri said that he could allow them to go no further. He revealed that the Phyrexian invasion had benefited him greatly, catapulting him into a heroic leadership position that he was loath to give up. But when Elspeth threatened Ezuri, and Venser displayed a bit of his magic, the elf backed down and his followers fled. The companions continued further toward Mirrodin's core, eventually being met by Tezzeret. Tezzeret led the companions to a surgery room, where Elspeth, angered by the sight of Phyrexians experimenting on creatures, flew into a rage, slaying all the Phyrexians in the room in a matter of moments. They freed Melira , a Mirran born without any metal on her body, from the cages. Tezzeret said this was his gift to them; she was completely immune to phyresis . During the subsequent travels, Elspeth grew very protective of Melira. They began traveling back towards the surface but were surrounded and attacked by a massive force of Phyrexians. During the battle, Elspeth was the center of the Phyrexians' attention, slaying most of them and creating piles of dead around her so high that the other companions lost sight of her. Geomantic Powers. The companions eventually reached the furnace layer, where the Phyrexians ignored any Mirran survivors and found Ezuri's rebel camp. There they were welcomed, despite their previous encounter, and Melira's ability to heal phyresis was discovered. She healed all those in the camp that were infected by the glistening oil , healing non-stop for several days while Elspeth sat with her in the tent, speaking to her. Once everyone in the camp was healed, a council was called in which Ezuri, hoping to become more influential, invited Melira to stay with them, while subtly telling the companions to leave. Melira said she would leave with the companions, however, and Elspeth and the others prepared to leave for the core to try to find Karn. While they were leaving, the camp was attacked by Tezzeret's Phyrexians, and the companions found a guide to take them further. They escaped the battle and followed the guide, who only Elspeth trusted. They followed the guide deep into Mirrodin's core, encountering many strange rooms and caverns. At one point they did battle with two strange Phyrexian angels. Elspeth killed one with a throwing knife and the other she decapitated while it attacked Venser. During the battle, Koth got angry at their lack of progress on the surface war, took Melira, and left, leaving Venser and Elspeth alone with the guide. They hurried after Koth but were ambushed by Tezzeret's Phyrexians. The Phyrexians carried the Planeswalkers away, but while their captors were trying to figure out how to access a doorway, Koth and Melira reappeared and freed the pair. By the time the Phyrexians realized that their captives were gone, the companions were already running. Venser's strength, however, was wearing thin, and they were forced to stop. He was able to concoct an explosive from the metal on the walls and blow up part of the tunnel, sealing it temporarily, but it was only a matter of time before a group of Phyrexians, led by Glissa, broke through. While she was taunting them, Tezzeret appeared, and his forces did battle with Glissa's, allowing the companions to escape and reach Karn's throne room uninterrupted. There, they found Karn corrupted by the Phyrexian oil . Melira told the companions that his heart was corrupted. Venser told the others that he was already dying and had been for years and that he was unlikely to last much longer. With his last strength, Venser gave his life and spark to Karn, curing the golem. Cured and lucid once again, Karn spoke with Elspeth, who told him that he could not kill all the Phyrexians. Karn replied that he knew, and that is why he needed their help; He asked them to begin organizing and leading the resistance with Melira to try to cleanse Mirrodin, no matter how long it would take. With purpose, and ready for the long battle ahead, the group left the throne room and headed back toward the surface to begin their war. Surviving the Phyrexian Arena. Unfortunately, nothing could stem the tide. The resistance only survived because of the infighting between the praetors, but this respite could not last. Slowly, Elesh Norn gained more influence, even in the furnace layers, effectively conquering Urabrask 's and Sheoldred 's domains. The resistance learned that the praetors, along with the traitorous Tezzeret, prepared to gather in the throne room to select a new Mother of Machines (Or Father.) It was very possibly the last chance to strike out at the praetors, and make a final show of defiance, no matter how hollow. Elspeth and Koth took a large force to attack the praetors with a very powerful spellbomb, preparing to make a final stand. However, the mission was compromised almost as soon as it began. They fought valiantly but lost warriors in great numbers while the Phyrexian hordes seemed endless. At last, Elspeth and Koth were the only two left, having made it to the heart of Norn's domain. Koth erected rudimentary defenses and prepared to set off the bomb, ready to sacrifice himself... but was not ready for Elspeth to die with him. He told her to go, but she did not budge, so he used his magic to sink her into the ground and create a shield against the blast, giving her only one option to escape. She planeswalked away as the spellbomb detonated, leaving Koth's final fate unknown to her. Koth escaped alive into the bowels of the furnace layers. He hopes that the Mirran resistance can one day overthrow the Phyrexians, and works with Melira to protect those who remain. Later, Koth was captured by the Phyrexians. He was sent to the Dross Pits and forced to fight in Sheoldred's Coliseum. Although he escaped, the experience forever changed him. After the second Phyrexian Invasion of Dominaria and incursions of the Phyrexians on other planes, the Gatewatch decided to bring the fight back to New Phyrexia. Through Tezzeret's anonymous reporting to Jace, Koth signaled that he and the Mirrans are planning an assault on the Phyrexian Core and planned on joining them once they were ready. Meanwhile, Urabrask had proposed an alliance because of his enmity with Elesh Norn . Although the arriving planeswalker strike teams were partly scrambled or incapacitated, Koth met with several of them in the Furnace Layer . To his joy, Elspeth was among the arrivals. With Kaya , Tyvar , Jace , Kaito , Nahiri , and a goblin demolition team, they descended to the Dross Pits , where Elspeth provided them with Halo to counteract the effects of the Necrogen . However, Jace inexplicably reacted adversely to the potent elixir and collapsed. After recovering, Jace's mind was focused on Vraska , whom he perceived to need help. Abandoning the group, he set out to find her. Because he carried the Sylex , the complete group set out after him. Finding Vraska in Sheoldred's Coliseum , they found she was heavily wounded and already infected with Phyresis . Too late to save her, Jace chose to stay behind with her and relive their happy moments on Ravnica in his mind. Lingering too long, Vraska succumbed to the Phyrexian influence and infected Jace in turn. The others tried to escape but were quickly overwhelmed by the black Phyrexians. Nahiri, who was also infected, decided to sacrifice herself for the greater good. With a mighty magical blast, she exploded the Coliseum and dropped it with all remaining planeswalkers on the Fair Basilica . Nearer to their goal, the infected Jace rejoined them and volunteered to bring the Sylex to the Seedcore . In the Seedcore, they met Karn imprisoned. Koth offered to stop there and break free Karn while the rest of the planeswalkers went to blow up the Realmbreaker. However, he was forced to leave Karn with impending reinforcements coming down to the Seedcore. After the unsuccessful attempt to destroy and the start of New Phyrexia's Invasion of the Multiverse , Koth's forces quickly started to lose. As a last resort, he and Urabrask helped Chandra Nalaar , Wrenn and Seven get to Realmbraker. Here, they were stopped by the compleated Nissa Revane , who tore Seven apart limb from limb. The rebel team were entirely captured and brought to the Phyrexian leadership. Just as Jin-Gitaxias was to cut down Koth, a newly ascended Elspeth intervened, healing some of the Mirrodins and giving them new resolve. Koth fought his way to the tree, his geomancy acting as mobile defenses and transport. At the end of the invasion, Koth was one of fewer than twenty surviving Mirrans able to escape and settle on Zhalfir . He worked with Karn and the Zhalfirin healers to remove as much Phyrexian metal from Nissa 's body as possible. In the aftermath of the Invasion , Koth's spark faded. Ajani Goldmane Chandra Nalaar Elspeth Tirel Jace Beleren Kaito Shizuki Karn Kaya Cassir Nahiri Nissa Revane Saheeli Rai Teferi Akosa Tezzeret Tyvar Kell Venser Wrenn Dominaria New Phyrexia Zhalfir Depicted in: Quoted or referred to: Koth's name can be abbreviated with \"Koth\", which means that Koth of the Hammer could be an infinite name. It is unclear if this was intentional."}