{"text": "Kozilek (/koʊzɪlɛk/; KOH-zih-lek ), the \"Butcher of Truth\", is one of the three Eldrazi titans and the inspiration for the Zendikari merfolk god Cosi and the Kor god Talib . Kozilek, the Great Distortion Kozilek's planar avatar is a titan of apparently humanoid anatomy, but with a mass of tentacles in place of legs, and a complex orifice in place of his head. His body is covered in eyes and chitin, and an arrangement of dark plates float above his shoulders and extend from his elbows. They are often described to be or to create dark \"holes\" in reality. Kozilek is the Titan of Distortion, a reality-slicing nightmare of relentless insanity. He changes the perception of reality, making it impossible to discern the truth. He twists loyalties, muddies thoughts, transforms emotions and induces despair and panic. Kozilek represents themes of deception, puzzles, lies, mental domination, transformation, and experimentation. Sages call Kozilek the confusion of panic, the trap of enigmas, and the harrower of thought. Eldrazi of the Kozilek brood lineage possess many eyes growing near joints or along body ridges, jagged plates or blades of lustrous black mineral jutting from or floating around their bodies, and animalistic or insectoid anatomies covered in tough carapaces. Kozilek's drones can absorb life just by their presence but prefer to rend flesh with their onyx-like projections. Example of Kozilek's spatial distortion power and lineage After the release of the titans Emrakul , Ulamog , and Kozilek by Nissa Revane , Kozilek's brood was said to have retreated to remote corners of the world, and it was generally believed that he left the plane of Zendikar. However, this assumption appears to have been incorrect. Immediately after Ob Nixilis reignited his spark by draining the hedron network imprisoning Ulamog, Kozilek emerged from deep underground nearby. At that time, he had gained some perfect black shards floating above his head that seem to draw in light itself, sometimes described as holes in space. After heavy initial losses in the Battle for Zendikar, the Gatewatch performed an orchestrated attack on Ulamog and Kozilek, binding them again in a web of leylines and burning them. This was the end of the material manifestation of Kozilek on Zendikar. In Oath of the Gatewatch cards relating to Kozilek feature mana costs with the colorless symbol . Represented in: Associated cards: Depicted in: Quoted or referred to: Kozilek's Brood: Doug Beyer (March 17, 2010). \" Gods and Monsters \". magicthegathering.com . Wizards of the Coast. Doug Beyer (March 29, 2010). \" The Eldrazi Arisen \". magicthegathering.com . Wizards of the Coast. Kelly Digges (June 15, 2010 / May 14, 2015). \" Know Your Spawn! \". magicthegathering.com . Wizards of the Coast."}