{"text": "Kruphix is the God of horizons and time. He is associated with blue and green mana . Kruphix is the eldest of the gods together with Klothys . The enigmatic god has dominion over the potential, the distant, and the unseen. Thus, he is seen as an oracle of dreams. He also governs navigation, mystery, and the cycles of time and is the keeper of mysteries that no others are meant to learn. The reclusive Kruphix speaks rarely and counts few worshippers. He often appears only in silhouette, as a Nyx -filled space in the sky. He appears to wear a hooded cloak and multiple bracelets on each of his four arms. The temple of Kruphix is built over a cataract at the very edge of the world. His main oracle is a woman named Kydele . When Xenagos ascended, Kruphix announced the Silence where the Gods were forced to not interfere temporarily in mortal affairs until they could sort the mess in Nyx. He and his oracle watched from his temple as Elspeth and Ajani defeated Xenagos and she was subsequently betrayed and slain by her patron Heliod . He discusses with her the greatest secret of Theros : the Gods of Theros arose from mortal belief that took form within the fabric of Nyx. Even he as the oldest does not predate mortal belief. He saw the other gods slowly emerge based on specific domains such as death, the sun, the sea, the forest, and the forge. This was followed by Gods in more abstract domains such as war, deception, insight, love and more. He also shared that though the domains remain, the gods themselves change. An example was that Heliod was not always the Sun God. However, when he took his place in the sky, within a few years to mortal perception he had always been the Sun God. Kruphix himself does not know the reason for their existence but he does not wish to know either. Due to the events of Xenagos 's ascension and fall, Kruphix finds himself in a conundrum. Although the oldest God had knowledge of planeswalkers from olden times, he was troubled by what he had seen in the minds of those that had recently come to Theros: Elspeth , Ajani , and Kiora . Kruphix confesses that he is not troubled by Xenagos's ascension as in time the mortals of the world will decide that the satyr had always been the God of Revels. In his own words, he is troubled by what the other planeswalkers are afraid of. Kiora had come from a world being devoured by the Eldrazi , gods who leave entire worlds as barren wastelands in their wake. Ajani Goldmane had faced the legendary dragon planeswalker Nicol Bolas , a being even more unfathomably ancient than Kruphix himself and whose plots span worlds and centuries in his search for power. Elspeth Tirel barely escaped the fallen Mirrodin, now New Phyrexia , a world of flayed skin and twisted metal, ruled over by vicious, monstrous beings who style themselves gods . It is now an affront to nature, a dark parody of life that corrupts all it touches and touches everything in time and had already successfully traveled across worlds. Kruphix fears that if any of these set their eyes on Theros, their world is utterly doomed. Ultimately, his fears would be proven correct as New Phyrexia invaded the Multiverse at large, with Theros being one of their targets. Though the invasion was ultimately defeated, it is unknown if Kruphix was compleated. Associated cards: Depicted in: Quoted or referred to: The character of Kruphix seems to have multiple inspirations. One is Terminus , Roman god of frontiers. Legend has it that Terminus was the only god who did not give way to Jupiter when he moved into his temple on the Capitol. Other is Janus , Roman god of beginnings, gates, transitions, time, duality, doorways, passages, frames, and endings. Kruphix is also described as a god of the dawn, making him at least vaguely analogous with Eos . Finally, Kruphix resembles several Greek primordial deities, including Uranus , Aether and Chronos (not the titan father of Zeus), who were also sky gods and were also among the first gods in existence. The Magic Creative Team (April 02, 2014). \" Planeswalker's Guide to Journey into Nyx \". magicthegathering.com . Wizards of the Coast."}