{"text": "Kyodai , called That Which Was Taken or the Taken One ( Japanese: 奪 われし 御 物 ; rōmaji : Ubawareshi Gomotsu ) during her imprisonment, is a dragon spirit entity from Kamigawa , that used to be an important part of O-Kagachi himself. She is the kami of the veil between Kamigawa's realms and the Worldsoul of the plane . Currently, Kyodai's appearance is that of an enormous kami, with hundreds of golden, human-sized arms forming her belly and limbs. Gold spheres trailed along the fans at her back, with a large black one embedded in her forehead. With a pointed mouth like a dragon, three masks line Kyodai's face. They represent Michiko Konda — the first emperor to channel with Kyodai. Kyodai's voice is like a shout, a song, and a whisper all at once. That Which Was Taken On the night of his daughter Michiko 's birth, daimyo Takeshi Konda reached into the Kakuriyo , distilled the essence of a kami and stole it from the spirit realm. Konda imprisoned The Taken One in a stone disk with the carving of a dragon, and in return the daimyo received from it immortality and foresight. All kami are a part of O-Kagachi, the kami of all things, and Kyodai and O-Kagachi's bond was especially significant - she has been described as the great kami's core, child, and scion - and this act awoke the prisoner's parent, beginning the Kami War . The Taken One was later stolen from Eiganjo by Toshiro Umezawa , who ultimately performed a ritual with it to free the spirit trapped within. The spirit assumed a humanoid/draconic appearance similar to Michiko Konda 's, and took the name Kyodai, meaning \"sibling.\" Kyodai brought Michiko into the Kakuriyo, showing her how her life was before being kidnapped by Konda and how awful it had become during her last twenty years spent imprisoned in stone. After that, she gave to Michiko the power to fight alongside her. Michiko and Kyodai, known together as the Sisters of Flesh and Spirit , defeated Konda and O-Kagachi and claimed themselves the guardians of the barrier between the Utsushiyo and the Kakuriyo. Many centuries after the Kami War, when Leshrac Nightwalker planeswalked near Kamigawa, the Sisters stood in his way, and ordered him to go away from their plane. After the prosperous reign of Michiko Konda, her descendants worked tirelessly with the great kami Kyodai to maintain her legacy and uphold order and justice in Kamigawa. However, as generations passed, these noble pursuits gave way to dynastic in-fighting. Eventually, an emperor died young without an heir, creating a crisis of succession. Some believed it should be her brother, others her husband. Eiganjo descended into all-out war, and it spread across the kingdom when local lords saw the opportunity to seize individual power. Many died, noble and peasant alike. The Yamazaki clan had served the Konda military for decades and earned a reputation for their unshakeable sense of duty to their citizens. A young Yamazaki soldier felt the two warring successors were betraying and endangering the Kamigawan people. Inspired by his own ancestor's story of challenging a deadly imperial decree, he took it upon himself to end the contest for the throne. He successfully assassinated the late emperor's husband, but when he went for the brother, he found his target armed and ready for battle in the throne room. Upon seeing such confrontation in her chambers, Kyodai had enough. She stripped the Konda family of their hereditary duty as rulers. From then on, they would be ordinary citizens, and the emperor would never again be chosen by blood. Now, the kami would elect rulers for their noble qualities and commitment to the nation. With the guidance and wisdom of Kyodai, the Imperials ushered in an age of collective peace and prosperity. Kyodai continued to bond with and provide sage advice to each successive emperor of Kamigawa. The Wanderer's spark ignites. More than 1200 years after the Kami war, Kyodai has a prominent temple in Towashi , near the Imperial residence. Himoto , the Kami of the Spark, is the embodiment of the emperor's relationship with Kyodai. The mortal and spiritual realms of Kamigawa now peacefully exist together. Kyodai oversees the spiritual side, while the current emperor oversees the mortal side. Early in the Wandering Emperor 's reign, the planeswalker Tezzeret attempted to control Kyodai using a prototype Reality Chip . His plan had unforeseen consequences, igniting and destabilizing the emperor's latent spark . Kyodai had been dazed and incoherent since the disappearance. Upon her return ten years later, the emperor was able to reconnect with Kyodai briefly, and the two agreed to appoint Light-Paws acting Regent of Kamigawa. During New Phyrexia's Invasion of the Multiverse , the Wanderer briefly returned. Kyodai's power flowed through the emperor, helping her rescue Kaito and kill the compleated Tamiyo . With Kyodai distracted from her duties guarding the barrier between realms, oni began escaping into the mortal realm. In her role as Kamigawa's Worldsoul and patron of the Emperor she is analogous to Amaterasu, the highest of the kami in Shintoism. Kyodai appears in the animated trailer for Kamigawa: Neon Dynasty . Associated cards: Depicted in: Quoted or referred to:"}