{"text": "Laquatus represented the cephalid 's Empire on Dominaria 's continent of Otaria , though he was a merfolk . The chief reason for this stems from his part in overthrowing the Berbous Merfolk empire during what was meant to be their rebirthing ceremony. During the ceremony, which took place every 30 years, every member of the Berbous nation would give their lives as energy to hatch the stockpiled eggs collected over thirty years. Laquatus distracted the Emperor, who was in charge of this event and would not sacrifice himself, from noticing that the Cephalids had replaced the merfolk eggs with their own. When the ceremony was complete the Cephalid nation was hugely strengthened and the Merfolk nation was decimated, leaving the Cephalids as the dominant race in Otaria's oceans. He was made Ambassador for his ability to change freely between his natural and his two-legged forms faster than other members of his race. He hated the assignment and loathed having to deal with surface-dwellers, longing to get back into the cephalid imperial court and scheme to gain more influence. Whilst he appeared to be a loyal subject, Laquatus played dangerous political games above the waves and below, ultimately looking to seize power for himself. Laquatus was a talented blue mage , possessing the ability to hypnotise people and implant false memories; which he used against Kirtar and numerous members of the Cabal in order to convince them to trust him. He also employed the amphibian Turg , and later the dementia beast Burke to provide physical force. He was one of the many individuals obsessed with obtaining the Mirari , hoping to use its power to overthrow the surface dwellers, and most especially the Cabal. This quest failed horrendously when he overplayed his hand while trailing Kamahl and his secret passageways into the interior of the continent. With his plans in shambles, he decided to directly confront Kamahl . Ultimately he failed in his task and was killed by Kamahl twice, first after a battle in Krosa , where the Mirari sword was plunged into his breast, and then as a Mirari- mutated giant zombie when Kamahl came to retrieve the sword. Associated cards: Quoted or referred to:"}