{"text": "Liliana Vess is a human planeswalker from Dominaria and is both a master necromancer and a healer. For a while, she was dead to the Multiverse, her survival known only to select members of the Gatewatch. Having freed herself from all her demonic contracts as well as from the Onakke Chain Veil , she relocated to Fiora where she temporarily lived under the alias Ana Iora . On Arcavios she was originally known as Professor Serafina Onyx , before reclaiming her original name, and began taking steps to reclaim her ancestral Dominarian home. The Raven Man affectionally calls her Lili . Liliana is a tall woman with black hair and purple tattoos. She uses black mana to reanimate the dead, corrupt the living, and unlock power from death. She is charismatic, witty, and attractive, but profoundly cynical, cunning and egocentric. She cares little for others, seeing them as stepping stones on her path to greater power. It was this craving for power that brought her to the Chain Veil , an item she views with contempt at times, for its power comes at a terrible price. Though she appears to be in her late 20s or early 30s, she is actually over two centuries old. She has black hair and violet eyes and stands either 5'9\" or 5'10\" tall, weighing in at 140lbs. She prefers to wear luxurious, revealing dresses and a golden headpiece that she stole from an archangel. She hates angels. When Liliana planeswalks, she disappears in a cloud of black, inky vapor. After the Mending , she made a pact with four demons — Kothophed , Griselbrand , Razaketh , and Belzenlok —to secure her youth and power. For most of her time with the Gatewatch she sought a means to acquire her past freedom. Initially, she joined the Gatewatch as a means of defeating the demons of her past, freeing her of her contract, but grew to care for her allies (even if she wouldn't admit it). Ultimately her desire to protect those she loved outweighed her narcissistic tendencies, causing her to break her contract with Bolas that would end her life in a final show of defiance. When Gideon Jura sacrificed himself to save her, she felt an enormous weight of guilt which compelled a new stance on the importance of the people around her and the dangers of unbound hubris. To complete the demonic pact, Kothophed etched the contract in lines along Liliana's newly restored youthful skin. As she cast powerful spells, the lines sometimes glowed purple; when she drew on the power of the Chain Veil , they could bleed. The scars of her contract are still visible as of her time on Arcavios. After cursing her brother Josu Vess, Liliana's spark ignites. Liliana Vess grew up in Benalia on Dominaria under the thumb of her father, a general and ruler of the lands he fought for. Even at this stage in her life, she was a temptress and more often than not, didn't care about the kind of reputation that sort of activity would spawn. This infuriated those her father had entrusted to watch her, but her antics did not change one bit. Liliana was a member of a holy order of clerics dedicated to the healing arts known as the Forward Order . She studied under the tutelage of Lady Ana , though secretly she also dabbled into the forbidden arts of necromancy, thinking the manipulation of death would enhance her healing abilities. Liliana's privileged life would come to an abrupt end, though, when her brother Josu suffered a horrible corruption at the hands of her father's enemies. As a test, perhaps as much to rein in the reckless girl, Lady Ana gave her the task of gathering the required esis root to cure her brother. Unfortunately, she arrived too late, as her father's dark enemies had razed the groves where the Esis Tree had grown. She only learned of this fact when she encountered a strange man who claimed to be a supporter of her father. He offered his assistance and instructed Liliana to use necromancy to reactive the remains of the Esis Tree and prepare a potion out of it, though he warned that her family would not want her to use this cure. She returned to the castle and despite the warnings of Lady Ana, she used the cure. Truly, it cured Josu of his affliction, but only at the cost of driving him insane and poisoning him anew. Realizing that she had to kill the crazed creature that Josu had become, Liliana turned his victims into zombies to fight him. At that moment, she unlocked her planeswalker's spark and ended up on Innistrad . These events later became the subject of a book known as The Fall of the House of Vess . On Innistrad, Liliana perfected her necromantic skills, preferring the black art of the ghoulcallers over the blue method of stitchers, for which she had no patience. She studied under vampires and liches but, fearing her brother's fate, refused to join them in death to fully master the art. At some point, she encountered the lord of Innistrad, Sorin Markov. They dueled and Sorin crushed her and pronounced her too weak to be a threat. Then he told her that Innistrad was his and that she best be a civil guest—or he'd find and kill her. Once confident of her abilities, she returned to the ruins of Vess estate in Dominaria, vowing to enact revenge on the mysterious man who tricked her to curse Josu. During the confrontation, the so-called Raven Man escaped. At some point before the events of Agents of Artifice , Liliana was a mage-student at Strixhaven University on Arcavios . It's unclear when it happened but it was most likely early in her history after her spark had ignited. She was a student of Witherbloom . Sometime after the Mending, a severely weakened Nicol Bolas met with a wizened Liliana Vess. She was envious of the fact that he was seemingly unaffected by the mending. He berated her, stating that he had lost more power than she could learn in a dozen lifetimes. Bolas lamented that only a few years previously, planeswalkers like them were akin to living gods who exerted their power and influence throughout the Multiverse . Bolas then brokered a deal with the four demons who would give Liliana her youth and a fraction of her old power back, in exchange for servitude. Liliana eventually found her way to Ravnica where she was a resident for some time and often acted as a freelance hire of Tezzeret's Infinite Consortium . She became acquainted with Jace Beleren whom she tracked down after his defection from the Consortium. She befriended the mindmage and his accomplice, Kallist Rhoka , and eventually seduced Jace, having a torrid affair with him. Her loyalty appeared ironclad, staying with Jace even whilst he was in the throes of an identity crisis, believing himself to be Kallist. However, her motives eventually came to light as less than altruistic. She ultimately betrayed Jace, maneuvering him to fight Tezzeret even as he tried to run further from his troubles. Later, it is revealed that her actions were supported by Nicol Bolas , with whom she had made a bargain to free her of the demonic pact in exchange for control over Tezzeret's usurped organization. The deal amounted to naught in the end. Several times throughout her plot she considered backing down and running away with Jace, but each time her fear of her demons got the better of her affection for Jace. Liliana curses Garruk using the Chain Veil . Kothophed gave Liliana the task to search for an ancient and powerful relic known as the Chain Veil from the ancient ogre civilization of the Onakke upon Shandalar , a plane Liliana had visited before. On her way to the Onakke catacomb she was assaulted by a beast , and slew it, unknowingly earning the ire of Garruk Wildspeaker . Garruk attacked her in the temple after she had located the veil, and tracked her through the hidden tunnels until he was dispatched by the veil-enhanced Liliana. Reveling in the power granted by the Veil, Liliana assaulted a fortress on yet another unnamed plane and conquered it in short order. Sitting upon the throne, she realized that Kothophed had sent her after the artifact and should have expected her to use it for herself. She then planeswalked to Kothophed 's sanctuary and confronted him. Unbeknownst to her, she was being watched by Sarkhan Vol , who reported her departure with the Veil to Nicol Bolas . A fight ensued after she refused to relinquish the veil to the demon , and she blew him apart while his words echoed in her mind. She collapsed to her knees afterward in pain as the tattoos that Kothophed himself had given her began to bleed. Liliana and the Raven Man Throughout Liliana's life, an ominous conspiracy has followed her. From the poison she used to cure Josu to her acquisition of the veil, it was all seemingly orchestrated by the same mysterious figure, a being known only as the Raven Man . Even when pursuing her own business, she was never far from the veil's influence, unknowingly even being in the same room as the key to the veil's location once before, dispatching an angel sent to protect the world from the artifact's secrets. After her battle with Kothophed, she sought whatever knowledge she could gain to end the constant bleeding and enduring pain that wracked her body and soul. She returned to the plane of the Onakke and resurrected the body of the wisest man who knew of the Onakke. However, her desecration earned her the ire of every citizen of the town and they tracked her to a farmhouse and set it on fire with her inside. Much to Liliana's frustration and surprise, the man she had raised did not act at all like the shambling corpse she expected, going so far as to bodily carry her higher as the fires spread, speaking in cryptic riddles centered around Liliana herself all the while. As the necromancer was about to give up and succumb to her woes, the corpse tilted his hand and revealed his true identity, that of the Raven Man himself. He used a vial of what appeared to be the same potion Liliana had used on Josu, and its golden glow spreads throughout her tattoos, turning them the same color and healing her wounds. Aware now of the being she had been speaking to, she stabbed him. Donning the veil once more, she planeswalked away. Liliana in a new dress to match her cursed veil Liliana traveled to Innistrad to deal with another of her demonic masters. However, Griselbrand had gone missing after a duel with the archangel Avacyn , leaving Liliana with the problem of searching for her tormentor if she wished to possess her soul once again. Unfortunately, she was not the only one hunting, as Garruk had tracked her to the world. He crossed her path once in Nephalia , but she raised a swarm of ghouls to defend herself. He slew all of the undead, but it was enough to allow Liliana to escape. Her searches then pointed her towards the Church of Avacyn , and she refused to let them stand in her way. That search brought her to the high cathedral of the city of Thraben at the critical moment when an undead army, commanded by Gisa and Geralf , had besieged the city. Geralf killed Mikaeus the Lunarch , the highest official in the Church of Avacyn, and probably one of the few who could tell her where Griselbrand was. With her purpose firmly in mind, she retrieved and resurrected the corpse of the dead lunarch, turning him into a zombie . Her machinations bore fruit, and she learned the resting place of her prey. Unfortunately, she could do little to free him from the Helvault herself, but she knew of ways around that. She wove a spell upon the Helvault and gave the choice to the Cathar Thalia . The spell would either destroy the vault or kill the soldiers under her command. The choice lay in Thalia's hands, and as Liliana predicted, Thalia chose to save her men. The spell shattered the Helvault, freeing Griselbrand and Avacyn. Liliana then tracked Griselbrand down, slaughtering both angels and demons alike until she finally cornered him. Griselbrand attempted to bribe her with promises of power, but Liliana saw through his lies and used the Chain Veil to kill Griselbrand once and for all before leaving Innistrad. Alternate art by Terese Nielsen After killing Griselbrand, Liliana was besieged by whispers emanating from the Chain Veil itself. Seeking answers, she returned to Shandalar and journeyed to the Onakke Temple. Arriving at the ruins, she was confronted by an angel guarding it. Ignoring the angel's pleas and warnings, Liliana killed her. At death's door, the angel mumbled that Liliana was a vessel for the Onakke spirits seeking to release themselves. As she recovered from the after-effects of using the veil, Liliana was beset by a vision of the Onakke civilization in the past and its subsequent destruction. She once again saw the Raven Man who seemed to be the architect of the Onakke's destruction. As the vision ended Liliana taunted the spirits in the veil about learning a similar civilization-ending spell. The unamused spirits replied in kind. Liliana eventually reached the altar where she originally found the veil. She prepared to return it stating that although she acknowledged its power, she would not trade two masters for a million more. To her shock, her own body refused to heed her and release the veil. In desperation, she animated the skeleton of a dead Onakke and ordered it to carry the veil back to its altar. The skeleton took the veil but refused to follow her orders. In frustration, she tried to walk away but the skeleton followed. Even canceling the animation spell failed as in its last moments, the skeleton lunged forward and laid the veil on her arm. In her fury, she tried to shut out the returning voices but finally, one voice spoke directly to her with alarming clarity. Liliana saw another skeleton standing before her. Within seconds, an illusion appeared over it showing the skeleton as belonging to an ancient Onakke . Furious, Liliana attacked but her spells passed through the spirit. The Onakke referred to her as their vessel and called the chain veil a veil of deceit. He stated that soon Liliana would learn its truths. Tiring of the ogre's taunts, Liliana drew on the veil's power and dissipated the ghost. Pain racked her body as she began to realize that the veil's after-effects were getting more painful and damaging with each use. As she hoped that the curse was finally over, Liliana realized that the veil would still not leave her and the whispers were still there. Tired, in pain and utterly defeated, Liliana Vess left Shandalar, and planeswalked away. Liliana arrived on Ravnica and met with her former lover Jace to persuade him to help her kill her two remaining debtors. Jace was much warier of her than he had been in the past, and questioned her about her actions since they'd last seen each other. He was angry at her for cursing Garruk Wildspeaker and berated her for using the Chain Veil, which could curse her with demonic transformation as well. She managed to assuage his concerns and persuaded him to join her for dinner. It was interrupted by the arrival of Gideon Jura, who begged Jace for help with the Eldrazi on Zendikar . When Jace asked her to help him she refused, and was outraged he would go with Gideon rather than help her. Jace replied that Gideon had earnestly and directly asked him, rather than use her usual methods of seduction, blackmail, bribery and other manipulation. A furious Liliana stalked off where she was waylaid and taunted by the Raven Man , who offered her help. Liliana, knowing how any past deals with the mysterious entity had worked out, attempted to assault him but the Raven Man vanished again, his taunting words and mocking laughter in her ears. Liliana, the Last Hope During the period that Jace and the Gatewatch fought and defeated Kozilek and Ulamog, Liliana returned to her estate on Innistrad to rest after her encounter with the Raven Man. She quietly observed the strange happenings on the plane and tightened her defenses. When Jace arrived being chased by several werewolves she directed her zombies to drive them off. She then played host to him and questioned his recent actions on Zendikar as his reason for coming to Innistrad. Upon learning that he was searching for Sorin Markov she was startled and attempted to dissuade him. At Markov Manor Jace found only death and destruction and at the Drownyard he found zombies. Under the influence of the cryptoliths , he began to suspect Liliana. He returned to her manor and tried to mentally assault her. However, the Raven Man protected her and tried to convince her to kill him. Liliana refused to, bringing Jace back to his senses. During their talk, the maddening influence of the cryptoliths reasserted itself and Jace asked Liliana for the direction of Thraben to confront Avacyn . A hunched-over man named Gared , presumably human, then appeared from the shadows. He informed Liliana that his \"master\", the geistmage Dierk , was ready for her and asked her to bring the Chain Veil to him in his tower. With a witchbane orb, they tried to exorcise the Onakke spirits from the Veil but were unsuccessful. Liliana fighting against Emrakul After Emrakul arrived on Innistrad, Sorin Markov and Olivia Voldaren assembled a vampire army and went to war against Nahiri, berating Liliana for destroying the Helvault and releasing the Lithomancer on the plane. Liliana was ready to abandon Innistrad as a lost cause, but changed her mind when she considered her feelings for \" Cloak Boy .\" Telling herself it wasn't that she needed Cloak Boy but that she needed people to need her (so that she would have some protection against her demon enemies) she began to raise a zombie army to fight the Eldrazi Horrors overrunning the plane. When Liliana arrived in Thraben, where the concentration of Eldrazi Horrors was highest, her reception by the Gatewatch was poor, Nissa having felt the dark magic radiating from the Chain Veil. Confronted directly with the Eldrazi Titan, Liliana began to lose control over her zombie servants. Both the Chain Veil and the Raven Man urged her to flee and leave Innistrad behind. Asserting herself against both, she drew even more on the power of the Chain Veil than ever before, feeling close to the power she had wielded before the Mending . While that power protected her against Emrakul's insidious influence and allowed her to attack the Titan directly, it also took a great toll on her body, leaving her near death. When she reawakened, Emrakul had been sealed in Innistrad's moon by the Gatewatch and Tamiyo , and her wounds had been healed by the other planeswalkers. Seeing that a group of allies could be useful for her long-time plans, she decided to join the Gatewatch , albeit to direct them for her plans. After Liliana leaves Innistrad she leaves her zombie army wandering the ruins of Thraben , later Gisa Cecani takes control of this army. Oath of Liliana - “I’ll keep watch. Happy now?” When the Gatewatch established their headquarters in Jace's apartments on Ravnica, Liliana refused to move in, and instead bought her mansion. She was present when Dovin Baan arrived to hire the Gatewatch, but reminded him that they worked only against greater interplanar threats, like other planeswalkers or entities like the Eldrazi. She then took care of the upset Chandra and planeswalked along with her to Kaladesh. Arriving in Ghirapur , Liliana goaded Chandra to act against the Consulate that had murdered her parents. Searching for renegade sympathizers, the pair came across a mosaic of Kiran Nalaar, Chandra's deceased father. Upon hearing the story of how Chandra's spark had ignited, Liliana advised her to seek revenge against Baral . On their further way through Ghirapur, the pair came across unrest, seeing a hooded man referred to as the Head Judge confronting an inventor referred to as Renegade Prime. Liliana recognized the Head Judge as Tezzeret . When Renegade Prime, revealed to be Pia Nalaar , was captured, Liliana persuaded Chandra to retreat instead of head-on confronting Tezzeret, remembering what the artificer had done to Jace. The newly arrived Nissa berated her for taking Chandra to Kaladesh without first approaching the others and for provoking Chandra to act against the Consulate. Knowing she could not risk losing two valuable assets to her long-term plans, Liliana left the pair to find her answers She planeswalked back to Ravnica and warned Jace, alerting him to bring Gideon with him to Kaladesh. Meeting with Nissa and Chandra, as well as the newly arrived leonin Ajani Goldmane , the group saw an announcement that the renegade Pia Nalaar would face Head Judge Tezzeret in a quicksmithing duel. Using illusions, they mixed in the crowd at the arena and confronted Tezzeret when he was about to deliver the final blow to Pia. Instead of fighting, Tezzeret announced that the Inventor's Fair was concluded and retreated. Confused, the Gatewatch learned that the spectacle of their arrival had been a part of a great distraction that Tezzeret had used to confiscate numerous inventions and inventors. Liliana recognizes Tezzeret while out with Chandra Liliana and the Gatewatch joined forces with the Renegades to find a way to strike against the artificer. During their time on Kaladesh, Liliana, and Gideon clashed when the latter reprimanded her for the use of lethal force against Consulate troops. Liliana answered that she used the tool that she used best to hide their presence and complained that the Gatewatch was wasting its time. They should strike at Tezzeret directly instead of working together with the Renegades in their conflict against the Consulate. She warned him that Tezzeret wouldn't fight fair and that she would end him by \"hurting something important\" to her. When Saheeli Rai revealed the location of Tezzeret, Liliana volunteered to accompany her. While they didn't reach the metalmage, the pair discovered that Rashmi had escaped and that her invention had been rebuilt and expanded to allow contact to other planes . They brought the elf away to the Renegades. Liliana again pressed Gideon to allow her to face and kill Tezzeret, telling him that she would serve as a distraction so that the Hope of Ghirapur could destroy the Planar Bridge. Using her Zombies to frighten the Consulate soldiers away, who had never seen undead before, she reached the Aether Spire and ascended to the top, where Tezzeret stood above the Planar Bridge. The pair fought, Tezzeret using his metal magic and Liliana her command over death. Tezzeret questioned her allegiance to the Gatewatch and tried to incite her against Jace, telling her that he had made her weak. Liliana learned that Tezzeret had been on Kaladesh on Bolas' command and that he had first believed that the Dragon had sent her to observe his progress. Liliana managed to overwhelm him and asked him where Bolas had hidden. Under pain, Tezzeret revealed it to be Amonkhet , the plane where Razaketh , one of the demons she had sold her soul to, dwelled. Before she could finish him off, Chandra and Gideon crashed into the Planar Bridge, destroying it but allowing Tezzeret the chance to escape. Following their victory, Liliana advised the Gatewatch to strike directly against Bolas, seeing that with Tezzeret alive, their security was compromised. Liliana, Death's Majesty When the Gatewatch arrived in Amonkhet, they found themselves under attack from zombies. Liliana managed to take control over several of them but was later swallowed whole by a wurm . Initially thought dead, she later decomposed the wurm from within through the use of the Chain Veil. As the Gatewatch arrived in Naktamun, Liliana was as surprised as the rest of them, since she had never seen this part of the world before. When the natives of the city greeted, Liliana took notice of the mummified servants , which delighted her. She derided the notion of gods as pretensions since the only \"gods\" she had ever known were hubristic planeswalkers. Liliana's Defeat at the hands of Bolas. While the rest of the Gatewatch was underway to learn more about Bolas and the plane, Liliana instead used shades to spy, using the time to retreat and think about how to direct the Gatewatch against Razaketh. Her musings were interrupted by the Raven Man, who revealed that he had watched over her since the events on Innistrad. He warned Liliana to not become too entangled with her new allies, suspecting that she had gotten soft. When Jace approached, the Raven Man vanished again, leaving the two alone to discuss the plane. The two followed a shade servant of hers to a place inscribed with Razaketh's symbols. Inside, Liliana and Jace witnessed the creation process of the Anointed out of those who had died in combat, as well as a mural that implied Razaketh's involvement in the afterlife. Learning of her motivations with the demon, Jace accused her of betraying their trust. As they spoke, Temmet arrived and set the mummies against them after becoming suspicious of their origins. With Jace's aid, the two managed to escape. After the Second Sun had come to rest between Bolas' Horn Monument, the Gate to the Afterlife opened, Razaketh stood revealed before the population of Naktamun, much to their horror and dismay. At the demon's command, the Luxa turned to blood, while he uttered a challenge to Liliana. Using a hidden clause in their contract, Razaketh managed to take control over Liliana's body, calling her towards him. He toyed with her until he was intercepted by the Gatewatch , who surprised him enough for Liliana to free herself. Using her necromantic magic to take control over the dead beasts in the Luxa, she tore him apart and let her undead feast on his remains. The Gatewatch discovered that Bolas had been creating an army of Eternals , highly trained fighting specialists who had been zombified while keeping their skills intact. When they confronted the dragon, they were soundly defeated. Liliana betrayed her friends and fled to another plane, knowing that she would have to repay Bolas for sparing her life. Liliana planeswalked to Dominaria, where she was soon reunited with the rest of the Gatewatch. Confronted by an angry Nissa and a hurt Chandra, she tried to defend her position, arguing that she would not be of use against Bolas when she was still indebted to her demon masters. Revealing that her last demonic debtor, Belzenlok, was on Dominaria, she tried to convince the rest of the Gatewatch to help her destroy him. Nissa left in disgust, while Chandra went away to become stronger. Only Gideon chose to remain with her. Liliana finally freed her brother's soul. Trying to heal him, they entered the ruined settlement of Vess. Learning that the Cabal had come to her homeland and turned the forest into a marshland, she also received the news that her family's fate had become a legend and none of her relatives survived. When she went to gather herbs to heal Gideon, she discovered that the Manor still stood. When she returned, Vess was under attack by the Cabal. Using her necromantic magic to take control over one of the Zombies, she learned that their master was no other than her brother Josu, who had been transformed into a Lich by Belzenlok's cultists. Searching answers, she went into the Marsh to search for the Raven Man. When the being manifested itself, she asked him to free her brother from the Cabal. The Raven Man declined, stating that if she missed her brother so much, she should have agreed to follow him. Liliana realized that Belzenlok had used her brother to divert her strength, knowing that if she used the Chain Veil to destroy Josu, she would be too weak to use the artifact against him. Telling Gideon what she had learned, she expected him to abandon her like the rest of the Gatewatch. Instead, the hieromancer agreed to help her to lay her brother to rest. As Gideon rallied the defenders of Benalia , Liliana explained the capabilities of the Cabal's servants to them. When the Benalish forces clashed with the Cabal, she contacted the Lich that was once her brother. The enraged Lich left his hideout to confront her, only for Liliana to destroy him. Dying, Josu cursed her, telling her of the fate of their family and how it was her dark magic that had brought their house low. He also told her that the Void awaited her. Disturbed and weakened, she and Gideon teamed up with the Weatherlight crew to fight the Cabal and defeat Belzenlok. After learning of the existence of the Blackblade , they realized this soul-drinker could be a possible weapon in their fight against the Elder Demon. This proved to be true, and together they managed to kill Belzenlok. After the Gatewatch cleaned up on Dominaria, they left for Ravnica and the ultimate fight with Nicol Bolas. Intending to follow her friends, Liliana found out that she was unable to. Suddenly, Nicol Bolas materialized out of the darkness, pointing out that her pact with the demons was still in order. With all four demons dead, the contract had defaulted to its broker, Bolas himself. He also explained that if she disobeyed his orders in any way, the pact would kill her. She would age hundreds of years in a moment, and become a desiccated husk to be blown away by the wind. Sick at heart, bound like a prisoner to a new incarnation of a fate she had schemed so long to cheat, Liliana followed Bolas off the plane. Liliana incites the eternal goddesses Oketra and Bontu against Bolas, resulting in the defeat of the Elder Dragon. On Ravnica, Bolas installed Liliana as his Dreadhorde 's general. During the battle, while she still followed Bolas's direct commands, she tried to cause as minimal damage as would be allowed without directly defying him. She specifically prevented the Eternals from going inside buildings. She could directly control the Eternals and gain their viewpoint if she wanted to, but there were a lot of Eternals and they were mostly on auto-pilot mode. Liliana directly controlled Oketra in shooting down Gideon and the shot hit the pegasus instead of Gideon himself because Liliana missed deliberately. Jace and a few other planeswalkers tried to kill her to stop the command of the horde, but Bolas prevented them from accomplishing their goal. After Gideon failed to slay the Elder Dragon with the Blackblade , Bolas ordered Liliana to use the remaining two God-Eternals to crush the combating forces of planeswalkers and Ravnican forces. Instead, feeling regret and not wishing to remain Bolas's slave, she turned all the Eternals against Bolas. Breaking her contract, Liliana began to rapidly age, while still pushing the undead forces forward to the dragon. Gideon used hieromancy to transfer the contract and its lethal effects upon himself, allowing her to survive, while he aged to dust, sacrificing himself to save Liliana from the contract. Liliana commanded Oketra and Bontu to attack Bolas. During the struggle, Niv-Mizzet surprised Nicol Bolas by impaling the elder dragon through the back with Hazoret's spear. Although Bolas managed to obliterate Oketra, Bontu was able to bite the Dragon-God and extract all of Bolas's collected sparks, including his own. Unable to contain all of the absorbed sparks, Bontu quickly ruptured into shards. Ana Iora Liliana was completely distraught and heartbroken even after defeating Bolas because of Gideon's death. Jace tried to comfort her and warned her that she needed to leave quickly because staying in Ravnica was dangerous. She took Bolas's Spirit-Gem and planeswalked away as soon as Saheeli shut down the Immortal Sun again. Afterward, the guildmasters and Niv-Mizzet collectively decided that Liliana defected too late and that she was directly responsible for most of the casualties. Most of the planeswalkers also thought of her as a villain and a threat. Kaya was hired to hunt Liliana down. In the hunt for Liliana, Kaya was accompanied by the planeswalker Teyo Verada and their friend Araithia Shokta . Liliana instinctively traveled to the home of her youth, Caligo on Dominaria. She felt desperate and remorseful, thinking about the awful things she had done in general and to Jace and Gideon especially. Nearly drowning in the morass, she almost let go, but a fleeting image of a figure in white kept her going. As Liliana made her way to the House of Vess, she encountered the Raven Man who offered his assistance. Liliana resisted his proposal and silenced the Onakke spirits within the Veil after they began to speak. Liliana was surprised to find that her old estate had been restored to its original splendor. A nearby servant, enslaved with a gold collar around her neck, warned Liliana not to proceed further or risk being captured by the mistress of the house, “Liliana Vess.” Seeking to uncover the mystery of her imposter, Liliana entered the mansion to confront Mistress Vess but was subdued. A gold collar was placed around her neck, and the Spirit-Gem was taken. Liliana was found by her would-be assassins working in a nearby garden and a trance. As Teyo attempted to remove the collar from Liliana's neck, she was jolted back to her senses. Liliana fought Teyo and Kaya and was prepared to kill them but was knocked unconscious by Rat. Liliana awoke and agreed to let Kaya kill her in exchange for defeating the imposter and freeing her people. The fake Liliana gained her power by wearing a choker with a blue sapphire amulet that contained a large and very powerful djinn . It allowed her to control the estate's workers and conjure illusions. During the fight, Rat stole the sapphire and destroyed it which released the djinn named Zahid . Seeking vengeance, Zahid attempted to kill Teyo while Rat retrieved the Spirit-Gem and returned it to Liliana. At that moment, Ugin appeared to Liliana and encouraged her to choose a better path in her journey ahead. Liliana then used the Veil to subdue Zahid whose only request was to take Liliana Vess as his prisoner. Realizing Zahid was referring to the imposter, Liliana agreed, but the mistress was killed by Kaya out of mercy. Zahid was forced to leave empty-handed. Liliana revealed to Kaya, Teyo, and Rat that she had tried, sometimes unsuccessfully, to minimize Bolas's carnage on Ravnica. They decided to let Liliana live, although proof of a kill would be needed. Teyo suggested that Liliana give up the Veil, but Liliana struggled with the decision as to the Onakke spirits and the Raven Man encouraged her to keep the artifact. While holding the Spirit-Gem in one hand and the Chain Veil in the other, the Spirit-Gem began to glow, and as it disappeared, Liliana dropped the Veil and gave it up. Before returning to Ravnica, Kaya, Teyo, and Rat promised to meet Liliana in Paliano on Fiora . Teyo used his shield magic to transport the Veil and delivered it as proof of Liliana's death. The Veil was placed into a puzzle box for safekeeping by Niv-Mizzet. On Fiora, Liliana created a new name for herself, Ana Iora . Ana was for her former mentor , but she had no idea where Iora had come from, it had just popped in her head . Professor Onyx Returning to Arcavios , Liliana became known as Professor Serafina Onyx , spending time in Strixhaven 's Biblioplex to find a way to bring Gideon back from death. At some point in her earlier life, Liliana had attended Witherbloom College, but she wasn't surprised when no one recognized her when she introduced herself by an entirely different name. Due to this, Liliana was able to take up a teaching position at Witherbloom. Unable to find a spell to bring Gideon back, Liliana heeded Beledros Witherbloom 's words to honor the dead are reflected in how we treat the living. She took the lead in the confrontation with the Oriq and decided to recruit students and fellow planeswalkers Will and Rowan Kenrith for that fight. After the Oriq and an army of mage hunters began their attack on Strixhaven, Liliana worked with the other professors and deans to save the students. She attempted to stop the strange figure who controlled the mage hunters but halted her pursuit after realizing the attack was a misdirection. After the arrival of the Founder Dragons , Liliana saved the twins from an Oriq attack and then guided them through an old maintenance passage to an area underneath the Biblioplex . There they found Extus Narr who had bound himself to an immense power source called a Snarl. As they attempted to intervene, Liliana was translocated away by the Oriq leader, leaving only Rowan and Will to face Extus and a summoned entity known as the Blood Avatar . It took Liliana days to return to Strixhaven from a forest at the edge of the continent where she had been sent. The deans admitted they should have heeded her warnings and invited her to stay on as a professor at Strixhaven indefinitely. She agreed to the arrangement with one small caveat: that she would teach a new introductory class on the necromantic arts. With this agreement, the ages-old planeswalker decided to no longer use her adopted name and now goes by Professor Liliana Vess. She has given up on trying to resurrect Gideon and tries to do his memory justice by acting as a responsible person. After the Raven Man found Liliana on Arcavios, he tormented her dreams for months, enticing her to return home to Dominaria. A book in the Biblioplex revealed the Raven Man's identity as the necromancer Lim-Dûl . After planeswalking to her family estate on Dominaria, she confronted the Raven Man before being ambushed by Phyrexians led by the compleated kor Elas il-Kor . After fighting off her pursuers, she hid Mairsil 's ring, the source of Lim-Dûl's essence, deeper under the Vess estate. She then planeswalked back to Arcavios to recuperate from the skirmish. Liliana traveled back to Dominaria to help her former teammates against New Phyrexia 's impending Invasion of the Multiverse . She wasn't part of the planeswalker strike force that set out to destroy Realmbreaker on New Phyrexia. Together with Wrenn , Chandra , and Vivien , she took refuge in one of her cabins on the plane, a placeholder for her soon-to-be-reconstructed Manor, and anxiously awaited the return of the team. When the survivors returned, they were devastated to learn what had happened - Liliana was shaken most of all with Jace's failure. Feeling Dominaria had enough defenders of its own, she left to defend Strixhaven despite Chandra's pleas to join her raid on New Phyrexia. Liliana determined the Invocation of the Founders would be a powerful spell against interplanar intrusion, but with most professors and many students compleated, only a small group of students led by Quintorius Kand could carry it out while Liliana focused on building up defenses and looking for survivors. The Invocation was successfully cast, albeit in an incomplete state — the ignition of Quint's latent planeswalker's spark interrupted the casting — and Liliana quickly deduced that he had actually ignited as a planeswalker. The Invocation, while incomplete, bought Strixhaven a much-needed reprieve; Liliana took this time to reanimate an army of zombies from Strixhaven's deepest catacombs, vowing to protect the survivors of the school for as long as she could. Brady Dommermuth revealed that Liliana was born long before The Mending , and her planeswalker spark ignited before the Mending, also. Her deal with demons was made afterward, in an attempt to secure more power and longevity for herself. He also revealed that she made four different deals with four demons, but used the results from one deal to broker another. 'Liliana Vess' is an anagram of 'a villainess', a fact that Brady Dommermuth insists is coincidental. Liliana narrates the trailers for Avacyn Restored and Eldritch Moon , is the primary focus of the War of the Spark trailer, and appears in the ManaStrike and Magic SpellSlingers trailers. Liliana's third visit to Shandalar and the Onakke Temple seems to have taken place between the events of Return to Ravnica and Theros simultaneously as the temple was destroyed after the events of Theros . This can be seen via Elspeth Tirel's \"death\" and Ajani Goldmane's subsequent usage of her cloak to honor her having occurred at the same time as Jace Beleren was rushing to stop Garruk. The temple's destruction only occurs after Jace had already become the guildpact and encountered Vraska. In the video game Magic: The Gathering Arena , Liliana is voiced by Cissy Jones . Liliana received cross-promotional cards in Lord of Vermilion II and Lord of Vermilion Re:2 . Liliana makes an appearance in the 2010 novel Test of Metal , but given the nature of clockworking , the veracity of Liliana's appearance, and indeed the fact that many alternate reality versions of Liliana are used without any sign of the Chain Veil, makes it questionable if this Liliana is the same one pursuing the goals outlined in \"The Hunter and the Veil\". In this appearance, Liliana has bound herself to Bolas's service and was used as a pawn to further the Elder Dragon's goals. At one point she met Tezzeret on the plane of Bant and tried to warn him of a plan that Bolas had been working on; something that would result in the death of many planeswalkers. In the end, Tezzeret managed to free Vess from her bond to Bolas. In the D&D campaign released with Dungeons & Dragons: Adventures in the Forgotten Realms via Magic Story , Liliana was given a character sheet representing her as a warlock, a spellcaster deriving her power from a pact with otherworldly beings such as demons. She has several offensive spells emphasizing a necromantic/life force manipulation theme, and undead summoning and control powers as well. She has a class feature revolving around a magical talisman, which may be a reference to the Chain Veil, although its powers are not as extreme. Her alignment is neutral evil, implying a selfish nature and willingness to commit immoral acts to achieve her goals. Liliana bolstered by the Chain Veil In a bid to acquire her past powers, Liliana has acquired the following items: The Chain Veil (now given up as proof of her \"death\") Bolas's Spirit-Gem (now unknown after it disappeared) Associated cards: Depicted in: Quoted or referred to: Liliana Vess . Planeswalker Biography . Wizards of the Coast. Brady Dommermuth . (February 19, 2009.) \"Liliana and the Mending\" , The Wizards Community, Wizards of the Coast. Brady Dommermuth. (April 25, 2012.) \"Ask Brady\" , The Wizards Community, Wizards of the Coast. Doug Beyer , Jason Shawn Alexander, Jenna Helland et al. (August 13, 2008). \" The Hunter and the Veil \". magicthegathering.com . Wizards of the Coast. Doug Beyer (October 24, 2007). \" Planeswalkers Unmasked \". magicthegathering.com . Wizards of the Coast. Jenna Helland , Brady Dommermuth et al. (July 01, 2010). \" The Raven's Eye \". magicthegathering.com . Wizards of the Coast. Doug Beyer (August 31, 2011). \" Liliana's Mission \". magicthegathering.com . Wizards of the Coast. James Wyatt (July 2, 2014). \" Veil of Deceit \". magicthegathering.com . Wizards of the Coast. Doug Beyer (March 21, 2012). \" The Guardian, the Witch, and the Angel \". magicthegathering.com . Wizards of the Coast. Doug Beyer (April 09, 2012). \" Angel's Rise and Demon's Release \". magicthegathering.com . Wizards of the Coast. Michael Yichao (July 28, 2015). \" Art of Liliana: Healer to Necromancer \". magicthegathering.com . Wizards of the Coast."}