{"text": "Linden Kenrith was the queen of Ardenvale on Eldraine . She was the wife of High King Algenus Kenrith , the mother of Hazel and Erec , and the adoptive mother of Rowan and Will Kenrith . Linden was bold, decisive, and just. She was known for her stern discipline and firm compassion. The weight of years and children and ruling gave her dignity but had leached some of her famous agility and speed. She loved her husband and their children. As a mother, she was stern but just. She was usually clad in a magnificent silver and white robe whose sleeves were embroidered with the symbols of her four knighthoods. She moved in a stately manner, never any hasty or precipitous actions for her. She was a strong person, selflessly ruling beside the man she had once been competing with and might have bested. Linden raises Will and Rowan. As a humble young woman from Kenrith , Linden had been chosen as one of the two candidates to quest for high rulership. The Questing Beast had given her a blessed sword as the mark of its favor. Algenus and Linden both quested for years after they had been chosen. In the course of time, they fell in love, but they weren't always questing together. In her absence, Algenus became enthralled by a witch . The witch became pregnant with his children Rowan and Will and killed the twins for their blood, which she intended to drink to extend her life. Linden gave up her sword's power to restore life to them and took them in as her own kids. King Yorvo granted her a knighthood at Garenbrig when Will and Rowan were about a year old, but the fifth and final knighthood — Embereth — eluded her. Algenus Kenrith finally completed the High Quest not long after Linden's return from Garenbrig. After he was acclaimed as High King, she did not ride out again. Because the true story was kept a secret, the courtiers of Ardenvale always wondered why Linden hadn't completed the High Quest. Some thought she might have murdered the twins’ real mother to get Algenus, and power, for herself. The Kenrith Family Almost eighteen years after the birth of the twins, Algenus was abducted by the anarchist planeswalker Oko and turned into a magnificent stag. Rowan and Will managed to find him in the Wilds , but couldn't prevent him from being mortally wounded by an Oko disguised as Queen Ayara during the Wild Hunt . As there was still life in Algenus's own sword, Linden used it to return him to the world of the living. During New Phyrexia's Invasion of the Multiverse , Linden and her husband Algenus Kenrith were killed by the invaders while defending Castle Ardenvale . Linden was slain by a Phyrexian behemoth soon after she entrusted her children's safety to their planeswalker half-siblings. Associated cards: Depicted in: Quoted or referred to:"}