{"text": "Linvala is a white -aligned Angel native to the plane of Zendikar . Unlike most other Zendikari angels , Linvala did not blind herself with a halo and instead opted to keep the terrible memories of the Eldrazi alive. As they reemerged onto the plane, Linvala fought against them along with the other surviving angels. She is known for the use of silence, cutting off the sounds of her opponents and allowing her allies to be heard. Linvala survived the initial release of the Eldrazi and joined the fight against the titan Kozilek . In the wake of the Eldrazi's demise, Linvala, tired of the other angels' inaction, flew to Sea Gate to offer her services. She immediately stood behind Tazri's proposal for the reconstruction of the city, and the word of an angel swayed even the stingiest expeditionary house. After Zendikar became a target in New Phyrexia's Invasion of the Multiverse , Commander Tazri had a halo-infused vision. She sent Akiri, Linvala, Kaza, and Orah to Emeria , where they witnessed the return of the compleated Nahiri . Joined by Tazri, the party attacked the planeswalker in the heart of Emeria's transformed Skyclave . Though Nahiri at first gained the upper hand with ease, the fight turned as the angels of New Capenna entered the Multiverse and gave angels everywhere access to Halo . With Linvala's newfound strength, and Tazri's halo, the party managed to break Nahiri loose from the reformed Hedron network and knock her from her feet. As they escaped, they witnessed the Skyclave breaking and crashing to the ground with Nahiri still inside. More by accident than anything else, the vampire bloodchief Drana and the angel Linvala found themselves fighting in the same skies during the thick of Zendikar's invasion. A chance encounter during the battle led to a startling discovery: bloodchief magic and angelic powers complemented each other surprisingly well, and together the two of them could do more damage than they had apart. As they've fought, the mutual disdain and dislike they held for each other has transformed into one of respect and appreciation for the other's power and skills. The use of Song of All in the flavor text for Linvala, Keeper of Silence ( Secret Lair , #1289 ) from Secret Lair: Artist Series: Alayna Danner may imply that Serra was involved in the creation of angels on Zendikar ."}