{"text": "The Lithoform Core is powerful and dangerous artifact created by the founders of the Makindi empire on Zendikar . The lithoform core is a multifaceted purple gemstone the size of a small melon. It is the last one of its kind in existence. Both the Core and its key are compared to stars in terms of brilliance. It sends out incomprehensible whispers to its user. The Kor Planeswalker Nahiri believes that the power of the core can stop Zendikar's Roil forever. She expects to heal Zendikar of all its scars with it, wanting to make the world a safe and prosperous place again, just like it was before the Eldrazi arrived. Jace Beleren theorizes that it is channeling Zendikar's power itself, and Nissa Revane sees it as a threat to Zendikar's current-day plants, animals and elementals . The power of the artifact causes a Lithoform Blight , a dark effect that withers leaves, branches, and bark, transforming them into something rigid and unmovable. Nahiri asked for Nissa 's assistance in searching for the the core in the Skyclave of Akoum . When they entered the skyclave's heart, they found ancient kor runes covering every surface, every inch of the stone walls, floors, and ceiling. On the dais in the very center of the room, in the heart of the heart stood a small tile, glowing like a star. This wasn't the core she was looking for, but merely a key. The runes told her search for the core itself in the Murasa skyclave. Using the little bit of the core's power stored in the key, Nahiri was able to partially restore the skyclave and to stop the Roil's influences for a while. However, the effect apparently absorbed life from organic matter. When it killed an elemental summoned by Nissa, Nahiri thought is was worth the cost. For this, Nissa broke up their partnership. Nahiri hired Akiri , Zareth San , Kaza and Orah to accompany her to Murasa. When they finally found the Core in the Murasa skyclave, the remaining party-members were set upon by aggressive elementals . Using the artifact to defend herself, Nahiri killed Zareth in the process. Realizing the danger of the core, Akiri threatened to drop the artifact over a cliff. Applying her lithomancy, Nahiri used a hedron to petrify Akiri, take back the artifact, and then push Akiri over the edge. Her lithoforming powers enhanced by the Core, Nahiri started to reshape the world according to her will and to still the chaotic effects of the Roil. In this way, she was unconsciously emulating the Eldrazi. The Skyclave runes guided Nahiri to the Singing City . In the center of this old Kor structure would a magical focal point from where she could channel the Core's energy all over Zendikar through the leylines , making the transformation of Zendikar universal. Jace Beleren promised to not hinder her in her endeavor to save Zendikar, if she promised not to use the Core until they had studied its mechanism in more detail. He knew that if he was ever going to unlock the mysteries of the Core, he was going to have to understand how it was activated. If it was going to be a useful weapon in the battles to come, its mysterious power had to be quantified first. Arriving at the focal point they found that Nissa had found it earlier and had destroyed it with help from Ashaya and her other elementals . Nissa and her Elementals attacked both Jace and Nahiri. Their force was so overwhelming that they had to retreat back into the Singing City. Barricading the entrance, Nahiri began to collect power from the stones. When Jace tried to persuade her to flee to Ravnica together, she refused. When she tried to remove him from the equation, Jace turned the the tables on her and took control of her mind. Taking the Lithoform Core from Nahiri, he tried to find Nissa to tell her that he would take it to Ravnica to study it. Before he could make his argument, he was caught by Ashaya who took the Core and handed it to Nissa herself. As Nissa held the Core she found that it actually was an ancient piece of Zendikar's soul and spoke to her, arguing that she could use it to restore Zendikar to power. When Jace tried to take control of her mind, and Nahiri returned with a vengeance, Nissa used the power. It collided with Nahiri's hedrons in a shower of sparks and energy. The dull roar became a screaming bellow. The light became blinding. The air rushed away. Then there was nothing at all and the Core went quiet and dull in her hands. What she saw made Nissa's breath catch in her throat, and panic rose up in her chest. The Singing City was gone. Flattened into dust. So was a large swath of the forest. All reduced to ash. Across the battlefield, the elementals were lying motionless in the dust. Feeling desperate for a moment, she next felt the Elementals recovering. And so did the soil around her, sprouting new life in increasing abundance. Nissa realized that the Core had served its purpose. It had undone damage. Zendikar was healing, turning into something healthier, stronger than it was before the battle with the Eldrazi. Though the scars were still there, they were memories now, not its defining features. Nissa called up her vines and grinned as they grew and twirled underneath her, raising her in the air. She turned east, and moving as quick as the wind, she followed the leylines of the land, flying through the forest, toward Bala Ged, to home. As Jace picked up the Lithoform Core, he found that its power was gone."}