{"text": "Ludevic of Ulm is a wheezing and reclusive necro-alchemist , and the most influential of Innistrad 's merchants. Ludevic lives in Havengul . In his veritable studies of necro-alchemy, Ludevic aims for more than simply the creation of skaabs or true life, like so many of his colleagues. Instead, he also aims to understand the horror his creations inspire. Some think that Ludevic's consumption of potions and inhalation of toxic vapors has left him no choice but to abandon his experiments, leaving him to devote his sizeable intellect to the problem of making himself and his partners filthy rich. However, he has taken young Geralf Cecani under his wing and trains him in the arts of necro-alchemy. Ludevic had grown ill. Obsessed with making his \"final creation,\" Ludevic returned to the lab. He combined flesh, metal, and pieces from four different brains into a body unlike any Innistrad had ever seen (which is impressive considering the Eldrazi were just here). Calling his creation \" Olag \", Ludevic activated his machines and breathed life into the creature . Cackling madly, Ludevic ordered Olag to go out into the world and maim, kill, and destroy. \"But why?\" asked Olag, their voice mellifluous and innocent. Ludevic was disgusted. He did not create this creature to be kind. Olag remains locked away beneath the laboratory until Ludevic figures out how to fix them. Although locked away, Olag is not alone. They have been receiving visits from a mysterious figure who has promised them their freedom very, very soon. Sorin Markov visited Ludevic to inform him about New Phyrexia's Invasion of the Multiverse . Ludevic told Geralf of these invaders shortly afterward, and entrusted him with the defense of Havengul while the old man visited a former student in Selhoff . Associated cards: Quoted or referred to: ^† Scryfall does not record flavor text for digital cards. See Alchemy: Innistrad/Flavor text Chas Andres (October 26, 2016). \" Ludevic, Necro-Alchemist \". magicthegathering.com . Wizards of the Coast."}