{"text": "Lukka ( Phyrexian : cyhYD , IPA : [lykuʔ] ) was a red -aligned human Phyrexian Planeswalker from the plane of Ikoria . He was compleated during the events of Phyrexia: All Will Be One , and later killed by Vadrok and Vivien Reid during the siege of Ikoria as part of New Phyrexia's Invasion of the Multiverse . Lukka was a military-trained man in his late thirties. He was lean and muscled and had a short beard. His black, short-cropped hair was greying at the temples. He could bond with and control animals. When he did, his face acquired some of the physical attributes of those animals. Lukka used to be a member of the Coppercoats , an elite military squad tasked with protecting the human cities of Ikoria against monsters. He was also engaged to Jirina Kudro , the daughter of the general of the Coppercoats. He carried a harpoon from in a sheath on his left arm. The influence of an unnamed planeswalker via the Ozolith disturbed his sense of justice and destabilized his mental health, giving him a strong urge to return home and take control of the city where he grew up. He always wants to be respected but is usually feared instead. This instability made him vulnerable to the corruption of phyresis, as his detachment made him unaware that his mind was being overwritten. The Darwinism of the Vicious Swarm appealed greatly to his belief in meritocracy. Although he still could connect with animals, he saw them as tools rather than as allies. Lukka was centered in red mana , but when compleated by the Vicious Swarm, he gained access to their corrupted green mana . As a Phyrexian, Lukka became one with his bonded companion, Rothga . He shared the beast's extended arms and legs, in addition to his arms, now ending in sharpened claws. After invading his home plane of Ikoria, he began assimilating more monsters, as well as the defenders of Drannith, into his ever-growing body. By the time of his death, he was a titanic humanoid. He had two arms -though longer and thinner than what might belong to a human being - and two legs, made thicker to support the great weight of his vast, carcass-like body. Lukka's original body hung from a web of flesh at the center of the titan, nestled into its torso like an exposed heart. The upper half of his body was still recognizable, though mangled by plugs and sockets and bonded now with copper turned green with verdigris. Below the waist he had been attached to a creature of iridescent metal, forming him into a gruesome centaur. Its endless rippling mass was a hundred colors; countless permutations crossed its skin, razored spines and hardened scales to bristling fur to great washes of naked pink and brown flesh. Scales and feathers spotted the vast canvas of his skin, and his trunk-like legs were covered in hunks of fused black stone and glistening burns. When he spoke, his body grew a thousand mouths that screamed in unison. Before he hit a growth spurt in his adolescence, Lukka already sensed he was different from others. Perhaps responding to this feeling, he was bullied by a group of five older boys. He later exacted revenge on each of them. Lukka bonds with a Patagia Tiger. Lukka was the Commander of the First Special Intercept Squad, commonly known as the \"Specials\", which acted as a small incident reaction team. He had spent half his life - twenty years - in the Coppercoats, and the last two years as captain of the Specials. After he bonded with a winged cat , Lukka was banned from Drannith and became an outcast. The visiting planeswalker Vivien Reid had sensed some of his bonding magic and came to investigate. She rescued Lukka from his pursuers and befriended him. They found out that a crystalline formation in the north, the Ozolith , had been instrumental in causing the bondings and the newfound rage of the monsters against Drannith . The Ozolith had been used for this purpose by an unnamed planeswalker known for his meddling. Since Lukka had been successful in counteracting the rage in his winged tiger, he and Vivien theorized that he would be able to neutralize the workings of the Ozolith, as well. Lukka gathers an army of monsters to attack Drannith Under the influence of the Ozolith he became powerful but imbalanced. He formed an army of beasts, that he proposed to use to defend the city. As Kudro refused to listen, Lukka killed him. Against his deluded expectations, Jirina refused to join him. She attacked him and fled home to take command of Drannith's defenses. Believing that his newfound power would save Drannith in the end, Lukka and his army attacked the city. The sheer number of monsters threatened to overrun Drannith, but Jirina's strategy of defense and use of the bonders proved enough to turn the tide of battle. Facing defeat, Lukka attempted to use more of the Ozolith's power but was warned by the unknown planeswalker of its consequences. Lukka refused to listen and the Ozolith exploded, causing his planeswalker's spark to ignite as he planeswalked away. Lukka awoke in a swamp in another world facing a small group of dangerous beasts. Although the power of the Ozolith was gone, Lukka was still able to control one of them. Glad to be alive and with at least some of his power intact, Lukka vowed to one day return home. Lukka on Arcavios . Still coming to terms with his newfound power, Lukka traveled to Arcavios . Faced with the hostility of the inhabitants, he was drawn to the crazy, mysterious presence of the dark mages called the Oriq . After he had arrived on the plane, he bonded with a grey fox-like, fire-breathing creature, called Mila . During a confrontation between the Oriq and a Dragonsguard , Lukka was mistaken as one of the Oriq but was saved by Mila. While searching for the dark mages, Lukka was captured and taken to their leader Extus Narr , who Lukka discovered knew planeswalkers. Extus explained that there were things he could teach Lukka and proposed a trade. Lukka had developed a deep distrust of Strixhaven and its influence on the plane, due in part to his rejection by local inhabitants and the ongoing persecution of the Oriq. Now with a common enemy, Lukka decided to help the Oriq by distracting Kasmina and coordinating a mage hunter attack on Strixhaven. However, when the tide was turned by the Founder Dragons , Lukka quickly left the battlefield. He was last seen wandering the land with Mila and a few of the remaining Oriq, scrounging for food and shelter. It is currently unknown what Lukka received from Extus Narr in exchange for his help. Jace Beleren approached Lukka to enlist his help in supporting the Mirrans ' efforts against Elesh Norn on New Phyrexia , arguing that his military expertise would be an invaluable asset to the strike force and that Ikoria would be threatened. Lukka initially refused, but was eventually convinced by Vivien Reid , who persuaded him that he could return to his home plane a hero, rather than a traitor. When the planeswalkers were scattered across the Spheres upon entry, Lukka was stranded alongside Nissa Revane in the Hunter Maze and made the mistake of forming the eludha with a Phyrexian beast . This began poisoning his mind and made him susceptible to compleation . By the time he fought Glissa and Vorinclex , he fully bonded with his companion and the two became one. His body became covered in copper-like metal, a pair of large, durable arms sprouted from his back connecting to wires attached to his head and shoulders, his original arms became fully mechanized, and his legs became thinner and longer. After the Wanderer intervened to buy Nissa time to escape, Lukka was ordered by Glissa to capture Nissa alive since she would prove useful to Phyrexia. He was presumably successful in this effort, as Nissa was later compleated. As New Phyrexia's Invasion of the Multiverse began, Elesh Norn sent Lukka back to Ikoria to conquer his homeplane. He planned to do this by first subverting the plane's monsters, though Norn and Tamiyo had their doubts about his success. Lukka first destroyed Drannith , leaving a convoy of survivors that fled for Lavabrink . On his way to intercept them, he crossed through the wilds of Ikoria, compleating the monsters he came across and adding their biomass to his form. Vivien Reid and Chevill set a trap for him to no avail. Ultimately, Jirina, who was leading the convoy, made a risky bluff by leading the survivors, and consequently Lukka, into the lair of the apex monster Vadrok . Vadrok's magical fire obliterated Lukka's massive form, leaving just what remained of him and his bonded companion. Vivien shot this form with arrows until Lukka was no more, and Vadrok annihilated his corpse for good measure. Lukka was a Bonder from the plane of Ikoria , and as such he could form a magical bond called Eludha with creatures across the multiverse. Here are the various creatures he  bonded with across the planes. Lukka's first experience bonding was with a large winged cat known as a patagia tiger. The cat was huge, easily taller than a man, and longer than a cart. Its basic form was cat-like, with thick white fur cut by light brown stripes. Its fangs included two long canines that protruded beyond its lower lip like a pair of swords. It had leathery wings. The monster was very smart and tried to protect Lukka's humanity, but was executed in a Heartless Act by General Kudro . Lukka never even gave her a name. Mila is a magical, grey fox-like creature with many spots that can breathe fire. Lukka first meets her when she brings him food after he nearly starves. He then bonds with her. Sometime later, he gets into a fight with a Dragonsguard and Oriq members. Mila then rescues him. He then strengthens the bond with her. When Lukka arrived on New Phyrexia, he encountered Nissa and the Wanderer imperiled by a Phyrexian beast he dubbed a centaur hulk, later revealed to be named Rothga . He formed the eludha with it to keep his companions out of danger, and later used it to help the party traverse the Hunters' Maze. However, when he instructed it to \"secure him\" to keep him from falling off one of the monolithic trees, it did so by piercing his body with oily tentacles, inducing phyresis . Later, when he fully succumbed to the infection, he found that the centaur hulk could fully fuse with him, and the two became a singular entity. After his compleation, Lukka's eludha changed, and he began incorporating all beings he came across into his growing, hulking body. Associated cards: Depicted in: Quoted or referred to: Lukka's flying tiger: ^† Scryfall does not record flavor text for digital cards. See Alchemy: Phyrexia/Flavor text"}