{"text": "One of the five crime families of New Capenna , the Maestros are the elite assassins and master art collectors of New Capenna . They are associated with mana, but are centered in black. Once the aristocracy of Old Capenna , the Maestros of New Capenna are master assassins with a code: be precise, be professional, and be thorough. They think of themselves as artists and critics. Paintings, sculptures, or performances, the Maestros are avid collectors always in search of the next big thing, while at the same time, quietly working to curate New Capenna's past, keeping the secrets of Old Capenna hidden in their museums, archives and vaults. They maintain a public front as an upscale organization of art aficionados with the goal of preserving the art and culture of Old Capenna. Beneath this polished veneer, they are a shadowy organization of elite assassins focused on maintaining power, influence and wealth. Though their organization is composed of killers, each member considers themself an artist at heart. Led by the vampire Anhelo , the Maestros are New Capenna's premier assassins, vampiric professional killers who see a contract not just as business but as a chance to perform. They maintain a warped and self-serving view of their work: they are saviors of the city, philanthropists beyond compare, and are ruthless in their pursuit of the fame and cultural cache that they believe they deserve. They will kill without a thought or moment of regret if it means achieving their goals. The Maestros are thick amongst the Mezzio and Park Heights . Rarely found in the Caldaia unless engaged in philanthropic pursuits, Maestros enforcers and assassins prefer what they think are the finer, more cultured districts of New Capenna. Equally at home in an exclusive lounge as they are at a high-class gala, members of the Maestros have an undeniable allure about them—a gift of vampirism, to be sure, but also of taste. Their headquarters was the Museum of Old Capenna, in Park Heights, where Lord Xander kept his office. During the time of Old Capenna, the Maestros served as the plane's nobles and art aficionados. During the plane's fall, they safeguarded historical and cultural works, and most of the surviving records, art, and culture of Old Capenna in the city today was recovered by the Maestros. The vast majority of the Maestros were compleated by Atraxa during New Phyrexia's Invasion of the Multiverse as they had the most historical knowledge of the Old Phyrexians that had attacked centuries ago. In her rage, Atraxa obliterated the Museum of Old Capenna, the family's former headquarters, leaving only rubble. The other families noted that the Maestros were effectively all compleated. It is currently unknown if there are any uncompleated members of the Maestros, if at all. The Maestros were designed around contract killing aspect of organized crime, though their adherence to art highlights the difference between \"cover\" lives and \"real\" jobs for criminals. The Maestros mechanic is Casualty , doubling their spells by sacrificing expendable minions. Anhelo , the family's boss and formerly Xander's Deacon. Xander , the family's Vampire former boss. Elspeth Tirel Evelyn , a vampire rogue . Fiero Vespin , an art dealer. \" Red Gloves ,\" an enforcer. Demons Devils Humans Vampires Assassins Citizens Nobles Rogues Warriors Wizards Much of the Maestros' design is based on the tropes of The Godfather series . In the Streets of New Capenna soundtrack their track is called: Old Money. Referred to:"}