{"text": "Mageta was a Jamuraan general at the time of the Keldon invasion of Jamuraa . He was known as \"The Lion\" by his men due to his ferocity in battle. He also tended to wear animal skin as clothing, though whether this was related to his moniker is unclear. Due to his size and the white warpaint he wore, he looked fairly similar to the Keldon warriors he battled. When Barrin came to inspect the troops sent by Arsenal City and Kinymu to repel the Keldons, Mageta was the commanding officer who met him and guided Barrin's tour. Mageta was very proud of the mechanical ants and crabs the Kipamu League used, although Barrin believed he was underestimating his opponents, was rather arrogant, and was unwise to rely so heavily on mechanical troops. Mageta narrowly survived the subsequent defeat of his army at the hands of the Keldons and fought his way back to Arsenal City, where he remained nominally in charge of the ground forces, although the real organization of the campaign was now in the hands of Barrin, Rayne and Teferi . During the Keldons' siege of Arsenal City, Mageta led the foot soldiers in a counterattack. His reputation and courage inspired the inexperienced troops to push back the invaders and win the crucial battle. Although he suffered several injuries in the battle, Mageta continued to lead the Kipamu forces from the front line for the remainder of the war, becoming a symbol for them to rally around. As the tide of the campaign swung in Jamuraa's favor, Mageta and Barrin led the counterattacks against the retreating Keldons. When Latulla made the last attempt to defeat the Kipamu League in battle Mageta once again led his troops from the front line. Although he once again suffered several injuries, he nonetheless survived the battle and carried on to rout the defeated Keldons as per Barrin's orders. Mageta was in Ki'pamu, most likely preparing to lead Zhalfir's armies against Phyrexian Invasion , when the entire country was phased out by Teferi. Over three hundred years later, his descendant Kwende tried to avenge him, thinking him killed by Teferi. When Teferi found that Zhalfir had been preserved in a pocket plane , he discovered that only a decade had passed. Mageta was badly wounded when Kaervek 's Amber Prison shattered, but he survived. Sidar Jabari took control of the army in his stead. Associated cards: Quoted or referred to:"}