{"text": "The Mana Rig was a complex of structures built by the Thran on Dominaria 's continent of Shiv . Perched upon a cliff's edge in Shiv's brutal desert, the metal structure had the size and complexity of a small city. The huge installation was full of functional Thran technology. Its original purpose was to create huge crystal batteries of energy, called powerstones , that can be used to run all manner of artifact devices. It also could produce Thran metal , a nearly indestructible kind of steel. At the time of the Thran, there had been more than one Mana Rig, another being located at Halcyon in Terisiare . Originally built by the Thran as a prototype powerstone factory, the Mana Rig was found by Urza during the events of Urza's Legacy . As a sacred location to the Shivans , Urza's entry into the Rig nearly sparked a war. He managed to get the Goblins and Viashino to work together to operate the Rig, which proved necessary as the Thran had built sections of it with goblin workers in mind. It produced Thran metal for the Skyship Weatherlight as well as a powerstone in which the mana from Serra's Realm would later be stored. During the Phyrexian Invasion of Dominaria , the Mana Rig came under attack by Phyrexian forces who came to either claim it or, failing that, destroy it. However, to both Yawgmoth 's minions and Urza's surprise, the seemingly defenseless structure launched a counterattack by deploying a detachable and mobile segment of itself that could shoot huge geysers of molten lava with deadly accuracy, a feature installed by Jhoira who had been in charge of the complex. This section of the Mana Rig was left behind for Urza to use to continue forging Thran metal and Powerstones while the main part of the Rig along with Jhoira and a large portion of Shiv was phased out by Teferi along with Zhalfir until its return during the Time Spiral storyline. Used as a workshop by Jhoira and a base of operations by the New Coalition , the Mana Rig was the focal point of the largest battle during the Second Phyrexian Invasion of Dominaria . Once Sheoldred 's Phyrexians had overrun it, Jhoira triggered the Mana Rig to self-destruct. Phyrexia completed their strategic objectives - neutralize the Sylex and capture Karn - but at the cost of a large portion of their ground forces and many of their leadership. The Coalition lost three commanders, but escaped with most of their military force. Dozens of small powerstones were recovered from the Rig's wreckage. Circa 4560 AR, the Mana Rig was deemed too powerful for anyone to use by the Shivan Council and left to sit idle. Gavon Deniz attempted to seize control of it, failed, and disappeared along with the Power Stone the rig was creating. Depicted in: Referred to: Urza's Legacy Backstory"}