{"text": "The Meditation Plane (also known as Bolas's Meditation Realm and after the War of the Spark as the Prison Realm ) is a plane in the Multiverse . It is a surreal, always-changing plane whose geography can mirror the thoughts and potential futures of its inhabitants. Millenia ago, it was visited by Ugin and Bolas on their first planeswalks. Other planes were accessible from here through bubbles floating in the air. Many, many times and adventures later, the two planeswalking brothers confronted each other. First above the wide waters of the Meditation Realm and then on a wild pummeling path through the planes, they struggled for days, years, generations. In the end, by diverse paths, they returned to the Meditation Realm where Bolas killed Ugin. Monstrous waves rose from Ugin's fall in the water. The waves ran on and on, washing far beyond the bounds of the Meditation Realm into the web of connection that links the planes and the Blind Eternities . Bolas was flung through many planes before he fell hard back into Dominaria, onto the island chain of Madara . After this confrontation, the plane became a wilderness of rock; barren and wrecked, all its serenity drained away into the interstices of the Blind Eternities. A long time later, it began to restore itself. A pale sheet of liquid trickled up as out of nowhere, returning from the unseen and untouchable web of darkness. With eerie silence, the realm reformed with its silvery waters. When the waters ceased rising, they grew still, and in that still became a mirror waiting for the reflection of Ugin. He inhaled, pulling the waters into himself. They curled and frothed into every crevice and wrinkle and scale and indentation until his horns sparkled and his claws gleamed and his eyes shone with magic. The dragon was reborn and floated above a once again dry seabed beneath the luminous sky. After his departure, the process of restoration started anew. Considering the Meditation Plane the site of his greatest triumph, Bolas thought it a fitting place for him to ruminate over his plans. To give himself a focal point on which to center his meditation, he chose a spot at the center of a vast span where no islands broke the surface. Here, he erected two gigantic curved horns so they emerged from the waters as if a gargantuan dragon lay sleeping beneath. Centuries later, the Meditation Plane could only be accessed from Dominaria by skilled servants of the Madaran empire. Tetsuo Umezawa had practiced with Ayesha Tanaka for years to discover how to physically travel to the Meditation Plane. After killing the emperor's assassin Ramses Overdark in the Imperial Shrine on Madara , the champion used this skill to flee fully into the Meditation Plane. Bolas tracked the energy that Tetsuo carried—Lord Dark's essence—and projected his mind to the realm and leaving his body unprotected. In the Meditation Plane, Tetsuo revealed the full extent of his plan, having destroyed Madara's rich and constant mana flow to rob Bolas of his body and unleashing Dark's essence in a living attack on Bolas's mind. The champion cleaved the elder dragon's spirit in half and narrowly escaped to Madara, just as the destructive power released in the Planeswalker's death tore and collapsed the very boundaries of the realm. However, as a result of his connection to the temporal rift , a ghostly remnant of Bolas' life force still lingered by the Madaran coast, trapped between the material world and the Meditation Realm. Using Venser 's latent planeswalker spark , he was able to finally escape his prison and be fully reborn into the physical world, regaining his body by pulling a copy of it through the rift from an earlier point in time. Sarkhan Vol visited the Meditation Plane following his assignment at the Eye of Ugin . Sarkhan was debriefed by Bolas as he traveled from the Pools of Becoming to Bolas's Donjon , where he found the dragon reconstructing the unconscious body of Tezzeret . Vraska visited the Meditation Plane following an invitation she had received on Ravnica. There, Bolas offered her leadership over the Golgari if she traveled to Ixalan and successfully located the Immortal Sun . Baishya , through a link with Ugin, was able to scry into several of Ugin's memories of this plane. In the story \"Chronicle of Bolas\", she was the sleeping girl atop the sea. Bubbles that rose from the sea containing memories would burst as they reached her misty form, and a new memory was shared with her. Current appearance of the Meditation Plane, after Ugin regains the plane. During the War of the Spark , Ugin resided in the Meditation Plane. After Bolas's defeat, where Jace Beleren had faked Bolas's death at Ugin's behest, Ugin secretly transported the now mortal Bolas back to the Realm. Ugin explained that it was his world even before Bolas became a planeswalker and that he helped Niv-Mizzet to be reborn. Ugin also reveals that the Spirit-Gem between Bolas's horns had been made from Ugin's own essence and allowed the Spirit Dragon to see every step and mistake his brother made. Ugin then takes away both of Bolas's names and renders the fallen one nameless. Ugin told his brother that he would become his jailer for eternity and expanded himself over all the Meditation Realm. The Realm thus became an eternal prison for Bolas and Ugin alike. Neither could leave. Pools of Becoming Bolas's Donjon Aminatou (non-canon) Ashiok Isona Maive (non-canon) Nicol Bolas Sarkhan Vol Tezzeret Ugin Vraska Depicted in:"}