{"text": "Memnarch was the sentient incarnation of the Mirari who was driven mad by a mysterious oil . For most of the history of Mirrodin, he was the secret lord of the plane, plotting and manipulating the very structure of the world to realize his insane goals. Memnarch's existence, strangely, manages to predate his own creation. During the creation of Argentum , Karn created golems to occupy and maintain his world, but none were as close to their creator as the Warden of Galdroon, Karn's castle. When Karn chose to leave Argentum to train the newly ascended Jeska , he granted his warden two gifts. The first was the Mirari orb, with all of its experiences and intelligence, which allowed him to become something more than he had been. The second was stewardship over the plane itself. His mind was greatly expanded with the power of his new gifts, and he spent decades wandering his maker's plane, learning the incredible mathematics of the world he was regent of. He came to understand the way the world had been constructed, and realized how empty it truly was. It was during this time, that the first anomaly came to his attention. The Blinkmoths populated the skies, but Memnarch did not understand from where they had come. It was their presence that caused him to take action, to bring true life to the world. However, before his grand vision could be realized, a small, almost insignificant stain caught his eye. That spot of oil would alter the history of Argentum forever. His first act was to rename the world Mirrodin , after his previous existence as the Mirari. Utilizing his ur-golem compatriots, he terraformed the plane to support life, and once they had accomplished their task, he began to systematically destroy the remaining ur-golems. With the world remade to his specifications, he began to abduct inhabitants of other planes en masse using an insidious device known as a soul trap . The abductions went on for centuries. All the while, a silent threat rose in the core, its only adversary the lone Memnarch. The spore called Mycosynth began converting metal to flesh and flesh to metal. Memnarch destroyed the mycosynth as quickly as it rose, but it was a tiring effort and Memnarch began to grow weary, his mind and body suffering from his isolation. His eyes became soft, then his face. He was becoming flesh. Memnarch was driven to find the answer, then driven mad by his failure to find it. As his plans came to fruition, Memnarch became more and more obsessed with his missing creator and the worlds beyond his own. Experimenting with the blinkmoths that had come from beyond his world, he discovered their fluids could be refined into a serum which expanded his consciousness beyond anything he could have imagined. He began to ingest the serum in larger and larger doses. Dissatisfied with the rate at which his perception grew, he began to modify his own form to accommodate more and more of the substance. He created a huge serum tank as a surrogate body, with equally huge metal legs to support it. Unfortunately, this mind-altering substance only served to exacerbate his madness, and a new obsession took root. He dreamed of joining his creator in the multiverse. Memnarch dreamed of becoming a planeswalker. His grand vision took a dark turn as he began harvesting the kidnapped inhabitants of Mirrodin. From the Panopticon he scoured the population for beings who could possibly possess the planeswalker's spark , and while his agents sought that unique individual, Memnarch began planning his most ambitious project yet. The conversion of the entire world into a planet-sized machine able to transfer the planeswalker's spark from one being into another. His attempts to find a planeswalker spark finally bore fruit when he found Glissa Sunseeker , becoming obsessed with capturing her and stealing her spark for himself. Time and again, she escaped Memnarch's machinations, eluding his agents and armies as she plotted her revenge against the power-mad golem for the death of her family. Finally, after scouring the surface of the world and collecting the legendary Kaldra artifacts, she confronted the despot with her champion. Unfortunately for the young elf, Memnarch seized control of the Kaldra avatar and turned it against her. The only thing that saved her was the sacrifice of her close friend Bosh , one of the last ur-golems that existed. While Bosh fought the Champion, the power source for Memnarch's spark transfer device, the mana core, finally destabilized and gave birth to the Green Sun . Foiled, but undefeated, Memnarch was left with little recourse. His plans before had been subtle, but his patience had run far too thin. The Panopticon lay in ruins, his grand schemes were in shambles. Where manipulation had failed him, Memnarch turned to total brute force. He converted his Vedalken worshippers into shock troopers, allied with the commander of the Nim , and turned his own terrible artifice against anybody that would harbor Glissa. Backed into a corner, Glissa forged an alliance between the goblins , Leonin , and elven armies. In a joint attack, they struck at the heart of the Mephidross , hoping to stem the onslaught of nim that poured out of the dross. In this attack, Memnarch trapped her for five years in a temporal bubble. Her allies were captured, and with the assistance of the tortured goblin Slobad , Memnarch altered the devices he had planned to use before. The new power source was to be the very souls of the inhabitants of Mirrodin. Five years of war tore apart the surface of Mirrodin while Glissa slept. It seemed as if Memnarch would destroy the last of the resistance, but when Glissa awoke, she managed to escape and rallied the remnants of Mirrodin's population. In a last desperate attack, they assaulted Memnarch's stronghold, just as the golem had planned. With Glissa in his clutches, his dreams appeared to finally be coming true. However, Glissa had only one way to defeat him. In the instant the spark device activated, she threw herself at him, and together, they both fell into the raw mana core of Mirrodin. The device destroyed the soul trap of every living thing on Mirrodin, and with only one target left, it was transferred to Slobad. Upon Memnarch's death, Karn could finally return to his plane. Karn restored the souls of everyone that died, using the power of Slobad's newly-acquired spark to cast the spell. The kidnapped inhabitants were returned to their long forgotten homes and Karn destroyed Memnarch's body, recovering the Mirari, which was given to Glissa, Slobad, and Geth to guard. Though Memnarch had vanished from the face of Mirrodin, his legacy remained. The face of the world was forever altered, and thousands of inhabitants of the world still remembered his terrible secret reign while tiny Memnites skittered across the world on inscrutable tasks. A part of Memnarch's legacy was retained in the form of the Myr Urtet . Associated cards: Depicted in: Quoted or referred to:"}