{"text": "The Mephidross (or Dross , for short; Phyrexian : muiEdrL , IPA : [mefidrs] ) was a swamp of sludge, hazardous chemicals and waste, broken and cast off machines, and corroding metal on the world of Mirrodin . It bordered on the Oxidda Chain . The swamplands of Mephidross are a large expanse of foul water covered over by a scum of black ichor. It is a toxic wasteland of ooze, filth, and corrosion. From a distance, the sky above the Dross looks like ink swirling in water. As you approach it, the ground begins to soften, leaving spongy footprints in the land. But the most striking feature of the Dross is the sound it makes. The whole swamp hums with a low, dissonant chord. In some places, it sounds like a distant generator. In others, it's deafening. Some report hearing whispers beneath the constant thrum. The sound comes from the chimneys of the Dross, ominous structures that \"grow\" seemingly at random throughout Mephidross. These \"smokestacks\" range from ten to three hundred feet high. All emit the sickly green corrosive gas called necrogen that slowly saps the life from creatures, turning them into nim . In the center of the swamps is Ish Sah , the Vault of Whispers, a large fortress that was used to control the activities of the swamp. Here Geth , the ruler of the Moriok, dwelt. The Black Lacuna was also located in the Mephidross. During the Leveler War against Memnarch 's machines and the Nim, the Mephidross advanced exponentially into the other territories until the mad guardian was put down. During the advance of Phyrexia , the Dross expanded also, swallowing large parts of the Tangle and the Razorgrass Fields. The Seven Steel Thanes now rule fiefdoms within the area, jockeying for control over the swamplands. As Mirrodin was compleated into New Phyrexia, the surface was extracted of resources, leaving a wasteland known as the Mirrex . The Mephidross, the dominant biome during the Mirran-Phyrexian wars, was ironically siphoned out entirely into a new layer within Phyrexia, the Dross Pits , where the Thanes now dwell. The Vault of Whispers. The Dross Pits are the black-aligned sixth sphere of New Phyrexia. Sheoldred, the other thanes, and the black-aligned Phyrexians reside here. It began as thane Roxith 's intended Flesh Layer, but Sheoldred tricked him and took over the domain. The landscape is shallow, pockmarked with glowing pools of liquid necrogen, shining bright green and poisonous. There is otherwise no light, as sunlight does not reach this sphere. Humped, crude structures of black-gilded bone break up the horizon. Acidic pools and toxic vents spewing necrotic gases are siphoned from the Dross Pits. Non-Phyrexian visitors are killed by inhaling the Pits' fumes before they can be compleated by the spores they contain. Its underside is silver. From the peak of the Fair Basilica, Phyrexians can travel up a shaft to the Dross Pits. Those unfortunate enough to get caught here were sent to Sheoldred's Coliseum to fight for Sheoldred's amusement. The winners harvest parts from the losers and graft them to themselves. No one exited the coliseum alive and unchanged. Koth was one survivor of the arena, though the experience forever changed him. The Coliseum is a vast, black structure surrounded by a massive ribcage. Its gate is so narrow that competitors are forced to enter single file. The interior is a vast bowl surrounded by steep ranks of backless seating. Its floor is black metal, with a pool of black necrogen at its center and around its edges. The planeswalker Nahiri cleaved the Coliseum from the Dross Pits and dropped it on the Fair Basilica . Geth's fortress, possibly the former Ish Sah , is a colossal structure of black bone and red sinew towering above the layer. It contains a mockery of Elesh Norn 's throne. His holdings are enclosed by a gate that requires a musical puzzle to open. The Moriok , the human occupants of the Dross, lived in scattered communities throughout the swamp. The evil magic of the Necrogen Mists affected the Moriok 's brains, exacerbating their natural human tendencies toward hate, aggression, and greed. Nim , the zombies created by the Necrogen, vent the gas themselves, as well. They were very numerous and, along with the already horrible conditions of the environment, made this region inhospitable to most life. The leonin and the people of the Razor Fields were the bitter enemies of the nim. Large, horrifying creatures that slither through the Mephidross using their huge scythes to scoop living creatures into the cavity in their back. These were vulnerable to Phyrexianization . Vampires lived deep within the Mephidross, in areas inhospitable even to the Moriok. The warlord Geth once claimed one of these creatures as his champion, proclaiming it the sole member of its species. Of those vampires, only the most skilled assassins are granted a seat in the Bleak Coven. They are led by Vraan , the Thane of Blood. Associated cards: Depicted in: Referred to: ^† Scryfall does not record flavor text for digital cards. See Alchemy: Phyrexia/Flavor text"}