{"text": "Cliffside Market Mercadia was a plane near Dominaria ruled from Mercadia City , sitting strategically atop the inverted mountain Mount Mercadia . The city's leadership was highly corrupted by various influences, mainly by the scheming Kyren who controlled the magistrate under Volrath 's employ. It is notable that goblins are highly respected and intelligent beings in Mercadia, much different from their Dominarian relatives. The humans of Mercadia City, though not those found elsewhere on the plane, are the descendants of upper-class Thran from Halcyon who were brought to Mercadia by the planeswalker Dyfed in an act of penitence to keep them safe from Yawgmoth during the Thran Civil War . The Kyren were descended from the Thran's personal servants and their goblin engineers, workers in Glacian 's factories. Mercadians are an evasive, aloof people: the nobles are hedonistic, apathetic, and lazy, while the commoners are selfish, grasping, and paranoid. Mercadian goblins are much larger and smarter than most goblins throughout the multiverse , and they actually seem to be running the city despite their servile attitudes. Furthermore, a guild of professional assassins, thieves and horrors called Caterans roams the back alleys of the marketplace, ready to terrorize or murder anyone for the right price. Badgers Beasts Boars Cats Dinosaurs Djinns Dogs Dragons Dragon Wurms Drakes Dryads Elementals Faeries Fishs Giants Goblins Griffins Harpys Humans Horrors Illusions Insects Jellyfishs Krakens Lizards Manticores Mongers Merfolks Minotaurs Nautili Ogres Rhino Satyr Beasts Shades Squids Snakes Spirits Trolls Unicorns Walls Wolverines Wolves Zombies A map of the plane of Mercadia taken from \" Mercadian Masques \" by Francis Lebaron . The Deepwood Ouramos Mercadia City The Cliffside Market Rishada The Rushwood Samarkeena Saprazzo The Silverglade The Weatherlight and its crew narrowly escaped Rath and crash landed in Mercadia, where the ship was stolen by the Cho-Arrim . Mercadia was the setting for the Mercadian Masques set, which revolved around the Weatherlight crew's long and unpredictable ordeal with the Mercadian peoples to repair their ship, as well as help the rebels overthrow the corrupt Mercadian government. It is believed, in differing versions by all the peoples outside of Mercadia City, that Ramos was a dragon god from another world. He battled his evil brother, Orhop. The wake of the combat left chaos and calamity, and upon seeing this, Ramos attempted to save as many people as possible from the devastation. He gathered the merfolk in the sea, the crew of a ship, and the tribesmen from the plains. Upon taking the peoples under his wing, he brought them to a new world: Mercadia. Once here, Ramos collided with something and fell from the sky. Set ablaze by the planar jump, Ramos fell into three pieces: Mind, Soul, and Body. The Cho-Arrim rode the Soul into Rushwood. The Saprazzans fell with the mind into the sea, and the Rishadans fell off with part of the body onto the shore. Ramos' Bones crashed into the Deepwood, where those unfortunate enough to not have fallen off earlier were left as zombies to guard Ramos' resting place. This myth is not far off, as Ramos was merely a dragon engine crafted by Urza to battle Mishra and save those caught in the battlefield. When the Golgothian Sylex was activated by Urza, Ramos hastily gathered as many victims as he could, including a school of merfolk, soldiers from the battlefield on Argoth , and a pirate ship nearby. Then the great dragon was sent to Phyrexia by the immense blast of the Sylex, where he then went through a Phyrexian portal (which would later connect Mercadia and Rath) to Mercadia. Once there, he deposited the merfolk in the sea, losing his Power Matrix in what would become Saprazzo due to a 'broken heart' at seeing the many refugees set aflame by the blast of the Sylex. The Rishadans fell off in the shore, and the Cho-Arrim in the Rushwood. After crossing through what is now Mercadia, Ramos fell in Deepwood, where the fallen ghouls were animated by his last energies. He somehow created dryads from the trees to guard his bones, five power crystals, as well. Mercadia was a target in New Phyrexia's Invasion of the Multiverse . High Mercadian, spoken by the residents of Mercadia City According to Takara , the language was intelligible with Rathi. Dyfed Karn Leshrac Nahiri (non-canon) Nicol Bolas The crew of the Skyship Weatherlight , notably: Gerrard Capashen Hanna Orim Sisay Squee Starke il-Vec Tahngarth Ramos Associated cards: Referred to:"}