{"text": "Merfolk is a creature type for a race of aquatic humanoids . The first card to appear with the creature type was Merfolk of the Pearl Trident in Alpha . Merfolk is the characteristic race for the color blue , though they have also shown up in white on Lorwyn , black on Shadowmoor , and green on Ixalan . Additionally, merfolk appear in green on Ravnica , Theros and Dominaria , albeit in addendum to blue. Merfolks' origins are magical rather than biological, and they are neither mammals nor fish. Humans speculate that merfolk are Atlantean humans that adapted to the ocean; merfolk speculate that humans are merfolk that have adapted to live on land. They possess both gills and the capacity to breathe the air above water for at least some time. They do not nurse their young, as their upper bodies are holdovers from their past that gave them the ability to lure humanoid prey into the water. They likely lay eggs rather than give live birth. On Arcavios , merfolk can be found among the faculty and students of both Quandrix and Prismari colleges of Strixhaven . They are bipedal, and many possess elaborate hair-like head fins. Gaea's Skyfolk were an indirect product of the Phyrexian Invasion . As the whole world mobilized its reserves, even ancient adversaries cooperated, lending their diverse skills in the service of the common good. The Skyfolk were partially of merfolk and partially of elven origin, combining the unique features and skills of both races into one. A detailed description of their abilities is not available, but the major one was the ability to fly. The details of the creation of these prodigal creatures are, however, not known. The Merfolk of the Copper Conch of Lat-Nam are mutated humans, created by the Sages of Lat-Nam to guard the island. As such, they have legs. The Merfolk of Lat Nam are later portrayed as a speechless species that is highly aggressive toward humans and attacks merchant ships on their way through the area to pillage them. In Otaria , the merfolk lost much of their Mer Empire to the cephalids due to Laquatus ' treachery. Now they are a lesser race that serves the cephalids. Razorfin Hunter s are a bizarre crossbreed of goblins and merfolk found beneath the seas of Dominaria. Little is known about them; although it is likely that they were the result of mutations caused by the Rathi Overlay . Vodalian Merfolk lived in the Voda Sea , being particularly prominent in the waters around Sarpadia . They once had an extensive empire, but following the climate changes that took place following the Sylex Blast , much of their territory was overrun by the Homarids . However, some vestiges of the Vodalian Empire, such as the colony of Etlan Shiis , survived the Homarid attacks and still existed at the time of the Phyrexian invasion. The name of the empire is derived from the Russian (and generally Slavic) word \" voda \", meaning \"water.\" By this, the known Vodalian characters mostly have Russian-themed names. The merfolk of Eldraine are known as undines . Undines have amber-colored seaweed-like hair and faces resembling humans, though with flat nostril slits and large, shining eyes. They are defined by their compulsive curiosity. They are said to hoard precious magic items, tomes, and other secrets in lochs, ponds, and wishing wells across Eldraine. They are obsessed with learning all they can, occasionally to the brink of madness. Although all undines are carnivorous creatures, pale-skinned variants known as dark undines are far more aggressive and ravenous. Four undines assisted Rowan Kenrith 's group across a river to meet with Indrelon in exchange for knowledge and secrets. Merfolk are one of the major races on Ixalan . They used to rule much of the continent of Ixalan, but their empire was eclipsed by the Sun Empire of the humans. Nowadays, merfolk live a nomadic existence in the jungle, their shamans guiding the rivers and vegetation around them; the connection to the rivers, in particular, is so strong that tribal leaders shed their names in favor of those of the rivers that chose them. The Merfolk believe that they must keep Orazca and the Immortal Sun hidden from trespassers. The merfolk of Ixalan are visually striking. Their fins are colorful and bright like tropical freshwater fish, and they bear jade jewelry, weapons, and armor. They are a freshwater species, distasting the sea's salt. Their meditation techniques are based on heartbeat rather than breath, as they need to stay in focus both above and underwater. The Merfolk race of Ixalan is separated into two sub-species. One favors the land, living in trees, and focusing on the magic that controls vines and branches. Uniquely, several of these are mono- green . The other is more at home in the water, living in the waters of the Great River and the Inner Sea. While they prefer to dwell in shallow waters, they spend a fair amount of time on land as well. Merrow The fish-tailed merfolk of the dual-plane of Lorwyn–Shadowmoor are called merrows. In Lorwyn merrows are razor-witted; they control commerce and trade routes, which take place across the plane's extensive rivers. They are the couriers, intermediaries, and merchants of the plane. Merrows are native to rivers but able to breathe both water and air. Given the fishlike anatomy of their lower half, they can't move effectively on land without strong magic. However, they control and maintain the so-called Merrow Lanes, the system of rivers that crisscrosses Lorwyn and connects its furthest-flung points. The Lanes extend overland via rivers and streams, underground via subterranean tunnels, and even up into the town centers of other races via wells. The deepest parts of the subterranean rivers of the Lanes are called the Dark Meanders. Most merrows steer clear of the Meanders due to the lack of light and the ease with which one can get lost. Lorwyn merrow society is organized into schools, and each school is led by a reejerey. Known schools include the Silvergill, the Stonybrook, the Paperfin, the Weirwinder, and the Inkfathom Schools. These names are just the \"land-walker\" language closest imitations of the true names (e.g. Paperfin being \"Paupurfylln\" in Merrow). Of these, the Inkfathom School is the most interested in plumbing the Dark Meanders. Merrows have many different occupations and avocations, and the system of terminology is very important to them, so it's best to study up before your visit. A \"rudder\" is a merrow guide who knows the Lanes like the back of his scaly hand. \"tideshapers\" and \"aquitects\" are merrow mages adept in water magic, who use their abilities to reinforce riverbanks, guide currents, or even alter the course of the Lanes altogether. \"Troutherds\" and \"crawherds\" manage schools of river trout and beds of crawfish, respectively. A \"landspanner\" is a merrow able to leap from one waterway to another one nearby; expert landspanners can hunt large land game this way — or patrol merrow territory for intruders — with spears and spiked nets. A \"fallowsage\" is a wise elder merrow, many of whom find comfort in the dappled shade of riverside willow trees. A \"wellgabber\" is an envoy who uses a well to communicate with members of other races. After the Aurora, merrows became more fishlike. Their wide, toothy mouths hindered their ability to speak, forcing them to communicate through hisses, a bubbling froth through the gills and nostrils, and their guttural version of landspeech. Amongst other merrows, they communicated simple facts and moods through secretions from their scent glands. Shadowmoor merrows' skin is made up of tiny diamond-shaped scales topped with even smaller barbs, which can catch and rip delicate flesh. The crisscrossing pattern of scales gives off an oily sheen. Long, needle-sharp structural spines support merrows’ fanned swimming and rudder fins. The spines can, in some cases, deliver poison for hunting and defense. Shadowmoor merrows have developed musculature in their tails that allows them to sit upright on land, along with sets of specialized “walking” fins that they can use to dig into the earth and drag their bulk along the ground. This mode of transportation is clumsy and inefficient, but it allows raiders and hunters to collect goods and prey before returning to the dark waters of the Lanes. Overcome by covetousness, Shadowmoor merrows became murderous cutthroats and thieves who steal from the other races of Shadowmoor who live along the rivers, particularly the kithkin . As enormous symbols of power, giants evoke the most envy in merrows, and some spend weeks concocting plans to bring one down. Merrows believe that the blood and tissue of giants bring them strength, and some merrows carve jewelry, weapons, or even lairs from giants’ bones. Shadowmoor merrows have abandoned shaping the tides, leaving some rivers to dry up and others to flood, in some cases even inhabiting entire flooded clachans. Present only in Shadowmoor , selkies are unusual merfolk that are different from any others of their kind. Rather than fish, selkies' lower bodies resemble seals, giving them an appearance similar to centaurs . Selkies have six limbs: Two pairs of seal-like flippers on their lower bodies and two arms on their torso with flipper-like hands. Selkies' faces combine human and seal features; they have white eyes with no pupils and long, stringy black hair. Selkies live in the network of rivers and ponds that stretch across Shadowmoor, but they feel as though they belong in more open waters like the oceans of other worlds, a feeling that gives them a wistful and tragic side. This makes some selkies cold and spiteful towards the land-dwellers who can travel as they please throughout the plane. Selkies are masters of magic and divination. They are believed to have even seen Shadowmoor's destiny. Saprazzan Merfolk were once native to Dominaria, but were taken to Mercadia by the dragon engine Ramos to ensure the species' survival during the Brothers' War . The refugees built a floating city called Saprazzo , from which they take their name. They were led by the Saprazzan Vizier and worshiped the Power Matrix as a holy relic, but relinquished it to the Weatherlight crew when they learned it was part of the Legacy . They then aided the crew and the Cho-Arrim in overthrowing the Kyren regime. Rootwater Merfolk lived in the rootwater that nourished the Skyshroud Forest . They had a hideous appearance that resembled an eel rather than a fish and were also extremely aggressive, attacking anyone they spotted traveling on the forest floor. They lived on Rath until the Rathi Overlay when the rootwater planeshifted to Keld along with the rest of the Skyshroud. They would have all frozen to death in Keld's hostile climate, were it not for the intervention of Freyalise , who created a magical ward in the forest to keep it warm. Whether the rootwater merfolk survived the weakening of this ward during the events of Time Spiral is unknown. For millennia, merfolk were thought extinct on Ravnica , as the ocean was covered by the sprawling city and eventually faded from memory. The merfolk themselves only preserved dim memories of the surface, aware that there was a city ruled by guilds above them, but knowing and caring little about it. Their disinterest only ended when tree roots reached the oceans. However, massive sinkholes enabled them to resurface, and many have joined the Simic Combine and risen to leadership positions. The new Combine has incorporated many parts of their philosophy, such as the Holdfast and the Upwelling Principles. The former highest-ranking speaker for the Combine, Zegana , was a merfolk. The merfolk kingdom in the depths of Shandalar was conquered by Talrand, Sky Summoner . Not content with only one kingdom to rule, his ambitions drove him skyward where he had power over the drakes . Nowadays, Merfolk are nearly hunted to extinction and the few survivors have retreated into the depths, determined to endure ( Maritime Guard ). The two-legged tritons of Theros are partially amphibious. They can breathe air for several days at a time but must spend time in the water to keep their gills soft. Tritons worship the sea god Thassa above all others and work to do her bidding. Curious, thoughtful, and analytical, the merfolk of Zendikar are natural explorers. They are the only Zendikari race innately able to sense the Roil . Although they are born in the water, their appearance is more human than fish. They have muted skin colors and brighter colored residual fins on the backs of their arms and calves. The merfolk's hair often has streaks of bright color as well. Zendikari merfolk have noses, but cannot sneeze. Although merfolk are a common sight in the settlements and trading posts of Zendikar, they are a race in decline. Spread wide and far across Zendikar, they are centered around the Enclave, the largest settlement of Merfolk built on a large island in the bay of the Umara River on Tazeem . Most Merfolk come here to give birth. The merfolk believe that the world is divided into three realms: Emeria , or the Wind Realm, which was once ruled by the angel Em and includes the sky, the wind, and the clouds; Ula 's Realm, the underwater realm; and Cosi 's Realm, which comprises everything else. Zendikari merfolk also tame and ride flying manta rays for quicker transportation. The creative team of Magic has always had issues with sea-based creatures, as the game, flavorfully speaking, occurs on a battlefield . Summoning sea creatures never made much sense. Odyssey block removed several of the core races for a block to try and shake things up, and Merfolk went away and didn't return until years later. Many players had always liked Merfolk and were unhappy with their absence.  In the end, R&D decided that in this case, the overall happiness of having Merfolk in the game overrode the inconsistency of the flavor. The creative team also looked for ways for them to make sense; the merfolk of Zendikar block , for example, have finned legs rather than fishtails. The creature types Lord-of-Atlantis and Lord were changed into Merfolk ( Lord of Atlantis ). The Lorwyn block featured three tribal Merfolk cards Aquitect's Will Merrow Commerce Summon the School These could be fetched by Merrow Harbinger and could have their cost reduced by Stonybrook Banneret Later, Rivals of Ixalan introduced Forerunner of the Heralds which is also able to fetch these cards like Merrow Harbinger. Lorwyn–Shadowmoor 's Merrows and Selkies are both based on creatures from Irish and British folklore. Kopala a legendary merfolk. Art by Magali Villeneuve . A member of the more aquatic merfolk on Ixalan. Art by Lie Setiawan. A member of the more arboreal merfolk on Ixalan. Art by Kieran Yanner . A Lorwyn merrow. Art by Mark Tedin . A Shadowmoor merrow. Art by Wayne England. A Selkie. Art by Mark Tedin . A Eldraine Merfolk. Art by Livia Prima . A Mercadian Merfolk. Art by Jeff Miracola. Mercadian Merfolk concept by Anthony Scott Waters . Mercadian Merfolk concept by Anthony Scott Waters . A Rathi Merfolk. Art by Ron Spencer . A Ravnican Merfolk. Art by Karl Kopinski . A Shandalar Merfolk. Art by Allen Williams. A Triton from Theros. Art by Josu Hernáez. A Zendikari Merfolk. Art by Mark Tedin . Zendikari Merfolk concepts. Zendikari Merfolk concept by Aleksi Briclot . Undine concepts."}