{"text": "Michiko Konda (MEE-chee-koh KON-dah; Japanese: 今 田 魅 知 子 ; rōmaji : Konda Michiko ) was a daughter of daimyo Konda and lady Yoshino on Kamigawa . Her birth was connected with Konda's crime, and her whole childhood and adolescence were marked by the raging Kami War . Her mother died in childbirth, and Konda's attention belonged fully to the product of his crime, That Which Was Taken , and he neglected his daughter, leaving her under the tutelage of Lady Pearl-Ear of the kitsune -bito. However, he guarded her strictly, because of her importance in relationship to his trophy - her birth had caused a surge of sympathetic spiritual energy that made Konda's crime possible. By the time of the climax of the Kami War, Michiko was a beautiful young woman with striking features, resembling her mother Yoshino, and a desperate desire to do something for her own people tortured by the Kami War. However, her importance was not unknown to the other factions and their patron kami . Her friend Choryu helped her to escape from Eiganjo , only in order to get her into the Minamo academy and into the hands of the wizards and their patron spirit. The plan failed because of Sharp-Ear 's trickery, and Michiko's path led to Jukai , where it crossed with that of Toshi Umezawa . After saving her from the wrath of the Myojin of Life's Web , Toshi allowed himself to be hired by the princess. This was useful later when he helped her to escape from the golden cage where her father locked her after her return by using his shadow-walking ability. Toshi brought the princess to Sugi Hayashi and the hands of Pearl-Ear. Despite Toshi's advice, Michiko decided to consult Sensei Hisoka of Minamo about the night of her birth. This endeavor almost ended in disaster when Michiko and her party were present in Minamo during Hidetsugu 's attack. Once again, Toshi Umezawa saved her and her friends. After a long and painful path walked by Toshi, Michiko was united with the Taken One . Under Michiko's hands, the disk shattered and the captured entity was released. Her spirit sister took the name Kyodai , and physically resembles Michiko with dragon traits. Michiko and Kyodai then merged into the Sisters of Flesh and Spirit , a new form of flesh and spirit coexistence, and together they destroyed O-Kagachi . Kyodai later punished Konda for his crime as well. With O-Kagachi gone, the sisters became the new guardians of Kamigawa, the embodiment of the barrier between the mortal and the spirit world. Healing after The Kami War was not an easy task. Years of war and strife had taken their toll upon the land and its inhabitants. The root cause of The Kami War was still largely a mystery to the citizens of Kamigawa, and mistrust and animosity ran deep. To undo the damage her father had caused, Michiko Konda took on the task of restoring peace and harmony to the land. Her partnership with Kyodai was met by fear and suspicion. To most inhabitants of Kamigawa, Lord Konda had been their protector against the enraged kami. Such a close collaboration between Lord Konda's daughter and the child of O-Kagachi was shocking and unnatural, and Michiko's efforts were met with resistance on all fronts. Michiko realized that for Kamigawa to truly heal, people needed to know the truth. With Kyodai's blessings, she revealed the origin of The Kami War. In later times, historians have been able to say that Michiko's actions led to true healing and paved the way for harmonious collaboration between mortals and kami. At the time, however, it created even more difficulties in her attempts to restore the Plane. Many resisted Michiko's attempts at restoration, citing her lineage as Lord Konda's daughter as proof that she was not fit to take on the task. There were also those who continued to resist, refusing to accept the truth. But Michiko never wavered in her resolve. It was her belief that truth and action were the only solutions to redressing the sins of the past. Many centuries after the Kami War, when Leshrac Nightwalker planeswalked near Kamigawa, the Sisters stood in his way, ordered him to go away from their plane. Though Michiko refused the title of emperor in her lifetime, the title was applied posthumously, styling her as the first emperor of a new Kamigawa. After her prosperous reign, her descendants worked tirelessly with the great kami Kyodai to maintain her legacy and uphold order and justice in Kamigawa. However, as generations passed, these noble pursuits gave way to dynastic in-fighting. Associated cards: Quoted or referred to:"}