{"text": "Minotaurs is a creature type describing humanoid bull creatures, which stand on two hooves and have bovine snouts and horns. Some minotaurs have a more goat-, antelope -, or moose-like appearance. Finding their homes in mountainous regions of the multiverse, minotaurs are fierce in combat and often very prideful. Some minotaurs have four fingers (two of which are thumbs, set across the palm from each other), while others have more human-like hands. The first card to bear the type was the iconic Hurloon Minotaur in Alpha . Before the Conflux , the minotaurs inhabited the deep canyons of Naya , but now roam the width and breadth of Alara freely ( Etherium-Horn Sorcerer ). Amonkhet 's minotaurs have more ovine features than other minotaurs. Their horns curl tightly against the sides of their heads to encircle their ears, and manes of shaggy fur—shorter in females—fall over their broad shoulders. They live along with most other races in Naktamun and prepare for the Trials . Minotaurs believe they hold a unique place among the races of Amonkhet. The khenra can look to Hazoret , the naga to Rhonas , and the aven to Kefnet to see themselves represented among the gods. Humans have no single god to look to, which explains why they demonstrate such variety. But only one god bears a pair of curving horns: the God-Pharaoh himself, who holds a special place for many of the minotaurs of Amonkhet. They favor magic that manifests as flaming weapons. Most of Dominaria 's minotaurs are xenophobic, especially those in the radical sister nations of Mirtiin and Stahaan . While Hurloon , Terisian and Anaba minotaurs have four fingers and a thumb, like humans, all other races of Dominarian minotaurs have two fingers, as well as two thumbs set across the palm from each other. The reason for this is said to involve an ancient and narrow-minded planeswalker, a duel gone wrong, and the \"Heresy of Hurloon.\" The minotaurs of Hurloon in the Domains are spiritual people with a love of battle and stories. These minotaurs had arrived in North Aerona centuries ago, after being forced from their homelands by the encroaching glaciers . They had traveled south until they encountered an impassable mountain chain where they took shelter in the caves. They live in small tribes, the largest of which lives in the fertile Hurloon Valley . There are racial and religious differences between the Hurloon and the Stahaan minotaurs, which are referred to by the latter as the \"Hurloon Heresy\". Hurloon minotaurs are more primitive than their Talruum cousins and have a shamanistic religion that revolves around the veneration of the land, though they are less hostile to outsiders than the Talruum. Their best-known ritual is their custom of singing hymns after combat to the memory of the fallen, both theirs and the enemy's. Each year, the males hold a dancing and wrestling contest to impress the females and to breed with them. They worship heat in two forms: the sun and the hearth fire. All Hurloon Minotaurs have double names, so while their real names are Skywatcher, Thundersong, Snowbeast, and Moonbeam, they have nicknames like Little Flower Eater, Bean Nudger, Sleeps by Day, and Dropped Six Sticks. A famous Hurloon Minotaur is Eusomoné (a.k.a Sings Two Ways). The nicknames of Tahngarth and Grizzlegom are unknown. The Hurloon tribe, along with the Talruum, was devastated in the Phyrexian Invasion of Dominaria . The survivors of both tribes sent explorers to search for new homelands and other minotaurs who had made it through the apocalypse, and some ended up on the continent of Otaria . Compared to the minotaurs of Talruum, Hurloon minotaurs have a slightly shaggier pelt, often white or brown. Their warriors sometimes display elaborate facial tattoos and horn-etchings. The minotaurs of the Karplusan Mountains in Terisiare were rare and may not have survived the climate changes during and after the Ice Age . They were seen as far as Sardia and Penregon, and were accepted enough socially to be trusted with children . They were rare even in the time of the Brothers (though Mishra had seen one in his youth), and by the time of Heidar were little more than beasts. The Karplusan minotaurs were by far the hairiest of their kind, being covered in thick, shaggy fur to keep them warm in the perpetual winter of the Ice Age. Some of the eleven minotaur clans of the Dominarian domain of Mirtiin are expert crafters and learned philosophers. Others are more primitive. The domain of Stahaan , the sister nation of Mirtiin, is home to a radical xenophobic nation of minotaurs. Their society is extremely conservative and religious, even more so than Mirtiin. The minotaurs of the Talruum Mountains in Jamuraa are highly aggressive and hostile to outsiders. Their religion involves the worship of Torahn, a violent war god. The Talruum are famed for their speed and prowess in battle and their distinctive crystal swords; they produce many skilled warriors and berserkers . They are also the only minotaurs known to practice wizardry , particularly the magic of illusions. The Talruum are also known for their vanity: They consider other minotaurs, such as the Hurloon, to be ugly savages. In the wake of the Invasion, the Talruum broke with their traditional xenophobia to search for other surviving minotaurs along with the Hurloon. Unlike their Hurloon kin, Talruum minotaurs are mostly hairless, like humans, with smooth brown skin. They grow the hair on their heads long and often style it in elaborate braids. A Minotaur community living in the Urhaalan Valley during the Dark Age . Theros minotaurs are primal, barely sapient beings with no culture to speak of and a rudimentary language. They are basically among the plane's various monsters, residing in mountaintop caves and attacking more civilized races, with a preference for human flesh. They are ostensibly carnivorous, experiencing fits of ravenous hunger known as the meat-hunger when confronted with the smell of blood. Some herds, especially the swamp-dwelling Felhide, are known to practice cannibalism. Minotaurs mostly revere Mogis as their primary god. Among themselves, they organize into herds. Only the mightiest and most ferocious of minotaurs can force the herd into compliance. Fights between minotaur alphas can be heard for miles and almost certainly end in a gory death. The victor claims dominance and fealty. Although widely viewed as mindless killing machines, rumors persist that a minotaur-run Polis by the name of Skophos sits at the center of a great labyrinth, although no human has ever seen it and lived to tell the tale. The Ordruun line of minotaurs are the most prominent on Ravnica . They descend from an ancient hero who is said to have taught minotaurs the art of war. The Ordruun have vowed allegiance to the Boros Legion and the Wojeks . They perform the \"Hammer Duty\" and have a powerband in the legion of 13. Ordruun are the peacekeepers of the communities, by handling menial tasks, like domestic disturbances, transferring prisoners, and upholding the Laws of Ravnica. Other family lines include the Kharran line (primarily associated with the Gruul Scab Clan), the Dendraa (scattered among the Gruul), and the Tazgral line (divided between the Boros and the Gruul, with a significant number in the Cult of Rakdos . Some minotaurs were affiliated with the Izzet League , though very little is known of them. They possessed an affectation for coating their horns with Mizzium . The Anaba were a tribe of minotaurs on Ulgrotha , known for their spirituality and wisdom. They can be summoned with a didgeridoo . The Anaba Minotaurs lived in the Kher Ridge of the Koskun Mountains , though the exact location of their home was kept a secret from the rest of the peoples of Ulgrotha. Any minotaurs who went to Koskun Keep were shunned and thought of as dead and were not allowed to return home. The Anaba kept their history in pictoglyphs in caves until they were destroyed by Taysir . It is possible that the Anaba originated on Dominaria and were somehow transported to Ulgrotha, as the Kher Ridge shares its name with a mountain range on the continent of Terisiare (and indeed, minotaurs were known on Terisiare during the time of the Brothers' War but had become fairly rare by the time of the Ice Age ). An Anaba planeswalker named Sandruu attracted the ire of Taysir, who attacked him when Sandruu was returning home. Taysir defeated Sandruu but was then attacked by a friend of the exiled planeswalker, Feroz . Taysir enslaved the Anaba, and many of them were killed when Taysir summoned an earthquake against Feroz, which also destroyed the pictoglyph caves. Feroz eventually killed Taysir, but the Spiritcrafters preserved his body and spent two centuries calming his soul, reviving him as a kind and humble ally. The Anaba maintained peaceful relations with some of the humans of Ulgrotha, particularly those of An-Havva and the followers of Feroz and Serra —indeed, an Anaba wed those two planeswalkers. As generations passed, more young minotaurs chafed at Anaba customs, leaving for An-Havva or other settlements and becoming bodyguards or pit fighters. The primarily female Anaba Shamans were masters of the mountains and the local weather and could talk to storms and wind spirits. Shamans led ceremonies, tattooed minotaurs who had endured hardship and protected the Anaba by summoning lightning from the sky. When an Anaba came-of-age, they were ritually scarred by their tribe's shaman. The Spiritcrafters were a primarily male sect of the Anaba Shamans. They worked divination rituals and spoke with spirits, particularly the Anaba Ancestors. They were said to be able to possess themselves with long-dead war spirits and Anaba Ancestors to lead the minotaurs to victory in battle. Spiritcrafters calmed and resurrected Taysir after he was defeated by Feroz. Anaba Ancestors were the spirits of the dead Anaba Minotaurs that the tribe looked to for guidance. They could supposedly communicate through or even possess the Spiritcrafters. These spirits worked for centuries to calm the dead Taysir's wayward spirit. Labyrinth Minotaur s were minotaurs on Ulgrotha who, supposedly, never aged and did not need food nor rest. They protected treasure troves and enjoyed conversing with those trapped in their mazes before eating them. They may have been left by the Tolgath to guard ancient artifacts, although some scholars argue that they may be descendants of the Anaba . The last known lair, in the Dark Barony , was inhabited by Sergius the Axe. A few were sighted wandering roads near Koskun Keep , and it has been said some have been seen, on occasion, in An-Havva . The minotaurs of Zendikar are known to be impulsive and aggressive. Some have moose-like antlers rather than horns . Some tribes are nothing more than beasts, not even cultivating their language. Other tribes, especially those on Ondu , are more cooperative. While still impulsive and aggressive, they are bound to their honor and will fight with discipline and follow orders if their reward is high enough. Minotaurs are known to practice shamanism and primitive forms of lithomancy to manipulate the earth and stone of Zendikar for survival. Unstable ' s Target Minotaur makes fun of the fact that in the early days damage spells often pictured a minotaur as the victim."}