{"text": "The Mirage War was a series of conflicts in northwest Jamuraa between 4150 and 4195 AR . They stem from Kaervek 's attempts to conquer the region. This conflict is reflected in the cards from Mirage and Visions . Centuries ago, when the land was ruled entirely by the kingdom of Zhalfir , an internal religious dispute led the church to secede. Though the incident was resolved peacefully, the church created its province called Femeref — \"Judgment,\" in their tongue. In time, Femeref grew apart from Zhalfir, aided by the discovery of rich gold deposits that helped establish it as an independent state. Eventually, tales of mineral wealth within Femeref's deep mountains spread to the Suq'Ata empire. The empire annexed the lands bordering Zhalfir and began to mine the mountains, pushing the dwarven residents into Femeref. The leaders of Femeref happily accepted the new refugees, as their skills would increase Femeref's gold yield substantially. The Zhalfirin nobility was angered by the king's unwillingness to respond to the Suq'Ata invasion of the northern reaches, and this bickering splintered Zhalfir into several independent states. Only the intervention of the returning planeswalker Teferi restored Zhalfir to a state of calm. Teferi was an ancient court mage of Zhalfir and his name still commanded respect centuries after he departed for other planes. Sadly, Teferi was no diplomat, and after a few decades, he resolved to leave the kingdom to its machinations whilst he took up residence on a small secluded island to begin a series of magical experiments. On Teferi's Isle , its namesake, the planeswalker Teferi was attempting to manipulate time so that he might overcome the difficulties of magical summoning. He theorized that he could drop creatures in and out of the time stream , causing them to appear and disappear at will--\" phasing ,\" as he labeled it. But his experiments met with limited success: after years of trial and error, Teferi concluded the process was inherently unstable. Random effects constantly occurred; worse still, Teferi discovered that his early, clumsy experiments had damaged the time stream and threatened to unravel that stream across Dominaria if left unattended. Hardened by the knowledge of his culpability, Teferi prepared to fix the time stream with a colossal energy burst, a dangerous maneuver at best but his only real hope of repairing the damage. What happened next was truly unexpected. The energy unleashed caused every plant, animal, and building on the island to phase out of existence, leaving just bare rock behind. The nations of Jamuraa knew nothing of this. Three mages powerful enough to perceive subtle ripples in the time stream took notice. First was Mangara of Corondor , a mage versed in politics and a great ally of the Quirion elves of the White Woods . Second was Jolrael , who lived in a series of palaces erected in her name at the heart of the Mwonvuli Jungle 's delta. Her influence spread through the animal kingdom and beyond to the sentient lizard people, the Viashino , and through them to the mighty dragons . It was rumored that Jolrael was once a great Zhalfirin mage who turned her back on that society to build her empire of beasts. Third was Kaervek of the Burning Isles , a mage known for his allegiances with many malign spirits and their allies throughout Urborg and Bogardan , chiefly the Nightstalkers and the easily manipulated Panther Warriors . The three mages met on the barren rock that had once been Teferi's Isle. No one could explain the mysterious residual temporal energy, but the three's curiosity was piqued and they agreed to settle in Jamuraa and keep a close eye on the isle. Mangara immediately dealt with the rival nations: if he was to settle in this place for any length of time, he refused to have any wars disturbing his new home. Mangara's gifts for diplomacy and intimidation encouraged peace agreements within a few short years. When Femeref and Zhalfir could not agree on a border,  Mangara created a buffer zone near the Unyaro jungle . To police this zone, he summoned a large contingent of Quirion elves. The elves had always had a good relationship with Mangara and happily populated this new land. The agreement with the Suq'Ata was trickier but eventually, a trade agreement (the Suq'Ata's favorite kind) was created. Within a century \" Mangara's Harmony \" created a new age of enlightenment as the nations began to trust one another. They exchanged ideas and shared their strengths-even the dwarves and elves were welcome within the cities. But Kaervek was horrified. Kaervek had always had dreams of ruling a nation, but the powerful entities of the Burning Isles had ensured that his dreams might never come to fruition. Frustrated by Mangara's success and incapable of believing that Mangara would control Zhalfir for any purpose rather than aggression, Kaervek began to work on Jolrael's fears and her inability to understand the ambitions of humans (at this point, she had lived with animals for several hundred years). Slowly, as Mangara's rule took shape, Kaervek was able to draw the reclusive Jolrael into the politics of the region. In time, the two mages built covert armies of animals and spirits throughout Jamuraa. Kaervek waited, occasionally instigating border disputes between Zhalfir and its neighbors and infighting among the Zhalfirin nobility. Eventually, the disputes flared and blood accidentally spilled. Within days, civil war seemed imminent. This disruption was all that Kaervek needed—he sent dozens of evil spirits into the lands, fanning the flames of old hatred to spark across the borders. Mangara was at a loss, unable to control the steadily worsening situation. It was then that Kaervek sent a message to Mangara, an offer of \"assistance\" in dealing with the troubles. Mangara agreed to meet with Kaervek in the Mwonvuli Delta. Mangara never returned from that encounter. Kaervek and Jolrael ambushed him, capturing him within an Amber Prison that now sits in the throne room of one of Jolrael's palaces. Many of the Zhalfirins believed that Mangara had fled the land, leaving it to civil war; others believed he died in the Mwonvuli. So began the dark days for Jamuraa. Reports increased of people mauled by wild cats, and of citizens dying in their sleep with expressions of horror the only clue to the cause of their demise. Farmers began to mysteriously vanish from their fields. The three nations met at a great council. They shared their tales, and the greatest of the storytellers, Hakim Loreweaver , presented myriad reports from across Jamuraa. Indeed, something was afoot, and they would have to find a way to put aside their territorial squabbles if they were to deal with these mysterious terrors. It was then that Kaervek chose to make his appearance, demanding the surrender of the three nations. Kaervek's love of making a grand appearance had blinded him to the fact that he had now given the nations a look at their enemy. United against a common foe, the nations of Jamuraa flatly defied Kaervek, stating they would pay him no fealty. Over the coming months, attacks were infrequent. The occasional Zhalfirin village was scorched from the map by dragonfire. The trail through the Uuserk marshes was closed after the deaths of a troupe of scouts . The entire Femeref grand assembly was slaughtered by a terrifying entity known as the Spirit of the Night . The attacks began to increase in intensity and reports reached Zhalfir of armies of the dead rising from the land. But among all of this activity, one major event had been overlooked by everyone. Teferi's isle had returned. Almost two hundred years after its disappearance, the isle returned to its verdant origins. The people of the isle were unaware that any time had passed, and their first realization that something was wrong came when one of Jolrael's dragons, drawn by the scent of people, attacked the isle. Teferi slew the dragon and immediately set out to discover what was happening—and when! He was horrified to discover foreign wizards warring within Jamuraa, and he began to consider how to remove these urchins without dragging anyone else into the war. The war for Jamuraa rages on for over a year. Femeref has been invaded. Suq'Ata has closed its borders. The Zhalfirins are being pushed back across the plains into their heartland. Of course, Kaervek feels assured of victory. But his ally Jolrael has doubts. Originally, she had only wished to prevent Mangara from dominating Jamuraa, but over time she had begun to wonder if her choice of allies was a wise one - Kaervek seemed bent on exterminating all three nations. He used Jolrael's palaces and creatures as if they were his own, and legions of evil spirits roamed the land at his behest. Jolrael had secretly tried to release Mangara from the amber prison that trapped him, but she had been stopped by wards Kaervek had set, a clear sign of his distrust of her. It was only a matter of time before Kaervek discovered her attempt; she had to find help, and she had to find it now. Searching the lands in spirit form, Jolrael discovered an energy signature from the isle that had first drawn Mangara and Kaervek to Jamuraa. It was the ancient Zhalfirin royal mage Teferi - a planeswalker powerful enough to crush Kaervek. She magically transported her physical self to the isle, and there she assured Teferi that she bore him no ill, confessing her part in Kaervek's invasion and begging for the planeswalker's aid. Teferi refused to intercede: his experiments were very fragile and if left unattended could threaten Jamuraa far more than Kaervek's plans. Instead, he offered to guide the leaders of Jamuraa through dreams and visions. He would show them the location of Mangara and the key to unlocking the amber prison. Jolrael's task would be to distract Kaervek, and for that, Teferi had just the thing. Within weeks, Asmira , Rashida Scalebane , Sidar Jabari , and Hakim Loreweaver met near the Zhalfirin capital Ki'pamu . Driven by dreams, none of them knew why they were there - except for the prophet Asmira. She explained that destiny was driving them to rescue Mangara, who was held in enchanted amber in a palace deep in the Mwonvuli Jungle. Asmira's visions were known for their accuracy and clarity; she had been the only person to foresee this war, though her warnings had been ignored. To free Mangara, the group had to distract Kaervek and his troops. Rashida formed an elite guard for the rescue mission with Asmira as the guard's guide, while Jabari and Hakim set about creating a sufficient distraction. The opportunity came when Kaervek's armies attacked the Zhalfirin border city of Ufunguo . The attack crippled the city; only the martyrdom of Sidar Mwigo and her troops allowed the citizens to escape. Led by a dream, Jabari led the survivors to Tefemburu , a city already dangerously overcrowded. Soon, Jabari knew, Kaervek would focus his attention on Tefemburu, leaving a window of opportunity for Rashida's elite guard. As Jabari had expected, Kaervek's armies of undead, fell spirits, beasts, and dragons pressed at the city gates. Attackers were cast back and any fliers were cut down by archers, but the sheer numbers of the enemy guaranteed the city would not survive the week. Hakim kept the citizens' spirits up by telling tales of ancient wonders; finally, he began a new tale, of how the inhabitants of a city escaped a siege - a tale, not even he had heard before, a tale rooted in a dream. The tale wove a spell that caused the creatures besieging the city to vanish completely at dusk. Hakim and Jabari told the gathered people to flee. In a hurried meeting, the guildmages decided to leave Tefemburu magically trapped. As dusk fell the next day, the armies of Kaervek reappeared. Unaware of the evacuation, they charged into the city looking for the people that should be there. The trap sprang - a sphere of crackling energy enclosed Tefemburu and exploded, destroying the city and Kaervek's armies. Kaervek was awoken from a week of scrying distant lands for later conquest by the psychic scream of the death of his armies. Panicked, he summoned reinforcements with his remaining powers. He knew that the citizens of Tefemburu had escaped the explosion, but he could not divine how, so he magically searched Jamuraa. He found that the isle which had drawn him to Jamuraa two centuries before was newly inhabited, and he knew that those newcomers must be responsible for his defeat. He gathered Jolrael and his remaining forces and sailed to Teferi's Isle, leaving Purraj and various minions to guard Mangara. Kaervek's confrontation with Teferi was short-lived. The planeswalker made short work of Kaervek's armada, sending most of the evil mage's forces to the ocean floor. During the battle, Jolrael turned upon Kaervek, severely injuring the mage in a heated arcane battle. Kaervek's ship was capsized by a colossal wave, but one of Teferi's drakes was able to grab the unconscious Jolrael from the wreckage. Kaervek managed to crawl ashore and limped to the nearby Uuserk marshes to draw upon its rich mana, but he encountered there a vast floating city controlled by the Shaper and Shadow Creeds. The Creeds had created this city, called Aku , as a portable tomb for Zhalfir's nobility. Sensing Kaervek's presence, the city's keepers assumed he had come to seize the city, and they prepared for a fight. Meanwhile, Asmira, Rashida, and \"Scalebane's Elite\" had ridden hard for the Mwonvuli jungle, but frequent encounters with the enemy had slowed their progress. Asmira feared they would not reach Mangara before Kaervek's return. But hope came from above - Sisay and her flying galleon, the Weatherlight , landed before them. Grounded for repairs after a dragon attack, Sisay had felt the strangest compunction to head in this direction. The others understood, much to Sisay's surprise. The Weatherlight reached Jolrael's palaces in under a day. The amber prison was guarded by Purraj and a variety of foul creatures, and the Elite closed with them. Asmira could not break the prison, for it had been protected with a relic ward. Rashida saw that she and her troops were losing, so she donned a dragon mask to imbue her with superhuman strength and speed. She was able to strike down Kaervek's forces in a dizzying attack before falling to the ground stunned, horrified at what she had to become to succeed. The only survivor was Purraj, who leaped for Asmira. Asmira ignored the lethal blows and managed to complete the ritual with her final words. Her sacrifice was accompanied by a blinding shaft of light that shattered the prison, freeing Mangara. While imprisoned, Mangara had continued to scry Jamuraa, so he magically transported himself to the Uuserk Marshes to face Kaervek. Kaervek was taken by surprise. The wizards lashed at one another with spells, but the surrounding abundance of black mana gave Kaervek the upper hand. The mages of Aku released several djinn to attack Kaervek, but he stole control from them and turned the djinn upon Mangara - exactly as they had hoped, for the djinn would allow Mangara to gain strength from their attacks. Mangara summoned a unit of Quirion archers, which cut down Kaervek's forces. Kaervek was downed by the first of their arrows; before he recovered, Mangara pinned the mage and sealed him in the Amber Prison. Across Jamuraa, the combined armies of Jabari and Rashida drove the few remaining allies of Kaervek towards the mountains. Sensing defeat, the Viashino and their dragons returned to the Great Desert . With Kaervek gone, his few remaining forces went into hiding. Mangara rebuilt Zhalfir and Femeref, aided by the new trust between the two countries. Suq'Ata appeared to be unchanged except for the presence of the Breathstealers . The martyred Asmira is now honored with the title \"Holy Avenger.\" Purraj is believed to have died in the explosion that released Mangara, but no corpse was ever found. Jolrael has returned to the Mwonvuli, her only company is her animals and the occasional visit from Teferi. The Story of Jamuraa Mirage Character Profiles"}