{"text": "Mirri was a cat warrior , a crew-member aboard the skyship Weatherlight , and Gerrard 's best friend. Mirri had heterochromia, a condition causing her eyes to be different colors. She was an excellent fighter - powerful, dexterous, and quick - but her impetuosity and overconfidence landed her in some dangerous situations. She relied more on her claws and great agility than on her sword. Mirri was born in an unknown forest where she was banished for having two different eye colors, a taboo that her kind believed would bring about bad fortune. Exiled, still barely more than a kitling, she eventually became a student of Multani and a friend to Gerrard Capashen and Rofellos . Through years of study alongside Gerrard, she began to foster feelings for her fellow student. She felt more strongly about Gerrard with each passing year, and dreamed often of telling him of her affection, never finding an appropriate time to do so. Eventually, Multani gave Mirri a mission to the Deep Country and Gerrard volunteered to accompany her. Finally, she had her chance to tell Gerrard of her love. What Multani didn't tell them though, was the mission was to set up trade with the Chitr'in, a tribe of cat people . When Mirri arrived, the Chitr'in requested they stay the night so that they could talk of their trade in the morning. During the night, a warrior named Keilic sought to charm Mirri, but Gerrard interceded when Mirri declined to dance with the tribesman. This led Keilic and Gerrard to blows and only stopped when Mirri threw herself between them, seeking to protect Gerrard. Keilic would only back down if Mirri walked the Spirit Path and confronted her spirit beast, effectively choosing if she would join the Chitr'in or stay with Gerrard. She agreed and confronted her spirit beast, a massive black sabretooth cat with eyes of fire. It warned her that she had to choose which life she would lead, to stay with Gerrard and never be loved in the way she loved him, or to stay with the Chitr'in but forever pine for her lost love. Ultimately, she fought her beast and defeated it, choosing Gerrard in the process. The beast allowed her to leave with only the grim prophecy that the path she had chosen would lead Gerrard to his death. Together with Rofellos and Gerrard, Mirri joined the crew of the Skyship Weatherlight in its quest to find the Legacy artifacts. There, Mirri's speed made her a deadly warrior, while her naturally strong senses enabled her to serve as a tracker. After Rofellos was killed, Gerrard left the Weatherlight and Mirri went with him. With a heavy heart, she left Gerrard and traveled to Llanowar to inform Rofellos's family of his death. Mirri with her signature curved sword. Three years passed and eventually, Gerrard once again sought Mirri out as his Lieutenant, which caused some friction with Tahngarth , the ship's first mate. She joined the crew once again when Gerrard came to Llanowar and told Mirri that he needed her help in rescuing Captain Sisay . Their quest was off to a false start though, as an aboroth grew into being. Gerrard and Mirri both were instrumental in stopping the rampaging monster and with the troubles of Llanowar behind them, they set off to rescue Sisay. When the Weatherlight planeshifted to Rath , Mirri fought alongside the other crewmembers against the crew of Predator , but they were unable to stop Greven il -Vec from taking the Legacy artifacts, and in the process, Gerrard fell overboard. After the battle, the Weatherlight made an emergency landing in the Skyshroud for repairs, during which time Mirri and Hanna both insisted on searching for Gerrard and thus ventured into the forest together. As they searched for their mutual love, they were attacked by an unstable shapeshifter , which Hanna saved Mirri from, earning her Mirri's respect. Having come to an understanding, they discussed the problems of Mirri's love of Gerrard, which seemed apparent to everyone except Gerrard himself. However, soon after they were ambushed by the Skyshroud elves and taken prisoner. They were brought before the elven leader, Eladamri , but fortunately, Gerrard had also been found by the elves and proclaimed the Korvecdal by the Oracle en -Vec , leading to an alliance between the crew and the rebels. Reunited, the crew returned to Weatherlight to finish their repairs and with Eladamri's assistance were able to sneak inside the Stronghold while the Rathi rebels made a frontal assault against the fortress. Inside the Stronghold, Mirri used her strong senses to help locate Sisay and to detect the multitude of traps to be found. Her sense of smell saved the crew from one of Volrath 's shapeshifting minions that had taken the form of Sisay because she recognized that its scent was wrong. Eventually, the crew was confronted by Selenia for whom Crovax had come to Rath to find. When Selenia attacked him, Mirri dove in front of him to deflect one of Selenia's strikes. She was severely injured by the resulting cut across her chest and was taken back to Weatherlight by Tahngarth so that Orim could treat her. Tahngarth also took the unconscious Crovax, who had slain Selenia thanks to Mirri's sacrifice, and (unknown to the crew) in the process cursed himself with vampirism . Back aboard the Weatherlight , Mirri became curious when Crovax awoke in a daze and stumbled out of the medical bay. She followed him up onto the deck and saw him attempting to sabotage the Weatherlight ’s sails. She attacked Crovax, causing both of them to tumble overboard into Volrath's Garden . Crovax attempted to use his newfound hypnotic powers to subdue her, but Gerrard, also in the garden, attempted to rescue Mirri. He was confronted by Greven il -Vec, however, and was forced to fight him while Mirri struggled alone. Seeing that Gerrard could not possibly save her, but that he would not stop trying and finally fulfill the spirit beast's prophecy, Mirri let Crovax kill her so that Gerrard would save himself. In an alternate version of events witnessed in Planar Chaos , during the fight with Selenia it was Mirri who struck the killing blow instead of Crovax . She thus became Mirri the Cursed , becoming afflicted with the vampiric curse and duly being abandoned on Rath in the same way that Crovax had been in the normal course of events. Crovax instead escaped her assault along with Gerrard and began blaming himself for Mirri's condition. She successfully rose to the position of evincar of Rath and replaced the Moggs with the more graceful Kor as her chief minions. When the overlay came, Crovax confronted her in Gerrard's place, knowing the only way to redeem himself and Mirri was to slay her. Though not a planeswalker, Mirri traveled through the Multiverse as a crewmember of the Skyship Weatherlight . Dominaria Rath During Weatherlight design and development, Melody Alder was put in charge of establishing Mirri's mannerisms and style of speech. Depicted in: Quoted or referred to: Tick denote cards from the alternate timeline in Planar Chaos ."}