{"text": "The Moon of Innistrad , also called the Moon of Silver or Heron Moon , is a controversial entity in Innistrad : a source of hope and a harbinger of misfortune at the same time. Many wise astronomers believe the moon is a vast desert made ​​of pure silver, and all the silver in Innistrad comes from the moon. The magical substance is therefore known as Moonsilver . The priests and Cathars know of the special power that blessed silver has, both on werewolves and also on other horrors . Thus, the moon has been associated with the divine power of the Archangel Avacyn . Some even believe to see a heron form in the dark and bright areas of the moon, so with time, the heron has become the symbol of Avacyn as well. But the full moon can also slow the protective magic , and generate effects as terrifying as the transformation of the werewolves. The \"silver fickle\" moon seems to serve humanity as well as carrying out the worst evils and nightmares in the face of the plane. Prayer to Sigarda , depecting the phasings of the  moon Humans have given names to the different aspects of the moon because of their strange influence on the world, from the changing seasons to the strength or weakness of certain magical powers and species . The planeswalker Tamiyo was particularly enamored with the mysteries of Innistrad and its silver moon. Observing them for many cycles she carefully charted the forces at work here, including the moon's influence on the lycanthropic curse and the ebb and flow of the vampire frenzies. The Harvest Moon represents autumn in Innistrad, a huge orange/red blood moon hanging in the night sky. \nThe days are much shorter, the weather cools with the passing of days and the woods are full of vibrant colors. This station is where the vampires are believed to reach the fullness of their power. Bonfires are common during harvest time when farmers come to work late, even after sunset. Some believe the bonfires keep away the vampires... Hunter's Moon The Hunter's Moon represents the middle of the winter in Innistrad. The cold air never leaves and the apex of the sun remains always on the horizon. This is the longest season of the plane and is the time when food is scarce. Hunters must venture into the forests in search of their food, which determines the best time when various atrocities are encouraged to attack humans. Some believe that this Moon is the one that empowers the werewolves, based on increased attacks of these abominations in towns and roads. The New Moon is the closest to the spring in Innistrad but in turn the shortest of all. The days are longer and the sun is shining, though still pale in comparison to other planes. Forests grow and revitalize; perhaps due to this, all human beings consider this stage of the Moon as the \"new life and birth\" stage. Babies born under the tutelage of the \"New Moon\" are considered sacred and are believed to have a better chance to reach the Blessed Sleep . The Eldrazi titan Emrakul willingly let herself be sealed in Innistrad's moon, after telling Jace that she, \"didn't want to play anymore,\" and, \"It was not her time. Not yet.\" During the Eternal Night , the moon was kept in place by ancient magic. With Sorin Markov 's assistance, Arlinn and the Gatewatch managed to recover the Moonsilver Key from Olivia Voldaren . They hastened their return to the Celestus to complete the ritual to banish the Eternal Night. When the Moonsilver Key and the Sungold Lock were joined, a flash of light flooded the Celestus. It was warm as sunlight, and the Celestus roared to life, shaking off centuries of overgrowth. With each passing of the arms, the light increased in intensity. Eventually, only a single column remained, running from the Celestus to the moon itself. When the light faded, the moon had already begun its descent. The balance between night and day was restored. Depicted in: Referred to:"}