{"text": "The Multiverse of Magic: the Gathering is the near-infinite number of different planes . Nobody knows how many planes there truly are. Urza believed that there was a finite number of planes, merely more than can ever be counted in the combined lifetime of every being in existence. Other sources have noted that the Multiverse is \"boundless\" and that planes are \"countless\" and perhaps infinite. Most non-planeswalkers have no conception that a Multiverse exists. Dominia is an outdated name for the entire Multiverse. The term was dropped probably due to its confusing similarity to Dominaria , the setting for most of Magic's storylines in the early years. The \"Nexus of the Multiverse\" is a plane (or a place) in the center of the Multiverse with a great influence on all other planes. The world of Dominaria is known to have been the Nexus. Since the plane had only been in existence for a finite amount of time, and in fact, older planes are known (such as Equilor ), this was probably not always the case. Due to the changing nature of the Multiverse, it was bound to happen that one day another plane would replace it. Dominaria stopped being the Nexus of the Multiverse when the Mending happened. It is currently unknown where the new nexus is located. Being a Nexus is probably connected with a large amount of mana lines flowing into it from other planes. That lets it quickly regenerate its supplies of mana and most likely is a way of how it affects other planes. Its collapse can destroy the time stream —an abrupt end of the Multiverse's existence and the near-infinite amount of its planes. The silver-bordered / acorn Multiverse is known as the Un-iverse. This is a separate entity , a parallel multiverse apart from the main continuity. Characters, in slightly different forms, can exist in both Multiverses at the same time. Although Unfinity contains a mix of black-bordered eternal -legal cards and Acorn cards, the set as a whole it is still part of the Un-iverse. Two known planes in the Un-iverse are Bablovia and Myra the Magnificent's Intergalactic Astrotorium of Fun . The multiverse interacted with an alternate reality, maybe a parallel multiverse, in the Planar Chaos storyline. Earth is not considered to be part of either Multiverse. This is because R&D doesn't want to tell stories about planeswalkers visiting Earth or being from Earth. Gavin Verhey used Earth as a non-canon plane for Wizards of the Coast in the Unknown Event at MagicCon Minneapolis 2023 . As the test cards in the event are designed to be humorous or silly, it is not considered a change in position on the use of Earth as a plane. The setting of Portal Three Kingdoms closely resembles historic Earth, but is retroactively considered to be a parallel plane. Earth is used as an offical plane type in the Doctor Who Commander decks Planechase cards, but they are a part of the Universes Beyond model. Universes Beyond features separate Universes which don't interact with Magic canon . According to Mark Rosewater , the planes of the canon Multiverse aren't counted as Universes. Referred to: Planes Dominarian Nexus Multiverse Gift Box \"Multiverse\" also used to be the name of the Wizards of the Coast card database that includes R&D comments on cards. It was replaced by a new database named Drake . ↑ It can be crucial for a plane which is a focus point of many planeswalkers ' interests and their destructive influences."}