{"text": "Multani was the Maro-Sorcerer of the sentient Yavimaya forest of Dominaria . Multani punished Urza for destroying Argoth and killing fellow nature spirit Titania , before allying with him against the Phyrexians and providing the Weatherseed that became the hull of the Skyship Weatherlight . Multani also later taught Gerrard , Mirri , and Rofellos , before preparing Yavimaya for the Phyrexian Invasion . During the invasion itself, he dissipated all his power to move a section of Yavimaya to the front on Urborg to help in the war. Multani was first seen when Urza came to Yavimaya to gain allies against Phyrexia. Knowing that Urza was responsible for the destruction of Argoth , Multani used Yavimaya's magic to disorientate him, imprison him in a living tree, and make him feel the pain of the land. This lasted for years, until Barrin activated an artifact to contact Urza in a time of need. In the feedback of this Multani discovered the threat of the Phyrexians. Urza was freed and traveled to Tolaria , where the Tolarian Academy was under siege by the forces of K'rrick . Urza's powers were depleted but Multani, who had still been inside Urza's mind when he teleported away, infused him with his energy, allowing Urza to kill K'rrick by teleporting inside of him. After this Multani and Urza became allies. Yavimaya began to strengthen itself against the Phyrexians who planned to invade Dominaria but also provided Urza with powerful wood for his artifacts, including the Weatherlight . Multani himself often journeyed to far-off places like Tolaria or Shiv to aid the people there, but in doing this he began to distance himself from Yavimaya. The forest even went so far as to recruit a new avatar, the elf Rofellos , whom Urza had sent to Yavimaya from the more militant Llanowar to train its inhabitants. Eventually, though, Rofellos couldn't cope with being the avatar of a living forest and Multani returned to take that place. Multani also trained Rofellos , Mirri and Gerrard in the arts of magic. Gerrard was the heir to Urza's legacy and played a crucial role in the plans to defeat the Phyrexians. When Vuel started his war against his brother though, Multani went into hiding, leaving Gerrard, Mirri, and Rofellos with the idea that he was dead. When the Phyrexian invasion finally began, Multani first kept leading the forces of Yavimaya. He was very successful, as Yavimaya was one of the few places that survived relatively unscratched by the war, but then he sensed \"a perfect creature\" that could lead Dominaria's troops; that creature was Eladamri who was currently saving elves in Llanowar. Multani traveled across the oceans, by having his mind jump across various pollen floating in the air, to find Eladmari. Not only did he find the elf, but he was also reunited with Gerrard, now commander of the Weatherlight. Multani placed his mind inside the flying ship and traveled alongside his former student across the plane, fighting many battles against the Phyrexians. But during the crucial battle of Urborg the ship was destroyed by the Primevals . Luckily, Karn was able to use the Thran Tome to have the ship reborn. But in doing so he also gave it consciousness, so Multani could no longer keep his mind there. After saying goodbye to Gerrard and his friends, he returned to Yavimaya. During his journey there, he saw that almost all nations had perished under the Phyrexian armies, only to find well-defended Yavimaya completely devoid of the fiends. Realizing he could not stand by idle as the rest of the world faced the apocalypse, Multani transplanted a few miles of Yavimaya and several of its most powerful defenders to Urborg. As the Yavimayans resumed the battle, Multani disappeared, for the spell had taken up most of his powers. The Phyrexians were eventually defeated, but Multani wasn't seen again until over a century later. The goddess Karona was looking for people similar to her and summoned several people thought of as gods, Multani among them. However, recent revelations say this could never be true, but just some sort of illusion or reality warp. Three hundred years after Karona's events, Dominaria was on the verge of collapse thanks to temporal rifts. One of the rifts was located in Yavimaya as well, probably a leftover of the rift on Argoth caused by the Sylex Blast , and the rift created by the World Spell of Freyalise . When Teferi , Venser , and Jhoira arrived in Yavimaya, they found out that the Yavimayan rift interfered with the maro-spirit of the forest, throwing him into kind of suspension and rendering communication very difficult. Multani choked the mana-drawing rift, trying to minimize its effect on the forest. Unfortunately, he was losing this battle. Multani imprisoned Venser in a tree in a similar manner as with Urza long ago, to ask for help. With the help of Venser, Multani was separated from the rift's influence and was able to talk and think clear thoughts once more. When Jeska and Radha arrived, Multani tried to reason with the Pardic planeswalker to make her change her aggressive tendencies into a more rational approach. He hypnotized her, casting her into a deep dream. He also created a new bond between Radha and the forest, filling the void in her soul that was created by Skyshroud's obliteration, reestablishing Radha's ability to use green mana.\nHowever, the visions in Jeska's head that he used to communicate with her were twisted by the influence of Leshrac Nightwalker. Jeska awakened and blasted Multani's physical body to smithereens. Then she grabbed Radha and Multani's wooden mask, all that remained from his physical avatar, and drew power from both of them to seal the Yavimayan rift. After the rift was closed, the mask and the surrounding forest ceased to show any signs of magic or life. In the process of closing the rift, Multani's essence was greatly diminished and dissipated through the whole forest. However, as long as Yavimaya stood, its spirit would live on. Sixty years after the Mending , Multani's mind awakened once more, grasping for consciousness as rage itself rebuilt his body. He spurred Yavimaya to frenetic, undirected action. He was restored to consciousness by Chandra Nalaar , who used techniques learned from Nissa Revane . Meanwhile, Multani's child Muldrotha had been born into Yavimaya's offshoot on Urborg . She had grown from rot and ruin but bloomed in the recent resurgence of the plane. When the demonic frog spirit Yargle first noticed the Phyrexians charging toward him, he was elated: so much food, all so eager to be eaten! What he didn't realize was that the more he ate, the more he exposed himself to the dangerously virulent glistening oil. Someone else noticed, though: Muldrotha, an Urborg elemental who was the daughter of the maro-sorcerer Multani. Seeing the danger that Yargle was in, she sent a plea for assistance to her father. Muldrotha managed to persuade him, and Multani bound himself to Yargle, using his powers and existing knowledge of Phyrexia to grant increased resistance to glistening oil. Though Multani had been initially reluctant to help, he found himself impressed by the insatiable nature of Yargle's appetite and found himself with a new appreciation for Urborg's strange ways. Associated cards: Depicted in: Quoted or referred to:"}