{"text": "The Myojin of Night's Reach ( Japanese: 夜 陰 明 神 ; rōmaji : Yain Myōjin ) is the kami of black magic and the fundamental force of power on Kamigawa . Like all Myojin , she was one of the most powerful kami. During the Kami War , O-Kagachi was waging a war on the mortal world, which caused the planar barriers of Kamigawa to waver. The Myojin of Night's Reach discovered she could use this to travel across the multiverse . When O-Kagachi was manifesting himself in the mortal world it seemed as if his victory was near. Night's Reach didn't want to give up her ability to travel the planes and planned to prolong the war. To do so, she approached Toshiro Umezawa when he was cornered and gave him the ability to defeat or avoid his many enemies in exchange for his service. Night's Reach wanted to use Toshi to keep That Which Was Taken out of O-Kagachi's hands, but Toshi was always looking to further his own goals and gave That Which Was Taken to Michiko Konda , thus ending the Kami War after all, just in an entirely different way. For this Night's Reach took away Toshi's eyesight and banished him from Kamigawa, dropping him off on Dominaria in Madara . Toshiro's descendant Tetsuo Umezawa would eventually defeat and kill the Elder Dragon Nicol Bolas . When Bolas was restored by using Venser and Radha as mana sources, he proclaimed that he was going to find the spirit who brought the first Umezawa to Dominaria and departed. The Myojin of Night's Reach later talked to Leshrac Nightwalker, trying to enlist his help against Bolas, who found her and was currently chasing her. She also mentioned that Bolas destroyed her domains, and turned her worshippers against her. She gave him a porcelain mask capable of drawing black mana from his enemies. The exact details are unknown, but Nicol Bolas later claimed to have found and defeated her, taking her original porcelain mask before she fled again. Her current status is unknown. It is not known how she is related to the Myojin of Grim Betrayal which also represents an aspect of black magic. An immensely powerful entity, the Myojin of Night's Reach was able to travel across planes. Kamigawa Dominaria At the Minneapolis Unknown Event , there was a Test card combining both black myojin called “ Myojin of Night's Reach Grim Betrayal ”. Associated cards: Depicted in: Quoted or referred to:"}