{"text": "Nahiri ( Phyrexian : nQErEED , IPA : [nhiriʔ] ), called The Lithomancer and The Harbinger , is a talented Kor stoneforger , lithomancer , and planeswalker from Zendikar . She was compleated during the events of Phyrexia: All Will Be One , uncompleated herself after New Phyrexia's Invasion of the Multiverse , and subsequently lost her spark as part of the consequences of the invasion. Nahiri is a gray-skinned, white-haired, kor woman who stands at a height of 5'9\". As a lithomancer , she has power over stone and metal, though this power was greatly diminished after she lost her spark. She was one of The Three — a group of planeswalkers that included Sorin Markov and Ugin — that worked to rid the Multiverse of the threat from the terrible Eldrazi . The duty-bound kor took it upon herself to keep the Eldrazi bound to her plane. She believes strongly in keeping one's word, becoming enraged the moment she realized Sorin had broken his own, going so far as to seek him out and confront him for his lie. She strongly believes in an eye for an eye, personally bringing doom to Sorin's homeworld in retaliation for his not helping, as she had been left to reseal the Eldrazi alone. This led to a rather brutal feud between the two. This quest for revenge allowed her to tap into red mana. Since her desparking, she turned this anger into a crusade against all Planeswalkers, vowing never to allow one to step foot on Zendikar again. Nahiri is primarily white -aligned, but secondary in red mana. Other planeswalkers consider her to be the most powerful among them. When she planeswalked, she disappeared with a resounding boom. During her compleation, Nahiri's skin fissured, revealing deep veins of burning red where blood should have been, and her eyes turned black. Her arms were later replaced with metal blades from the elbow down, with spikes on her shoulders, and cracks in her skin and eyes that glow with molten heat. She would later strip the metal from herself and undo most of her Phyrexian augmentations. Because of the haphazard manner in which she went about this, she damaged her arms, scabbing for weeks and ending up with long scars that ran the length of her arms from the elbows to the tips of her middle fingers. She also gained a scar from her bonding with the Emeria Skyclave: a diamond pattern of puckered white lines where she had fused and refused with the metal. The Lithomancer Sorin and Nahiri first met when the young Kor's planeswalker spark first ignited and she ended up on Innistrad. Instead of chasing the young and confused Planeswalker off of the plane, Sorin decided to mentor Nahiri, and the two forged an unlikely friendship. Viewing her almost as a daughter, Sorin taught Nahiri about the Multiverse and introduced her to many new planes. Together, they discovered the Eldrazi, witnessing Ulamog's destruction of a long-forgotten plane. They met Ugin soon after, and the three Planeswalkers concocted a plan that bound the Eldrazi in Zendikar for millennia. The Three decided to force the Eldrazi into physical form and trap them on a plane, sacrificing that plane for the well-being of the Multiverse. They searched for a plane with lush ecosystems and uniquely dynamic mana—a powerful lure for the Eldrazi's insatiable hunger. Wanting to start their work immediately, the three decided upon Zendikar . Sorin Markov lured the Eldrazi to the plane, directing their hunger to that unique mana, Ugin used his invisible breath to combat the Eldrazi and his colorless magic to bind them to the plane, and Nahiri constructed a massive network of stone hedrons , whose power would form the bars of a planewide prison, forever preventing the Eldrazi from leaving. Ugin arranged the hedrons to direct leylines of energy, which were not to be disrupted . The planeswalkers concentrated the power of their imprisonment spell in a secret location deep inside Zendikar's mountains of Akoum : a subterranean chamber called the Eye of Ugin . To make sure that the imprisonment would not be broken, the three planeswalkers sealed the chamber with a mystical lock: the Eye of Ugin could only be reactivated by the presence of three planeswalker's sparks — and the colorless, invisible Ghostfire breath of Ugin, the spirit dragon himself. The planeswalkers' trap worked. Emrakul , Ulamog , and Kozilek manifested in physical form on Zendikar, became confined by the magic of the network of hedrons, and thanks to the magic of the imprisonment spell, sank into harmless dormancy. Their mission was complete, and The Three disbanded. Sorin and Ugin left the plane. Nahiri stayed and lived happily among her people for a long time. The wild mana of Zendikar lured other beings to the plane as well, and Nahiri took it upon herself to protect Zendikar from those who would cause it harm. Of those, the most infamous was the interplanar conqueror Ob Nixilis , but before he could do much damage, Nahiri intervened and bound his power with that of a hedron. She took on pupils and taught them to maintain the hedron network. Centuries later she became tired of living and withdrew into a meditational slumber. The centuries passed and her teachings about the Eldrazi became garbled; Talib (Kozilek), Kamsa (Emrakul), and Mangeni (Ulamog) became the revered gods of the Kor. Nahiri was worshipped as the \"prophet of Talib\", who taught the Kor the arts of lithomancy. When vampires (which hadn't been seen on the plane in the earlier days) built a shrine on the nexus of the hedron network, the prison of the Eldrazi became unstable, and the brood lineages spilled over the plane again. Nahiri awoke and called for help from Sorin and Ugin but they didn't respond. She succeeded on her own at restoring the prison. Confused why Sorin hadn't shown up when she called for him, she decided to find him and planeswalked away from Zendikar. Sorin imprisoning Nahiri in the Helvault When Nahiri arrived at Innistrad, Sorin explained that her signal for help had been likely absorbed by the Helvault . Discontent with the truth, Nahiri guilted Sorin for his actions. Offended, Sorin angrily reminded her of who raised her as a planeswalker and advised her to go pester Ugin instead. Nahiri saw this as a betrayal of their bond and chose to physically threaten Sorin. This resulted in Avacyn 's intervention, who sensed the threat that Nahiri posed to Innistrad. The two fought until Sorin ended the battle by imprisoning Nahiri in the Helvault. During her long stay within the Helvault, Nahiri encountered Avacyn after the archangel had sealed herself into the vault to contain an especially powerful demon . Six thousand years after they were initially imprisoned the Eldrazi broke free , enabled by the meddling of several planeswalkers. This time, Sorin reacted and tried to reassemble The Three. But now, he was unable to free Nahiri without destroying the Helvault. He found Ugin dead on original Tarkir , but alive in the new timeline. Ugin instructed Sorin to find Nahiri. Nahiri imprisoned Sorin in stone prison When the Helvault broke, Nahiri fled back to Zendikar, only to find the Eldrazi unleashed, continents laid to waste, and her allies seemingly having forsaken her. Enraged, she swore vengeance against Sorin, vowing to make Innistrad bleed in the same way Zendikar had suffered. She attacked Markov Manor , destroying it with lithomancy and imprisoning its vampires in a state of perpetual agony within its walls. While active on Innistrad, people turned to worship her, some ironically believing her to be an ancient vampire. She created cryptoliths across Innistrad, using them to channel Innistrad's leyline energy to summon Emrakul to lay waste to Innistrad as the Eldrazi had laid waste to Zendikar before it. As the focal point for summoning, she built the Drownyard Temple with help from Gisa 's ghouls . After the maddened Avacyn was killed by Sorin, Emrakul arrived and began corrupting Innistrad and its citizens. Thinking the plane lost, Sorin called for Olivia Voldaren to summon her vampire army and attack Nahiri. The Lithomancer waited for them at the ruins of Markov Manor with her army of cultists and Eldrazi abominations. In the end, Nahiri was wounded severely but managed to encase Sorin in stone. After this victory, she planeswalked away. Nahiri's Stoneblades Nahiri was lured to Ravnica by the Interplanar Beacon and immediately became trapped there due to Bolas ' use of the Immortal Sun . During the invasion, the trapped planeswalkers (including Nahiri) got together with Ravnican leaders to strategize. When Sorin arrived on Ravnica, he immediately went after Nahiri, and not even a threat to the entire Multiverse could persuade the two of them to put aside their feud. Ignoring the battle that raged around them, the two planeswalkers fought each other in single combat. However, they later came to a temporary truce, joining forces against the Eternals of Bolas' Dreadhorde . They were among the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. After returning to Zendikar, Nahiri heard of the renown of the Sea Gate Expeditionary House . She decided to help fund it, having plans to acquire artifacts to stop the Roil that had originated as a consequence of her actions. This eventually led to her search for the lithoform core . Heir of the Ancients. Initially, she asked for Nissa 's assistance in retrieving the core tile key of the Skyclave at Akoum . However, when she tried out its restoring power, its effects also killed an elemental summoned by Nissa. Realizing that restoring the geological stability of the time of the Kor Empire would destroy the plants and animals of current-day Zendikar, Nissa turned against Nahiri. As the key and inscriptions of Akoum pointed her to Murasa, Nahiri realized she could not visit the Murasa Skyclave alone and hoped to survive. So she visited Kesenya at the Sea Gate Expeditionary House to hire help. She hired Akiri , Zareth San , Kaza , and Orah to accompany her to Murasa . When they finally found the core in the Murasa skyclave, the remaining party-members were set upon by elementals. Nahiri used the artifact to defend herself but killed Zareth in the process. Realizing the danger of the core, Akiri threatened to drop the artifact over the edge of the floating ruin. With her lithomancy, Nahiri used a hedron to paralyze Akiri, took back the artifact, and then pushed Akiri over the edge. While climbing up to the skyclave on a thorn ladder, Jace and Nissa witnessed Akiri falling, and Nissa managed to save the Kor warrior. Returning to the ground, they saw Nahiri leaving. Jace determined that the lithomancer was going to the Singing City , and Nissa immediately left to follow. Akiri was distrustful of the mythical \"walkers\" but decided to guide Jace to the Singing City anyway. Search for the lithoform core Deep in the city, Jace found Nahiri, but both were overwhelmed by the city's unsettlingly haunting music. After Jace managed to save them by blocking out all sounds with a spell, they came to an uneasy understanding. Nahiri explained that the old city had a magical focal point from where she could channel the core's energy all over Zendikar through the leylines . Jace promised to not hinder her in her endeavor to save Zendikar if she promised not to use the core until they had studied its mechanism in more detail. He knew that if he was ever going to unlock the mysteries of the core, he was going to have to understand how it was activated. If it was going to be a useful weapon in the battles to come, its mysterious power had to be quantified first. Arriving at the focal point, they found that Nissa had reached it earlier and had destroyed it with help from Ashaya and her other elementals . Nissa felt betrayed, and Jace was unable to prevent an all-out battle. Nissa and her Elementals attacked both Jace and Nahiri. Their force was so overwhelming that the two planeswalkers had to retreat into the Singing City. Barricading the entrance, Nahiri began to collect power from the stones. When Jace tried to persuade her to flee to Ravnica with him, she refused. When she tried to remove him from the equation, Jace turned the tables on her and took control of her mind. Taking the lithoform core from Nahiri, he tried to find Nissa to tell her that he would take it to Ravnica to study it. But an elemental immediately snatched it from him and gave it to Nissa. After Nahiri regained control of her mind, she found that Nissa had used the power of the Lithoform Core to heal the damage done by the Eldrazi and restore Zendikar's wild nature. The core was now dull and lifeless. Realizing that she had lost the fight, Nahiri planeswalked away, swearing revenge on Jace for his meddling. Nahiri falling to phyresis. At the behest of Jace Beleren , Nahiri temporarily set aside their differences and joined an alliance of planeswalkers on Dominaria to fight the Phyrexian threat to the Multiverse . However, upon the strike team's turbulent arrival on New Phyrexia , Nahiri was forced into single combat against a powerful Phyrexian to protect the unconscious Kaito and the flickering Wanderer . She won but sustained a wound that infected her with phyresis . Upon arrival at the Mirran camp, Melira offered to heal Nahiri, but Nahiri declined, as the process would take days they didn't have. Finding Vraska in Sheoldred's Coliseum , they found she was heavily wounded and already infected with Phyresis . Too late to save her, Jace chose to stay behind with her and relive their happy moments on Ravnica in his mind. Lingering too long, Vraska succumbed to the Phyrexian influence and infected Jace in turn. The others tried to escape but were quickly overwhelmed by the black Phyrexians. Nahiri, who was also infected, decided to sacrifice herself for the greater good. Summoning the entirety of her lithomantic power, she cleaved the Coliseum from the Dross Pits and dropped it with all remaining planeswalkers on the Fair Basilica . This decision advanced her phyresis, and she was subsequently compleated by Elesh Norn . The spikes that had been breaking through the skin of her back and shoulders were more pronounced now, turning her outline into a grotesque parody of her own floating cloud of blades. Her hands were gone, arms replaced from the elbow down with metal blades. Cracks ran through the metallic skin of her body, showing molten metal beneath, and her eyes glowed with the same terrible, burning heat. Compleated . Elesh Norn sent the compleated Nahiri to Zendikar to conquer her homeplane in the name of New Phyrexia. She reactivated the Emeria Skyclave to achieve this goal. She used the joy of her new transformation and her new strength to realign the hedrons and widen the rifts between planes. Millennia ago, with Ugin and Sorin, she had drawn the Eldrazi from the Blind Eternities to Zendikar by using the hedron network. Now she used the same technique, expending her joy, rage, grief, and pain to realign the hedrons again to call to Realmbreaker across planes. After reforming the network, she fused herself with the stones in the center, becoming its keystone and using her spark to fuel it. In her moment of fulfillment, Nahiri was attacked by the party of Tazri , Linvala , Akiri , Kaza , and Orah . At first, she gained the upper hand with ease.  But then the fight turned as the angels of New Capenna entered the Multiverse and gave angels everywhere access to Halo . With Linvala's newfound strength, and Tazri's halo, the party managed to break Nahiri loose from the Hedron network. She was knocked from her feet, and the Skyclave broke and crashed to the ground with her still inside. Waking up in the ruins of the Skyclave, Nahiri found herself free of Phyrexian corruption, theorizing that the removal of her spark and the blast of Halo may have cured her compleation. She was able to remove most of the Phyrexian components from her body, starting with the swords grafted to her hands and leaving her scarred forever, but realized she had lost most of her power. Without much else to do and trapped within the Skyclave, she spent her time removing as much phyrexian metal from the Skyclave as she could. After weeks in total darkness, she discovered her spark, now housed in a small hedron it had instinctively grown to protect itself. It gave her the mana and drive to break out of the Skyclave, where she was quickly distraught to see how much of Zendikar she had corrupted as a Phyrexian. As she was leaving, Ajani arrived, expecting to find her dead. Lying to Ajani about her desparking, they argued about Nahiri's responsibility to the Multiverse. As the argument got heated she attacked him, believing his true intention was to kill her. This caused her to crash through the Skyclave and land on the pile of Phyrexian metal, crushing the hedron containing her spark in the process. Distraught, Nahiri decided that everything that had befallen Zendikar was because of planeswalkers. Blind to their influence, she believed they ravage planes and then abandon them as they please. She vowed that planeswalkers would never set foot on Zendikar again. The Lithoform Core , an artifact channeling Zendikar's power (lost to Nissa) For a time, Nahiri was fused with the Emeria Skyclave . A hedron containing Nahiri's spark. After Nahiri removed her spark to fuel the Skyclave, the spark instinctively created a hedron to protect itself. The hedron grew in impossibly thin, fragile slices of stone, layer by layer. It was translucent, refracting sunlight into an iridescent rainbow. It was shattered when Nahiri fell on top of it. The Lithomancer's identity as Nahiri was hinted at earlier, but finally unveiled in the Commander 2014 supplemental set. Nahiri’s art was modeled on the art of Worldwake ’s Stoneforge Mystic , but that represents another character. Nahiri is the first White-aligned planeswalker in a villainous role. The White-aligned Gideon Jura in The Purifying Fire is just a semi-antagonist, mostly forced to work with the protagonist, Chandra Nalaar . Nahiri is also the fourth White antagonist in the central antagonist role after Takeshi Konda , Heliod and Elesh Norn (though Radiant , Augustin IV , Gaddock Teeg , Dovin Baan , Dromoka and Ojutai also served notable secondary antagonist roles). Nahiri narrates the teaser for - and is the primary focus of the trailer for Zendikar Rising . She also appears in the Phyrexia: All Will Be One trailer. Before March of the Machine , Nahiri was the only red/white phyrexian and Phyrexia-associated card, as this combination was otherwise mostly reserved for the Mirran Resistance. Associated cards: Depicted in: Quoted or referred to: Nahiri returned to Innistrad, where she began restoring the stone parts of Markov Manor. She waited for the return of Sorin, hoping she would finally make amends with him. However, he never came. Instead, she was found there by Ajani Goldmane , who was helping Arlinn Kord discover who had been haunting the manor lately. Ajani met her well and heard her tale of anger toward Sorin's arrogance. Having learned that Nahiri was on Arlinn's hit list, he placed himself between them to prevent them from fighting. Nahiri did not feel Arlinn understood at all why she'd had to bring Emrakul to Innistrad. Arlinn claimed to be acting as protector of her Innistrad, which made Nahiri realize that just as Nissa had taken Nahiri's place on Zendikar, Arlinn had taken Sorin's place on Innistrad. She then told Arlinn that one day Innistrad would no longer recognize her, even though she would still be Arlinn, and on that day, she would finally understand Nahiri. With that, she bid her new friend Ajani goodbye and left Innistrad."}