{"text": "Narset is a human and former planeswalker from Tarkir . In an alternate timeline, she was her clan's khan . Narset is a master of martial arts and mental discipline with an insatiable thirst for knowledge. Following her years of mystic and martial arts training under Dragonlord Ojutai , Narset has the ability to nullify magic used against her as well as intensify the magic of others. The most important part of Narset's character is her amazing mind, which is central to her potential as a powerful planeswalker and as a pursuer of knowledge — but it happens that she processes information and input differently than a lot of other people. Tarkir denizens might not have a term for the autism spectrum or be neurodivergent or neuro-atypical, but those terms would correctly describe her. Narset is primarily blue -aligned but secondarily white . Before the timeline change on Tarkir, she also had access to red mana, which was initially lost, but she regained it sometime later. Khan Narset of the Jeskai Way, in the original timeline. Khan Narset of the Jeskai Way was a master martial artist, sage, and scholar with great destiny on Tarkir. She was known to have a brilliant mind, always committed to furthering her knowledge, but this intense curiosity meant that she often found it hard to concentrate on a single matter. She also noticed that she processed information and other types of input differently from other people. She had \"seen\" imaginary worlds in her childhood that returned in visions while she meditated. She slightly resented the rigidness of the Jeskai Way but forced herself to fulfill her duties as Khan. Narset seemed to have some friction with the Jeskai elders who had plans and agendas of their own while seeking to make her a puppet leader and conducting operations behind her back (sending assassins after the rogue monk Taigam , her former pupil). Even her bodyguard, Shintan was more loyal to the elders than her and reported on her actions to them. Narset was fascinated by the dragons of the past and of Ugin in particular. She hoped to find a way to use Ugin's runes to somehow stop the bloodshed on Tarkir. Nearly ten years after she became khan, Narset was approached by a Kirin which guided her to the suffering Sarkhan Vol . She could sense the echo of Ugin's spirit around Sarkhan. Sarkhan eventually told her of the secrets of planeswalkers and the existence of Nicol Bolas . She confided in him that Ugin was Tarkir's soul and with his death, the plane was thrown out of balance. She helped to calm his mind and provide him some peace before agreeing to bring him to Ugin's Tomb. At the tomb, they were attacked by a maddened Zurgo Helmsmasher who attempted to kill Sarkhan. Narset fought off Zurgo and injured him before urging Sarkhan to enter Ugin's Nexus , promising to guard his passage. At the apex of their fight, she was distracted by Sarkhan which enabled Zurgo to land a killing blow. With the last of her strength, she urged Sarkhan to keep moving into the nexus. Sarkhan Vol swore revenge against Zurgo as the orc stood over Narset's body and he made his way into the center of Ugin's Nexus. At a young age, Narset gained the personal notice of Ojutai himself. She attracted the dragon's attention as she would often mimic the exercises performed by both the dragons and her elders, mastering them after no more than a casual glance. Ojutai recognized hers as a mind with the potential for nearly limitless growth, so she was taken on as a student. Narset quickly mastered not only the exercises but the draconic language itself. But as Narset grew, she began to feel restless. She harbored a longing, although she was unable to identify what for, and she started to question whether or not Ojutai truly knew all the answers to the questions of life. Narset finds the forbidden knowledge about Tarkir 's past, which ignites her spark . When, in relatively short order, Narset achieved the status of master, she cared more for the autonomy that the position granted than the highly sought-after honor. She spent many a day alone, exploring the deepest and dustiest cavities in the Ojutai sanctuaries, slowly piecing together clues that illuminated the forbidden past. Her peer, Taigam, warned her of the danger in seeking out knowledge without the dragonlord's permission, but Narset saw no harm in research. She discovered the truth of the past of Tarkir — it was not always a world ruled by dragons as the teachings of Ojutai claimed; at one time humanoid khans led mighty clans that dominated the land. Narset also learned of a powerful spirit dragon from whom all dragons were formed. It was this Ugin that most interested her. She could feel something more in the histories that described him, something similar to her own wanderlust. She took to meditating in secret chambers, spending hours that crept into days and even weeks without making an appearance above. Eventually, she was discovered and confronted by Taigam, who had hoped to use her downfall to further his own stature. Narset overpowered him and made her escape, while Taigam labeled her a heretic and promised to inform Ojutai of her transgressions. Her planeswalker's spark ignited while she learned the truth about Tarkir's past and Ojutai's subjugation of the Jeskai. However, she chose not to travel to another plane and instead continued her search for knowledge on Tarkir. Eventually, she encountered her old master at the riverbed where they had first met. At first afraid of the dragonlord's wrath, Narset admitted to knowing the truth of Tarkir to him. Ojutai, sensing the same need for discovery that consumed her as his student, gave her his blessings and encouraged her to continue seeking knowledge and enlightenment. When Sarkhan finally found her, Narset was on her way to Ugin to find more answers. She also planned to visit the Atarka lands, where she expected to find more ancient secret stories, carved in mammoth ivory. Although aware of her new abilities, she didn't plan to leave Tarkir again, soon. Narset studies in Ikoria the combination of original Jeskai mana colors At certain moments Narset seeks peace and quiet at Kamigawa , where she has become part of fellow planeswalker Tamiyo 's Story-Circle. Narset was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . During the invasion, the trapped planeswalkers (including Narset) got together with Ravnican leaders to strategize. It's not clear if Narset fled Ravnica when Chandra disabled the Immortal Sun or stayed to help the Gatewatch in their fight against Bolas. Narset spent some indeterminate amount of time on Ikoria , to move past her confrontation with Bolas. She sought enlightenment in this world where the mana combined in ways similar to her former clan. She bought books at Skysail , but was mostly seen around Raugrin . During New Phyrexia's Invasion of the Multiverse , Narset returned to Tarkir before losing her spark in the Great Pruning . In the D&D campaign released with Dungeons & Dragons: Adventures in the Forgotten Realms via Magic Story , Narset was given a character sheet representing her as a multi-class monk and wizard, emphasizing a devotion to study and dedicated practice to develop powerful martial arts and spellcasting skills, respectively. Her alignment is Neutral Good representing generally heroic behavior. As a wizard she specializes in abjuration (protective magic), and her spell selection includes a number of mental and magical manipulation and defensive effects. She also knows the Dragon's Breath spell, presumably referencing her origins on Tarkir. Her monastic tradition is the \"Way of the Astral Self\", a philosophy holding that the mortal body is just an illusion and one's true self can be brought out through advancement as a monk. In the video game Magic: The Gathering Arena , Narset is voiced by Judy Alice Lee. Associated cards: Depicted in: Quoted or referred to:"}