{"text": "Naya is one of five Shards of Alara . It is primarily green -aligned, with red and white as secondary colors . Naya is Ajani 's birthplace. Life, passion, community, and the wild — these are what flourish without the influence of black or blue mana. In this lush land, life is celebrated and nature is revered. Naya is a glorious tropical jungle plane peopled with perfect specimens of the human , elven , leonin , and minotaur races. Naya boasts an abundance of resources and the most varied forms of life of all the shards. It seems like a paradise, but that is a deceptive view. Naya tremors with peril. Gargantuans dominate life on Naya. Most are mammalian carnivores that wander where they please and crush a human village or gulp down a tribe of elves without warning. During a rampage, they can alter the course of a river or shave off a large section of a mountain. Some of them are so big that they create their climate. The smaller races seek ways to control, or at least understand, these behemoths that share Naya with them. The elves worship the gargantuans of the plane, believing that the behemoths' actions are signs from Progenitus , an enormous five-headed hydra who sleeps under the ground in the Valley of the Ancient. In the mountains, there is sunshine in the morning followed by rainstorms in the afternoon, and mist that rolls in at dusk. When the sun is shining, the jade-green leaves and colorful cascades of flowers stand out in startling contrast against the golden sky. But in the evenings, the air is cooler and the fog settles on the jungle like a heavy hand. It is unusually quiet under the trees when the mist engulfs the mountains. Called Whitecover, this fog is so thick it’s almost tangible. Even the non-superstitious Nacatl believe certain creatures emerge from their hiding places during Whitecover — creatures that are never seen by the light of day.\nThere are volcanoes in the mountains — erupting perhaps once a decade — as well as an extensive and largely unexplored system of caves. Most gargantuans live in the lowlands, but a few inhabit the caves and mountaintops. In the lowlands, trees grow to incredible heights as they compete for space and sunlight. The canopy is laced together by massive lianas — thick, woody vines that connect the trees and can grow up to five feet in diameter. Animals, humans, and elves use these lianas as highways to travel across the jungle. On Naya, color means danger: purple flesh-eating flowers, red blood-sucking snakes, and fuchsia fungus vines are some of the species that flaunt their deadliness. Whereas the elves inhabit the canopy, humans live on the jungle floor, which is a darker, more humid, and more treacherous place than the canopy. Most species that inhabit the lowest level of Naya are forced to survive what falls from above; specks of light, dead leaves, and over-ripe fruit. Amid the massive buttress roots are termites, fungi, and oversized logger-ants who hunt by scent and can easily take down an unsuspecting human or elf. Jungle rivers are dangerously unpredictable. When they flood, as they often do, the river's edge swallows huge sections of the forest, forming landlocked lakes. The unpredictable waterways constantly redesign the jungle tapestry, destroying the open spaces and settlements that humans work so hard to create. Humans inhabit the forest floor — the most dangerous place in Naya. While many still live in primitive dwellings carved out of trees, more and more humans are building permanent villages and clearing land for agriculture. These sunseeders use trained gargantuans called plow beasts , and wage a constant war against the rampant jungle growth in their quest for open space. Despite the constant threat of predators, humans have developed ingenious ways to survive in the jungle. Human life here is about pleasure — the pleasure of the hunt, the pleasure of the body, the pleasure of celebration, and the pleasure of competition. Drumhunters hunt in packs, using the sonic properties of the jungles' buttressing roots to communicate over long distances. Exuberants are humans who celebrate life in all its forms, caring little and usually wearing even less, spending their days in their sandstone ziggurats and jungle cities. All humans and even some elves come together in open areas to play games, the most notable of which is Matca . In this game, two humans wrestle in a stone-bordered arena in an attempt to pin each other to the ground. Advanced Matca fighters wear spike armor. The nomadic Cylian elves live in the tree canopy and gather around dewcups, pools of water that form in the canopy's giant ferns. There are many of these oasis-like gathering places in the canopy, and it is here that the elves camp. Led by Mayael the Anima, the elves worship the gargantuans of the plane. Godtrackers carefully monitor their movements and offer sacrifices to keep them placated. The elves believe that the behemoths' actions are signs from Progenitus , an enormous five-headed hydra that sleeps under the ground in the Valley of the Ancient. The elves constantly monitor the steam that rises from three vents on the floor of the valley, which they believe to be the breath of Progenitus himself, for signs of his stirring. The elves are expanding their territory in Naya and have surpassed the Nacatl as the dominant race on the plane. There is more hostility between them now that the Wild Nacatl are moving down from the mountains into the lowland jungles. At one time, the Leonin Nacatl were the most civilized race in Naya and the undisputed rulers of the plane. In its heyday, the Nacatl's Empire of the Clouds had an extensive system of roads, bridges, and aqueducts. But internal strife destroyed the empire. A revolutionary group known as the Claws of Marisi waged a guerrilla war, shattering the rule of law and bringing Nacatl civilization to its knees. The Cloud Nacatl still have a few strongholds left in the mountains, such as the city of Qasal. In these cities, they still retain allegiance to the Coil , a complicated system of laws that were once recorded on a massive stone wall. By the time the empire fell, the Coil had become so convoluted that most Nacatl couldn't understand it or follow it even if they wanted to. The Coil was enforced at first by societal pressure. Eventually, the Pride of Judges , an elite group of Nacatl, threatened the citizens with physical harm unless they followed the letter of the law. Soon there was open warfare in the streets as the Claws of Marisi and the Pride of Judges fought for dominance. In the end, Marisi's revolutionaries triumphed and the Coil was broken. During the destruction of the city, the wall was defaced and in some parts destroyed. For the members of the Claws, it was a symbolic breaking of the strictures of society that kept them down and subjugated their true nature. The wild Nacatl now celebrate the Breaking of the Coil in an annual holiday called the Festival of Marisi. In the lower elevations, the jungle is the undisputed king. With heavy, intermittent rainfall as the lifeblood of the jungle, the rampant vegetation is in a constant race, always clawing upwards in the competition for sunshine. The canopy of leaves is laced together by massive lianas — thick, woody vines that connect the trees and can grow up to five feet in diameter. Animals, humans, and elves use these lianas as highways to travel across the jungle. Amid the massive buttress roots are termites , fungi , and oversized logger- ants who hunt by scent using coordinated movements and can easily take down an unsuspecting human or elf. A permanent, pale mist known as the Whitecover hangs over the rainforest, punctured by ranges of steeply sloped mountains. Whatever lives on the jungle floor must survive on what falls from or through the canopy. When a tree falls it creates an opening in the canopy, and thousands of seeds fight for the chance to grow in the rare shaft of sunlight. The jungle is constantly trying to outgrow itself: whatever can get the highest has the best chance of survival. Empire of the Clouds , former Nacatl empire Antali , its capital. The Binding Wall , a massive white granite slab outside of Antali on which the Coil was written. Etlan Qasali Valley Qasal — the last known stronghold of the Cloud Nacatl, high in the mountains. Ruled by Timus the Orange . The Tower of Qasal , build over the Obelisk of Naya . The Sacellum , the temple of the Anima and spiritual center of Naya's elf culture. It is a living cathedral crafted from the roots of the towering trees of the jungle. The Summoning Root , the base of the largest tree in the lowlands, which covers several acres and has the loudest and most distinctive sound of all. When there is an emergency, humans summon all groups to that spot by drumming on the root in a specific rhythm. The emergency summons is so loud that the vibrations can be felt on the streets of Qasal. The Valley of the Ancient or Valley of the Ancients — the resting place for the hydra-god Progenitus . The Nacatl used to dominate Naya, with the Empire of the Clouds operating an extensive system of roads, bridges, and aqueducts across the plane — all constructed out of rocks and timbers so finely cut that mortar was unnecessary. The Empire embraced a code of ethics called the Coil in which each was free to pursue happiness however they wanted as long as they didn't hurt another Nacatl. A rebellious faction known as the Claws of Marisi believed they had grown weak, and that they should return to their true cat nature. Their empire crumbled and the nacatl were reduced to isolated tribes. Fifteen years before the Conflux , Progenitus began to awaken, tearing the vegetation from its roots and ripping off huge sections of nearby mountains in an event later known as the Second Stirring. The elves believe that only the close connection of the Anima and quick sacrifices kept Progenitus under the ground. When the Conflux occurred, black mana from Jund and blue mana from Bant flooded into Naya. Even though the powerful gargantuans kept intruders at bay, they could not stop the black and blue mana. Naya is now flooded with all five colors and Progenitus has awoken, roving the lands for inscrutable purposes. Naya's borders continued to run into the borders of Jund and Bant until it had completely connected to the other five shards, becoming part of New Alara. In the wake of the Conflux, the lofty jungles of Naya have become a haven for the weak and wicked alike. Demonic cults have taken root among the towering roots of the trees, and the only thing keeping them in check are the Leonin prides, many of who claim allegiance to Ajani , though he is merely the source of their inspiration. After the Shards realigned and Alara was reborn, some vedalken heretics from Esper migrated to Naya, while the coatl snakes were created from the influx of blue mana. Alara as was targeted by Elesh Norn 's Machine Legion as part of New Phyrexia's Invasion of the Multiverse with a simultaneous strike on Bant, Esper, and Jund. At some point during the invasion, the Maelstrom itself awoke to fight on behalf of Alara. The role and fate of Naya's people and Gargantuans in the invasion is unknown. Ajani Goldmane Nicol Bolas Domri Rade Sacellum in Latin refers to \"an unroofed space consecrated to a deity.\" Associated cards: Quoted or referred to: Magic Arcana (August 11, 2008). \" Shard Preview: Naya \". magicthegathering.com . Wizards of the Coast. Jenna Helland (September 10, 2008). \" Running Wild \". magicthegathering.com . Wizards of the Coast. Kelly Digges (September 16, 2008). \" Where Ancients Tread \". magicthegathering.com . Wizards of the Coast. Mike Turian (September 26, 2008). \" Ooze on First \". magicthegathering.com . Wizards of the Coast. Mark Rosewater (November 3, 2008). \" Searching Within \". magicthegathering.com . Wizards of the Coast. Doug Beyer (November 5, 2008). \" The Movers and Shakers of Naya \". magicthegathering.com . Wizards of the Coast."}