{"text": "The metropolis of New Capenna is the one known remaining city on the plane of Capenna . It was introduced in Streets of New Capenna . New Capenna is a city of steel and chrome that rises from a plateau of vast emptiness and long-abandoned townships, a testament to the might of its long-forgotten founders. The city is surrounded by a skirt of wires and a shield of diffuse Halo , the very essence of the angels. This barrier that the builders had left behind remains, a last bastion of hope against a great, now forgotten evil. Outside the city, the plane is desolate and devoid of life. The city is encased in a dome that keeps it consistently temperate. Though it has a government, it is so ineffectual that Elspeth still had not learned its name after living on the plane for multiple weeks. Rather, the monopoly on violence within the city is wielded by its five ruling families. New Capenna is reliant on Halo, with myriad uses including as a healing elixir, for teleportation, and to enhance spells . Its importance to the city's society has caused it to be used almost as currency, and shortages are a cause of citywide tensions. Nido Sanctuary's vault is said to keep a so-called \"Doomsday Prophecy\" foretelling the city's destruction when its supply of Halo runs out. After the Phyrexians attacked, the plane's situation became dire. An unlikely deal between arch angels and demonlords created the metropolis of New Capenna. The angels had become consumed with the defense of the plane, and it had become clear that the demons needed to join the fray as well. When they did, the archdemons appointed five families to rule the city in their name, drafting a contract with the head of each family and conferring demon status to each signatory. The angels and archdemons began the city's building, sinking the first foundation columns into the capital of an Old Capennan kingdom, and Ziatora and her laborers finished its construction. Denizens from the rest of the plane migrated to the city in two exoduses before the Riveteers tightened up immigration. The allied forces of the archangels, mortals, and archdemons were the last to enter the city, after holding open corridors for refugees to stream into the lower elevators. The enemy never stopped. Legends tell of the last battle of the war being fought on the final elevator, with allied soldiers throwing enemy knights off the rising platform as it approached the underbelly of the city. The enemy rebuffed, the last elevator arrived, and New Capenna was sealed to all below. With the surviving population of the plane safe inside of New Capenna, the archangels and archdemons let the people celebrate. However, the archangels could not find joy, as they knew a dark truth. This tower, for all its might and defiance, would still not be enough to stop the Phyrexians. Though well defended and difficult to access, if the enemy could find a way inside, which they would never stop trying to find, the war would rage here as it did far below. Thus, the city's architects puzzled over a stark question: how could they guarantee the safety of the city and the plane upon which it stood when they were so grossly outnumbered? While the archangels puzzled, the archdemons of Capenna plotted. During the war, Capenna's archangels and their angelic hosts ravaged the enemy with their mere presence. The archdemons studied this divine natural weapon and realized that if they could trap angels and distribute their essence across the whole of New Capenna — maybe even out into Old Capenna — they could drive the enemy back and ensure the city and their people would be saved. Alone, though, they could not accomplish their betrayal, so the archdemons sent their whisperers to the ears of mortal, power-hungry Capennans, planting a bleak answer to the question of the future: trap the angels, and let an age of demons begin. However, the plot against the archangels could only be accomplished through the archdemons' own mutual sacrifice. The archdemons appointed five families to rule the city in their name, drafting a contract with the head of each family and conferring demon status to each signatory. The five became demonic hybrids, gifted and cursed by the archdemons bound to them, their vices magnified and powers enhanced. Together with their archdemon patrons, these demon hybrids and their followers took advantage of a sudden slumber that struck the Phyrexian forces — likely caused by the death of Yawgmoth on Dominaria — to act on their plan and achieve success beyond their most optimistic projections. In place of a prolonged battle, the archdemons and the five captured the archangels and their hosts during a city-wide celebration of victory. While the people were told the archangels had voluntarily sacrificed themselves to send the enemy into a slumber, the five and their organizations, their families, suppressed the grim truth: that the archdemons had used the angels in the defense of the city, trapping them in a kind of stasis that saw their physical bodies converted, slowly, into the fuel of the new age: Halo . The Demon Lords used the Halo to defeat the Phyrexians and then disappeared themselves. The five families settled in to dominate niche industries and command territory in the city's three boroughs, operating in full view of each other and in secret. A nominal, all-but-vestigial city government ensures the lights stay on, the water is clean, and the streets are kept in good repair. Law as other planes know it — a crown or government and a police force, with hard rules and penalties for those who break them — does not exist in New Capenna. Instead, there is an agreement, a code agreed to by the five families. Fronts, subterfuge, and clandestine operations are played out as mutually understood theater. They all do it, and they all understand that it is polite to try and hide their flouting of the rules, a nod to the fact that the rules exist. Flexibility, allowances, favors, and looking the other way is key in New Capenna: as long as no one family attempts to take too much for themselves, neither will the other families, and there is peace in New Capenna. During the events of Streets of New Capenna , Ob Nixilis infiltrated the plane, siphoning members of each of the families and hosting a targeted strike on their leadership on the night of the Crescendo , the plane's new year celebration. At least one boss, Xander , was killed, with Jetmir seriously wounded. After the sacrifice of Giada , possibly the last free angel in the city, the city's other angels began reawakening from their stasis. Atraxa was sent with ten thousand soldiers by Elesh Norn to destroy New Capenna and its reserves of Halo. The Phyrexians compleated the Maestros' leadership, including Anhelo . However, a resistance formed by the remaining members of the Families and the newly awakened angels counterattacked, destroying Park Heights in an action dubbed Operation Falling Star, dropping the neighborhood on Atraxa and turning the tide against the invaders. Leaving the defenders to finish their work, the Capennan angels traveled to the other invaded planes to help combat the Phyrexians. Finishing the fight on New Phyrexia, those that traveled to the plane could not return after its multiversal switch. After the Phyrexian invasion, the remaining angels of New Capenna turned their focus on their captors and betrayers, the demons. New Capenna's five families The Obscura ( ) are gifted magicians. The Maestros ( ) are the elite assassins of New Capenna. The Riveteers ( ) are destruction workers. The Cabaretti ( ) are party monsters. The Brokers ( ) are the demonic lawyers of the crime world. The Caldaia The city consist of three levels, the down-to-earth Caldaia, the frivolous Mezzio, and the lofty Park Heights. The Caldaia - A factory district below the Mezzio that produces Halo. It was given a utilitarian redesign by Ziatora and the Riveteers. It is ruled primarily by the Riveteers, though the Obscura also have operations there. Bassomer/Bassomar Bridge - Connects the Caldaia to the Mezzio. Lower Bassomer Station - A subway station that leads to Upper Bassomer Station in the Mezzio. The Merchants Guild Hall Port District The Treza - Headquarters of the Riveteers and the family's boss, Ziatora . Ziatora's Dracotreasury - a massive vault full of gold and Halo hidden below The Treza. The Verts - The most notorious apartment district in the Caldaia. The Mezzio - The city's midtown and its beating heart. It is vied over by the Cabaretti, Obscura and Maestros. Angel's Breath - A small Cabaretti bar on the lower west side of town. Bassomer/Bassomar Bridge - Connects the Caldaia to the Mezzio. Upper Bassomer Station - A train station that leads between Lower Bassomer Station in the Caldaia and Cloudponte Bridge in the upper Mezzio. Central District Nido Sanctuary - Headquarters of the Brokers and the family's boss, Falco . Cloudponte Bridge - Hosts a train station that leads between Upper Bassomer Station in the lower Mezzio and Crossponte Bridge in Park Heights. The Kallock Library - An Obscura location. Theater troupes perform on the corner of King's Street and Butchers . Mezzio Cleaners - A launderer. The building has six sections: one for each of the families and one for the general populous. Mezzio Square Mezzio Station - The central trainstation of the Mezzio. The Vantoleone - Headquarters and primary cabaret of the Cabaretti and the family's boss, Jetmir . The Red Room - A popular stage for Cabaretti performers. The Rose Room - The Vantoleone's most exclusive lounge. Vesti Square - In the never-dark center of the city. Park Heights - A rich district above the Mezzio carefully manicured with aeries, waterscapes, fauna, and terraced gardens supported by girders. It was ruled by the Brokers, though the Obscura and Maestros had headquarters there and the Cabaretti operated several recreational areas like opera houses. It was destroyed by Errant in order to defeat the invading New Phyrexians. The Cloud Spire - A seemingly inaccessible skyscraper that serves as the main Obscura stronghold and sanctum of the family's boss, Raffine . The Interfactorium - Contained in the lower levels of the Cloud Spire, where Obscura agents plot and scheme using scale maps of the entire city and a temporal-prophetic library of histories and potential futures. Crossponte Bridge Station - A train station connecting to Cloudponte Bridge in the Mezzio. Falco 's penthouse . Ferara Park - The central feature of Park Heights, and the park that gave the borough its name. Grand Capenna Hall The Grand Opera House Mergino Fountain - A calm area of the city with orderly rows of palm-leaved bushes and winged architecture. Museum of Old Capenna - Headquarters of the Maestros and the family's boss, Anhelo , who served as its chief curator. Obliterated by Atraxa during New Phyrexia's Invasion of the Multiverse and reduced to rubble. The Shadow Hostel - An opulent safehouse containing Xander's Lounge , where assassins gather to trade secrets and contracts. Xander's Vault - Xander's private collection of artifacts, weapons, mementos, and art from before the city's founding. Upper Bridge Plaza Herculaneum Candy Shop - A candy shop owned by the devil Henzie Torre . Deep within the heart of New Capenna is the core , the support structure running the entire length of the city. Built by the Riveteers and hidden in plain sight under a maze of girders, it was accessible only through forgotten entryways. Represented in: Associated cards: Referred to: New Capenna's three levels are based on different cities of the United States during the 1920's: The Caldaia represents Chicago, the Mezzio Manhattan, and Park Heights Hollywood. New Capenna's name may be related to the Italian word capanna , meaning shelter ."}