{"text": "The New Phyrexia-Zhalfir switch was the cosmic event that ended New Phyrexia's Invasion of the Multiverse . It involved the return of the phased-out Dominarian land of Zhalfir as a self-contained plane , and it taking the place of New Phyrexia in the Multiverse . During the first Phyrexian Invasion of Dominaria , Urza intended for the advanced nation of Zhalfir to be the vanguard against Phyrexia. Teferi Akosa , however, became resentful of Urza's treatment of himself and others and devised a plan to stay out of the war. He cast a powerful phasing spell that removed Jamuraa and Shiv (and thus Zhalfir) from existence, with the plan to return them to Dominaria once the danger of Phyrexia had passed. However, during the Mending, the Zhalfiran time rift was closed without aligning it with the phasing spell, and so Zhalfir seemed lost forever. Teferi spent decades attempting to undo this error to no avail. However, soon before the Invasion of the Multiverse, Teferi wound up on Zhalfir when the Temporal Anchor failed. He later concluded that Zhalfir had become a pocket plane where time slowed significantly - only ten years had passed on Zhalfir in the nearly three hundred sixty years since it was phased out. Elesh Norn compleated planeswalkers and sent them to other worlds, beginning the invasion in full force. However, the instrument of New Phyrexia 's invasion, the Invasion Tree known as Realmbreaker , was ultimately their downfall. With the help of Chandra Nalaar and Koth , the dryad planeswalker Wrenn bonded with Realmbreaker, whom she nicknamed \"Eight,\" before traveling through the Multiverse along with its spirit. Her plan was to locate Teferi, who she believed was the key to victory. Eventually, she found her way to the isolated plane of Zhalfir and was welcomed there by Teferi. However, there was a problem with bringing the Zhalfiran reinforcements to New Phyrexia: the opening of the plane was narrow and not fit for the reinforcements to pass through. Her solution was, with the help of Eight, to push New Phyrexia into the knotted magic that held Zhalfir. This melded the planes enough that Zhalfir's army could properly land in New Phyrexia. The reinforcements dispatched the remaining three praetors , leaving Phyrexia directionless and stranded. With their objective of defeating New Phyrexia complete, the Zhalfirins, Mirrans, and their planeswalker allies evacuated the plane. New Phyrexia took the place of Zhalfir in the planar tangle and phased out of existence, while Zhalfir returned to the Multiverse. As New Phyrexia phased out, glistening oil used by the invading Phyrexians across the Multiverse was cut off from its source. Their armies abruptly ceased to function and crumpled to the ground. Mirrodin's five suns now orbit Zhalfir, and the Mirran survivors were taken in as refugees, while the Capennan angels who had taken the fight to New Phyrexia were trapped there."}