{"text": "The nameless, former planeswalker once called Nicol Bolas (born Nicol ) is the youngest and most infamous of the seven Elder Dragons that survived the Elder Dragon War . He was also known as the Forever Serpent , the Horned One , the God-Emperor of Madara , as well as the Second Sun and God-Pharaoh of Amonkhet . After his downfall in the War of the Spark - during which he briefly became a near-omnipotent Dragon-God - he was magically stripped of all names and titles by his twin brother Ugin to prevent anyone from summoning him ever again. He is dead to the Multiverse, his survival known only to Ugin and Jace Beleren . The now-mortal, planebound dragon is kept imprisoned on Ugin's Prison Realm , formerly known as Bolas's Meditation Realm. He had styled himself \"the mind-ripper, the deathbringer, the winged dark that terrifies your dreams, the first to witness the sunrise on Dominaria , and the last to watch it set for the final time\" . On Ixalan he adopted the pseudonym Lord Nicolas , and on Ravnica that of Master Venati . Unlike normal dragons, the olive-green-scaled Bolas stands on two legs, using his long tail for balance. His face is flattened and broad, with pale green eyes and a human-like mouth and features. His horns curve upward, framing a hovering orb between them, and his enormous wings spread behind him. His body stretches 60 feet long, with a 60-foot wingspan, and he weighs 60 tons. When Bolas breathes fire, it is black-tinged with death magic. His flight is inelegant. At one point, Bolas was the most powerful planeswalker of the Multiverse . Along with his twin Ugin , they are possibly the oldest beings alive. He was said to be old before Dominaria was even born. He sired whole races, populated entire planes, and then hunted them to extinction for his amusement. Bolas' hallmark is his touch, an inborn ability that causes a mind-shattering effect with the slightest caress. In his duel with Teferi , Bolas proved skilled enough in blue magic to completely nullify the time magic Teferi had created. Nicol Bolas had access to Black , Blue , and Red mana, and was a master of all three, having many lifetimes worth of experience and knowledge. When Nicol Bolas planeswalked, he disappeared in a golden light, and it was also noted by Sarkan Vol during their first encounter that the way Bolas moved was as though he moved the planes around him, not the other way around, although that may be hyperbole brought on due to Sarkan’s notable reverence towards dragons and his wonder at meeting his first dragon planeswalker (particularly one as powerful as Bolas). Young Nicol Bolas Like the other Elder Dragons, Nicol Bolas was the spawn of The Ur-Dragon , born from an egg-stone shed from the Ur-Dragon's wings, which fell from the sky like a meteor. Born simply as Nicol, he emerged from his egg-stone twinned together with his brother Ugin . Whereas every other Elder Dragon egg spawned only one dragon, Nicol and Ugin woke together, named themselves together, and touched the soil of Dominaria at the same instant. They were both only half the size of their other siblings. When they witnessed their newly-hatched sister Merrevia Sal being killed by humans and their dogs , Nicol expressed outrage, but Ugin convinced him to not aid her - to preserve their own lives, to seek more knowledge, and to find their siblings. Inspired by the sun - who he described as bright and fearless - and by his success in killing one of the hounds, Bolas acquired the notion that this multiverse is a place of \"hunters and the hunted\". Originally, Bolas was seen as the least of the Elder Dragons, mockingly called the Last Fallen, having shared his name with Ugin and being smaller and weaker than his siblings. When Chromium pointed out that the twins shared their names, one for each, Nicol took the second name Bolas to feel equal to his larger siblings. After Palladia-Mors mocked their size and their hunting techniques, the twins spent years perfecting various techniques for hunting in tandem. After this time, they met and then lived with Arcades Sabboth who had taken up residence as dragonlord in a human settlement. Here Nicol learned about the nature of humans, and how easily they could be manipulated to further his own goals. Having learned enough, he took Ugin to seek revenge for their sister's murder. After tricking the dragon hunters into a quarrel between several factions, he took over as supreme leader. After this, he tried to use his brother for his ends, and Ugin realized that Bolas had never truly cared for him at all. This mental shock caused Ugin's planeswalker's spark to ignite . Thousands of years before the Brothers' War or even the Thran Empire , the Elder Dragons were engaged in a conflict that lasted for thousands of years, the Elder Dragon War . Nicol Bolas emerged victorious, though there were survivors other than himself, his brothers Arcades Sabboth and Chromium Rhuell , his sister Palladia-Mors , their cousin Vaevictis Asmadi , and possibly others. At the crescendo of the war, Bolas ruled half of Dominaria. The last clash of the war took place on Jamuraa , between the troops of Bolas himself and Arcades Sabboth. Only the unexpected intervention of Ugin prevented the ultimate defeat of Sabboth. The war ended there and then, because in rage and envy of Ugin's newly-revealed planeswalker status, Bolas' own spark ignited and he planeswalked away. Many, many times and adventures later, the two planeswalking brothers confronted each other on the Meditation Plane . First above the wide waters of the Meditation Realm and then on a wild pummeling path through the planes, they struggled for days, years, generations. In the end, by diverse paths, they returned to the Meditation Realm where Bolas killed Ugin. Monstrous waves rose from Ugin's fall in the water. The waves ran on and on, washing far beyond the bounds of the Meditation Realm into the web of connection that links the planes and the Blind Eternities . Bolas was flung through ten or twenty or a hundred planes before he fell hard back into Dominaria, onto the island chain of Madara . Some years later, Bolas fought a Demonic Leviathan planeswalker on the still-young plane of Dominaria . The fight lasted a month, reduced Madara to a third of its original size, and created the first temporal rift . In the end, the dragon relied upon his touch to defeat his foe. After the battle Bolas feasted on the remains of the leviathan for over a year, absorbing its power in the process. When he finished, naught was left besides what eventually became known as the Talon Gates and an assortment of blubber. Bolas regards the Talon Gates as his finest trophy and visits them and Madara as often as he can to relish that victory. Nicol Bolas killing Ugin the second time Bolas' maliciousness and power came to the notice of the planeswalker Azor , who devised a plan with the reborn Ugin to permanently imprison him. To this end, they wanted to use Azor's spark to create an artifact known as the Immortal Sun to trap him on the continent of Torrezon on the plane Ixalan . Azor would summon Bolas into the plane and trap him there, and Ugin would remove him from existence entirely. To their grief, Bolas discovered the plan thanks to Azor leaving hints of himself on the planes that he had ordered. To thwart their plan, Bolas traveled to Tarkir . He found a willing pawn in Yasova Dragonclaw , Khan of the Temur clan, who sought to end the reign of Tarkir's oppressive dragons. Her conviction and commitment to the destruction of Tarkir's dragons coincided with the ambitions of the Elder Dragon Planeswalker himself. To this end, Bolas gave Yasova a vision of a peaceful and idyllic Tarkir littered with the bones of dragons. In Yasova's vision, a great dragon with scales of burnished gold and a golden orb floating between his horns promised her that if she would lead him to the lair of Ugin, the Spirit Dragon, he would slay him, and the dragons of Tarkir would be no more. Guided by Yasova, he intercepted Ugin and prepared the ritual to call him there. After a close battle, Bolas was finally able to defeat the Spirit Dragon when he and Yasova turned Ugin's own lesser dragons against him. In the original timeline, Ugin died from the physical and magical injuries Bolas had inflicted on him. However, the planeswalker Sarkhan Vol traveled back in time from 1280 years in the future and saved Ugin by encasing him in a hedron cocoon immediately after the battle ended, preserving the Spirit Dragon in a state of suspended animation. Thus, unbeknownst to Bolas, the Time stream was changed so that Ugin still lived. Suspicious as always, Bolas returned eighteen years later when he discovered that Yasova and her twin granddaughters Naiva and Baishya were visiting the site of his victory. He noticed the hedrons on the grave but failed to perceive their significance. He offered Naiva the reign of Tarkir if only she would surrender her grandmother and her twin so he would understand their motivation to visit the grave. Yasova saved Naiva from Bolas' influence and tricked the elder dragon into thinking that Ugin's grave was targeted by the Immortal Sun to trap him away. This made him flee Tarkir. God-Emperor At some point, Bolas somehow became metaphysically tied to the Madaran temporal rift that he had inadvertently visited thousands of years earlier. As a result, he became unable to physically manifest on Dominaria without anchoring himself to local mana lines, lest his presence overwhelms the plane and cracks its foundation. On Madara , three lines of blue, black, and red mana intersected at a single point that was ideal for Bolas's purposes. Bolas slew the then Empress of Madara and erected his Imperial Shrine on the focal point. From there, he reigned for 400 years as God-Emperor of Madara. Unfortunately, Bolas created his own worst enemy in the form of his Imperial Champion, Tetsuo Umezawa . After several trials, Tetsuo renounced his title and declared his intention to slay Bolas, killing the dragon's regent . In a fit of rage, Bolas abandoned his body to follow Tetsuo's spirit into the Meditation Plane , unaware that it was a trap. This would ultimately prove to be a fatal mistake: Using the Meteor Hammer spell, Tetsuo destroyed Bolas's Imperial Shrine while Bolas's physical body was inside, severing the elder dragon's anchor to Dominaria completely. Without a physical form, Bolas' spirit-form was unable to escape back to Dominaria or any other plane, and without his connection to the abundant Dominarian mana that he used to fuel his spells, he was left without most of his magic. His physical superiority was rendered irrelevant by the nature of the Meditation Plane, which was a realm of thought and spirit; furthermore, Bolas was largely unaware of its workings, while Umezawa had experience manipulating the fabric of the plane's reality. Stripped of his advantages as a planeswalker, a sorcerer, and a dragon, and forced to battle in a realm where his opponent had a significant edge, Bolas was defeated and killed by Umezawa. However, as a result of his connection to the temporal rift, a ghostly remnant of his life force still lingered by the Madaran coast, trapped between the material world and the Meditation Realm. Bolas' essence remained present in his land, which became overrun by the nekoru descendants of Wasitora and their followers. As the temporal rifts expanded, he became able to manifest in Madara again, albeit as an immaterial shade. In this form, he presented himself under the alias of Sensei Ryu . When he sensed that the planeswalker Teferi was lost in a rift and had become separated from his companions he arranged for them to arrive on the Madaran beach near the Talon Gates.\nUsing Venser 's latent planeswalker spark , he was able to finally escape his prison and be fully reborn into the physical world, regaining his body by pulling a copy of it through the rift from an earlier point in time. After Teferi located his companions, he challenged the dragon to a duel to stay Bolas's \"gratitude.\" Bolas easily won, absorbing and planeswalking away from Teferi's attacks, after which he tortured him with his mind-shattering touch and ripped his body to pieces. While Bolas was taunting Teferi's allies with the defeated planeswalker's head in his claw, the dying Teferi shared his knowledge of the collapsing planes with him and he was made aware of the severity of the rift problem. Bolas decided to let Teferi live, allowing the dismembered mage to heal himself. He left soon after swearing a vow to take a terrible vengeance on anyone related to the Umezawa line, and anyone who had ever aided or come into contact with it, then presumably left for Kamigawa . Bolas later returned to Madara, where he was ambushed by the planeswalker Leshrac , who formally challenged him to a duel; the latter was defeated after an epic battle and was imprisoned in the mask of the Myojin of Night's Reach . Bolas implied that he had stripped most of Night's Reach's dark power but she had managed to escape. Bolas then confessed to Teferi and his companions that he had observed the rift phenomenon and took responsibility for closing the Madaran rift, in a way: He had used Leshrac's life force to close the rift. Believing that it was unlikely Teferi and his band could forestall the imminent collapse of the multiverse, Bolas claimed that he had devised a plan to preserve himself if happened. He then left for an unknown destination, likely Amonkhet . Although the multiverse survived, Jeska 's Mending spell changed the nature of the planeswalker's spark . Bolas, like all other \"old planeswalkers\" who survived past the Mending, lost a significant portion of his powers. Still, he retained the formidable powers of an Elder Dragon as well as his unmatched intellect. God-Pharaoh/The Horned One At an undisclosed point directly after leaving Dominaria shortly, but before the Mending, Bolas turned his attention to Amonkhet , drawn to the strange metal named Lazotep and its reaction with necromancy. During his arrival, he found himself opposed by the eight gods of the world. Despite his waning power, the Elder Dragon proved to be a formidable enemy, laying waste to the population and driving the gods before him, until they gathered in the city of Naktamun for a desperate last stand. In secret, the god Bontu conspired with Bolas to betray her brethren. When the dragon broke through the protective barrier of the city, he cast a spell that killed every single adult being on the plane, weakening the gods enough to subdue them and corrupting them to worshiping him instead. Three gods were set aside and twisted in their forms to fully serve him, while the remaining gods were simply mind-controlled. The spells that maintained the corruption would be maintained by Bontu, who hoped to be rewarded by Bolas later. Using the mummified dead of the plane to raise the children, he built himself monuments and wrote prophecies that would tell of his glorious return. Drawing on the phenomenons like the Curse of Wandering, one of these promises when he returns, he will shatter the Hekma, the magical barrier protecting the populace of Amonkhet from the horrors of the broken lands, and call those who have passed the Trials of the Five Gods to his side to grant them a true afterlife. The remaining ones, including the gods themselves, will have to prove their worth to him just like the mortals they tested before. The theology of this religion were kept in the Accounting of Hours . Afterward, Bolas left, waiting for the time his scheme would pay off. Additionally, Bolas warped the Angels of the plane to serve as his agents. Bolas also spread rumors that he was the one who had created Amonkhet, which was later reiterated by Liliana. The people of Amonkhet found his false prophecies that he will return when the second sun is positioned between the effigy of Bolas' horns on the plane. This is highly anticipated and reflected in figures of speech. Sometime after The Mending, a severely weakened Bolas met with a wizened Liliana Vess . She was jealous of the fact he was seemingly unaffected by the mending. He berated her, stating that he had lost more power than she could learn in a dozen lifetimes. Bolas lamented that only a few years previously, planeswalkers like them were akin to living gods who exerted their power and influence throughout the multiverse. Bolas proceeded to act as a broker for four demons to form a contract with her, to restore some of her power and youth at the cost of her soul. His price for this service was unknown at the time. However, it is later revealed after Liliana kills all four demons, that in the event of the demons' deaths, the contract defaults in ownership to Bolas instead of being dissolved. After the Mending, Bolas lost the ability to retain much of his 25,000 years' worth of arcane knowledge. He managed to escape to the plane of Alara where he began machinations while dwelling in the Shard of Grixis , claiming the necropolis of Kederekt as his own. He prepared to take advantage of the coming Conflux to regain his power, and started to manipulate certain individuals and organizations on the multiple shards to create an environment ripe with tension and ready for war: Bant : The Order of the Skyward Eye and Gwafa Hazid spread xenophobia and disorder along the borderlands of Bant's nations. Esper : The Seekers of Carmot warned Esperites about dwindling supplies of etherium , and created a fervent demand for the otherworldly red stone called sangrite . Grixis : Malfegor , Bolas's second-in-command on Alara, led massive armies of the undead , gathering hordes ready to invade the other shards and cut chaotic swaths through any living resistance they find. In the form of a young boy, Bolas guided Thraximundar across the various shards, leaving destruction in his wake and feeding the Maelstrom . Jund : Rakka Mar stirred fervor for greater and greater \"life hunts\" among the warrior clans there. Naya : Marisi stimulated the emergence of the philosophical schism of the nacatl Cloud Empire and the revolt of the Wild Nacatl , which destroyed most of the advanced Cloud Nacatl civilization and cities and the cat-people nation's regression back to savagery. Tezzeret survived a near-death experience on the shard of Esper, awakening his latent spark. He found himself on Grixis, atop the Kederekt. After fighting off several creatures, all of whom presumably hoped to gain favor with Bolas, the artificer was approached by the dragon himself. Bolas offered him power in exchange for servitude which Tezzeret accepted. Disguised as a human, Bolas recruited the young Ral Zarek on Ravnica for several clandestine jobs. Sometime after the Mending, Bolas founded an interplanar consortium which was usurped by Tezzeret in a bloody coup d'état. Bolas retained his mind-reading ability and Tezzeret, fearful of his secrets, tried to counter it by using Jace Beleren . This ended in disaster as Bolas easily overwhelmed both planeswalkers mentally, and the pair barely escaped with their lives, fleeing from Bolas's hired barbarian horde. At the end of Jace's struggles, after he defeated Tezzeret in a duel and crushed the artificer's mind, it was revealed that this was all a plan Bolas agreed to regain his consortium. Liliana Vess was the original architect of this plot and had approached Bolas with her plan. Bolas did not regain his organization, but he had obtained Tezzeret's still living but mindless and crippled body. The Conflux The full gravity of Bolas' plans came to fruition with Alara's conflux. Through the manipulation of the peoples of all five shards, his plan to trigger full-scale war erupted across Alara, awakening the obelisks of mana on each of the shards and causing the Maelstrom to grow in magnitude. Throughout the conflict, he acquired the servitude of Sarkhan Vol to help spread seeds of destruction across Naya. Ajani 's quest to find his brother's killer eventually led him into conflict with Bolas, and knowing that he could not defeat the dragon-god himself, he summoned the essence of Bolas' soul to fight for him. The ersatz dragon battled Bolas in perfect symmetry before they lunged at each other with powerful bites. Both connected simultaneously, and in a flash of light, the dragons disappeared. It is unknown how badly hurt Bolas was, having harvested the essence of most of the Maelstrom immediately before this climactic battle. His loss to Ajani shook the dragon like none before him to the point, Bolas had to account for the leonin in his schemes . Bolas demonstrated great interest in the war on Mirrodin . He sent Tezzeret to observe and assess the rise of the New Phyrexians on the plane, and to serve as Bolas's eyes and ears in the Phyrexian hierarchy. Ultimately, the artificer's mission was to delay the rise of a central leader for as long as possible, a task that was doomed to fail. He also wanted to make sure they didn't have access to interplanar travel. Tezzeret confirmed they didn't upon his return. Bolas believed that the Phyrexians were a chaotically dangerous force that could threaten his rule. His first act upon becoming god-emperor would be to destroy New Phyrexia. At some point, Nicol Bolas took notice of the volatile nature of Zendikar. He investigated the Eye of Ugin and left after studying it. Long afterward, Bolas sent Vol to guard the Eye, to make sure nothing disturbed it. Sarkhan was, however, misled. When Bolas had sought out and defeated Ugin , he had extracted a great deal of information about the Eldrazi and the lock that kept them contained. Knowing of the titans and what it would take to unleash them, Bolas sent Sarkhan to the Eye and manipulated the pyromancer Chandra Nalaar into arriving at the same time. Unfortunately, that only solved two-thirds of the problem, and so Bolas gambled that Jace would show up if prodded in that direction. The purpose of his manipulations was clear—the release of the Eldrazi. He had hoped that the event would lure a horde of planeswalkers to harvest their sparks . This scenario didn't play out. Bolas easily defeats the Gatewatch On Amonkhet, Bolas's scheme worked as intended, with hundreds of the Worthy Dead being converted into his Eternal army. When he came to the plane and materialized above his throne in Naktamun, he found the city in ruins, the gods felled, and its population under assault from his minions. Pleased, he turned to the treacherous Bontu, commanding her to kill the last of the gods, Hazoret . When Bontu managed to defeat her sister, Bolas instead rewarded her with death, forcing numerous undead to tear her apart. Seeing his plans come to fruition, Nicol Bolas now turned his attention on the Gatewatch , a meddlesome group of planeswalkers that had come together to stop the Eldrazi Titans on Zendikar . Asking himself if they were suitable for what he required, Bolas waited for them to form their strategy. As each of them attacked him with their methods, the dragon proved resilient and even condescending. Using his tail, he kept the invulnerable Gideon at a distance by whacking him against the structures of Naktamun and simply ignored Chandra's flames, Nissa's vines, and Liliana's zombies. Focusing on Jace, Bolas let him briefly enter into his mind before crushing that of the telepath. Unknown to either Jace or Bolas, this attempt triggered a failsafe placed in Jace's mind by Ugin, to protect the secret of the latter's survival from Bolas, by temporarily wiping the mind mage's memory and forcing him to planeswalk to Ixalan, thus saving Jace's life (as well as Ugin's secrets). Turning to the rest of the Gatewatch, Bolas addressed Liliana and offered her a chance to survive the confrontation. Offering to tutor her in the use of the Chain Veil, the dragon demanded her to retreat to another plane where he would later contact her. The necromancer took the offer, even asking her teammates to join her, if in vain. Bolas now turned his attention to the rest, taking Chandra into one of his claws and breaking several of her ribs with brute force while lecturing her on the futility of using fire against a dragon. As the pyromancer planeswalked away to save her own life, Bolas turned to Nissa. Using his command over the corrupted world, he turned her link to the land against her to attack her with necrotic magic, forcing her to flee as well. Now facing Gideon, the sole remaining member of the Gatewatch, Bolas took him into one of his claws and used magic to pierce his invulnerability, giving him a choice: stay and die or live and betray the oath he had sworn at Sea Gate. Eventually, Gideon fled too, leaving Bolas victorious. Only a few minutes later, Tezzeret appeared and was sent by Bolas to check on the progress of Ral Zarek . Reveling in his victory, Bolas celebrated the first steps in his plan for reclaiming his stolen power. Bolas sent Tezzeret to Kaladesh to fetch a portable planar portal . He then sent Vraska to Ixalan to lay claim on the Immortal Sun . After Vraska had found the artifact, she summoned Tezzeret who took it away with his Planar Bridge. Nicol Bolas' grand scheme After putting together some of Bolas' machinations on Ixalan and Amonkhet , Jace and Vraska theorized on Ixalan that something on the plane of Ravnica was of extreme interest to Bolas. It seemed to be part of his plan to reclaim his lost power. To reach this goal, they reasoned that he planned to invade the plane with an interplanar army of immortals , while trapping the resident planeswalkers. Nicol Bolas had turned five planeswalkers onto his side and has given them each control over a guild. Vraska, after having her memories of plotting against the dragon taken away, was under Bolas's influence and became the leader of the Golgari . Other pawns included the likes of Dovin Baan for the Azorius and presumably Ral Zarek for the Izzet . Bolas later send a Dimir agent to plant a thought in the mind of Niv-Mizzet who ordered Ral to turn Project Lightning Bug into a beacon to call other planeswalkers to Ravnica. In addition Kaya was hired to assassinate the Ghost Council , and was placed in control of the Orzhov Syndicate . Domri Rade had taken control of the Gruul , and was counted upon to choose Bolas' side. Bolas also tried to divide the Selesnya Conclave , by controlling glademaster Garo . Meanwhile, Tezzeret prepared to deploy the Planar Bridge for the approaching battle. When Bolas arrived on Ravnica, he was confronted by Niv-Mizzet . They engaged each other in epic combat that destroyed large portions of the city. The two dragons fought using a staggering array of magical, physical, and aerial attacks in which both drew blood. Bolas was even surprised when his mind-shattering touch could not penetrate the Firemind's mental barriers. As the fight wore on, Niv sensed his eventual defeat. After Niv collapsed a huge chunk of the city onto Bolas at a Simic zonot , Bolas emerged in a dark sphere of death and destruction, causing Niv to experience fear for the first time and leaped toward his impending death. In the end, Niv-Mizzet's skull and charred bones were all that remained. Defeat of Bolas After luring dozens of planeswalkers to Ravnica with the Interplanar Beacon , Bolas trapped them there through the use of the Immortal Sun . He claimed dominion over Ravnica and cast the Elderspell that harvested sparks and would grant him \"ultimate power\" and godhood . Bolas installed Liliana as his Dreadhorde 's general. While leading the Eternals, she witnessed a young girl shield her younger brother from a collapsing wall, only for both of them to be crushed by the falling debris. Pausing to take the scene in, and possibly being reminded of her failings in saving her brother Josu, Liliana then turned the Dreadhorde on Nicol Bolas, stopping their attack on Gideon (but not before one harvested Dack Fayden 's spark). Bolas saw this and immediately made good on his prior warning to Liliana. He invoked the contract's magic, and Liliana started to disintegrate. Bolas' roar of anger was matched by Liliana's scream of defiance. Gideon then sacrificed himself to save Liliana from the contract. Liliana commanded Oketra and Bontu to attack Bolas. Unexpectedly, Niv-Mizzet impaled Nicol Bolas through the back with Hazoret's spear. Bolas was the one who gave Hazoret her spear in the first place and it contained a little of his essence, which is why it was able to damage him in his god-like state. Bolas managed to obliterate Oketra , but the distraction allowed Bontu to bite Bolas and harvest all of the elder dragon's sparks, including Bolas's own. Bontu was not able to contain all the sparks and quickly ruptured into shards. Nameless and imprisoned As the gathered planeswalkers charged at the weakened and desparked Bolas, Ugin telepathically reached out to Jace , explaining that he needed Bolas alive instead of dead. Citing how Bolas had cheated his death at the hands of Tetsuo Umezawa , and how Ugin himself cheated death by becoming a Spirit Dragon, Ugin determined that the surest way to neutralize Bolas as a threat was to imprison him while tricking the multiverse into thinking he perished since Bolas' arrogance would have prevented him from having precautions in the case of his imprisonment instead of his death. To this end, he requested that Jace conjure an illusion of Bolas dying and disintegrating into ashes. Jace reluctantly complied, fooling the other planeswalkers long enough for Ugin to planeswalk into Ravnica undetected and then planeswalk out with Bolas in tow. Ugin wrapped Bolas in his wings while traveling through the Blind Eternities , taking him to the Meditation Realm . Because Bolas had lost his spark, he was grievously wounded even with Ugin's protection, and it took him weeks before he regained consciousness and months to start recovering. Ugin told him that it was his world even before Bolas became a planeswalker and that he had helped Niv-Mizzet to be reborn. Ugin also revealed that the gem in the middle of Bolas's horns is part of Ugin's soul and he saw every step and mistake of his brother. Ugin then informed Bolas that he had lost the use of both his names, so that he couldn't be summoned by another being ever again. Ugin told his brother that he'll become his jailer for the remainder of Bolas's mortal life and expanded himself all over the Meditation Realm. It has now become a prison for Ugin and Bolas, alike - they cannot leave it. But just to be certain that Bolas will never plague the multiverse again, Ugin will keep watch over his brother until Bolas' natural death in thousands of years. Key events in Test of Metal have been contradicted by later stories. Chief among these contradictions are Jace and Liliana believing Tezzeret to be dead prior to the events of Kaladesh, and Jace having not seen Liliana between the events of Agents of Artifice and Catching Up . In a cave composed entirely of sangrite, Bolas rebuilt Tezzeret's body and mind and tasked him to find Crucius the Mad. Bolas ultimately saw this mission come to fruition when he tracked Tezzeret to an island made entirely of etherium. There he demanded to know what Tezzeret had been up to. To get direct answers, Bolas formed a mental link to Tezzeret and read his memories. There, many of Tezzeret's plans and actions were laid out. Bolas soon learned he would not be the only visitor upon the Metal Island though. Jace arrived next, followed lastly by Sharuum, stripped of her etherium. As soon as the sphinx left, a terrible fight broke out among the assembled walkers, and it ended with Bolas victorious. However, during the fight, his concentration and powers severely waned. This was revealed to have been engineered by Tezzeret, who was the true victor of the fight. Tezzeret himself left Bolas trapped on the island, infested with a mental device that would keep the Elder Dragon there as long as needed. Little did Tezzeret anticipate that the dragon he had been fighting was nothing more than a poorly constructed simulacrum, specifically made to fail at reining in the artificer. Bolas himself appeared on the island and informed his copy that it would not be alive by the time Tezzeret returned, and he had served his purpose in making Tezzeret reveal the secrets he had learned. Nicol Bolas was originally printed as a creature in Legends , and reprinted in Chronicles , Time Spiral , From the Vault: Dragons , and Masters 25 , the last two featuring new artwork. Nicol Bolas also appears as a card in the Japanese TCG Duel Masters , which is likewise published by Wizards of the Coast . In Conflux , he was printed as a Planeswalker card with the type Bolas . This would later be reprinted in Duel Decks: Ajani vs. Nicol Bolas and finally in Magic 2013 , being the first-ever multi-colored card in a core set. He is considered by many fans to be one of the major antagonists of the MTG storyline. Bolas narrates the trailer for Duels of the Planeswalkers 2013 and is the primary antagonist of the War of the Spark trailer. He is considered by Kruphix , one of the gods of Theros , to be one of the greatest possible future threats to the plane putting him on the same level of danger as the Eldrazi and New Phyrexia . By Kruphix's admission, any of the three would be able to defeat all of the gods of Theros. However, Kruphix does not realize that the Bolas he sensed from Ajani's memories are merely a shell of his former self and true power. Despite his mana alignment, which is associated with darkness and used this way in some of Bolas' appearances, Bolas bears a strong sun and light motif in Emperor's Fist (where he is associated with the sun; see introduction quote above), in Amonkhet 's storyline (where his assault on the gods is done through a blast of white light, and he uses the Second Sun to cultivate his worship as solar), in post-Ixalan stories (as he holds possession of the Immortal Sun ) and in his backstory in Core Set 2019 , where it is shown that Bolas modeled himself after the sun, ruled his first kingdom as the \"Second Sun,\" and his planeswalking manifests as golden light. Mark Rosewater has expressed confidence that Nicol Bolas will appear again someday, but most likely not as a planeswalker due to the events of the Bolas Saga . In the video game Magic: The Gathering Arena , Bolas is voiced by Jonathan Lipow. Bloas received cross-promotional cards in Lord of Vermilion II and Lord of Vermilion Re:2 . The Spirit-Gem Already immensely powerful, Bolas has gathered several artifacts to add to his plethora of abilities: Gem of Becoming The Spirit-Gem that he wore between his horns, which looks similar to the Gem of Becoming. Found on the Meditation Realm, Bolas was unaware that it was made from a piece of Ugin's essence. Ugin used his connection with the Spirit Gem to observe the events of the War of the Spark without being on Ravnica. Immortal Sun — Used as a means to trap planeswalkers on Ravnica. Entrusted to Dovin Baan during the War of the Spark. Planar Bridge — Used as a means to bring his Eternal army to other planes. Grafted into his minion Tezzeret's body. His citadel — Used as a phylactery to store the sparks of the planeswalkers he harvested during the War of the Spark. Associated cards: Depicted in: Quoted or referred to: Nicol Bolas's reign: Nicol Bolas . Planeswalker Biography . Wizards of the Coast. Doug Beyer (April 08, 2009). \" The One, The Only, Nicol Bolas \". magicthegathering.com . Wizards of the Coast. Monty Ashley (August 27, 2012). \" Bolas's Minions \". magicthegathering.com . Wizards of the Coast."}