{"text": "The Nine Titans were a group of planeswalkers brought together by Urza to attack Phyrexia . Urza Bo Levar Daria Freyalise Commodore Guff Kristina of the Woods Taysir of Rabiah Tevesh Szat Lord Windgrace In the first draft, Teferi and Parcher had been elected to be in the group of Nine Titans. Teferi changed his mind though and phased himself and his lands out of the time stream instead of joining. This led Urza to accept Taysir's demand that his stepdaughter Daria would join. Later Freyalise insisted that Kristina would come along, apparently just to spite Taysir, and Urza agreed, dropping Parcher, whom he thought was a bit too crazy anyway. To help them survive the lethal conditions of a counterstrike on Phyrexia , Urza constructed nine mechanized suits of powered armor called titan engines . The Titan Engines were huge constructs with a vast arsenal of weaponry. They contained aeries of falcon engines (artifacts created to detect glistening oil and destroy Phyrexians), rocket launchers located on the wrists, mana cannons, as well as colossal hands and feet that could crush hundreds of Phyrexians at a time. The design of the titan engines' cockpit window structure strongly resembles the Thran symbol . Urza was heavily influenced by the designs of that ancient race of artificers, and so the design of the titan suits reflected the symbol. Entering Phyrexia, the Nine Titans began to destroy the artificial plane in a final gambit to protect Dominaria . However, Tevesh Szat betrayed the Titans and killed Daria and Kristina of the Woods. Urza then revealed that he had predicted Szat's betrayal, indeed soliciting his aid precisely to solve a \"moral dilemma\" of powering up a superweapon, and used Szat's life energy to fuel the soul bombs that would devastate Phyrexia. Unfortunately for the remaining Titans, as well as Dominaria itself, Urza found himself unable to complete his lifetime goal of destroying the artificial plane. Unwilling to destroy a place full of such potential knowledge, he dismantled the master soul bomb, which would have been able to set off all of the others, creating a ripple effect that would have decimated Phyrexia to the point of no return. After destroying it, he surrendered himself to Yawgmoth . Depicted in: Referred to:"}