{"text": "Nissa Revane ( Phyrexian : nELFD , IPA : [nisəʔ] ) is a Joraga Zendikari elf and former planeswalker who wields magic to muster elves and elementals and amplify their might. She was a member of the Gatewatch , before she was compleated during the events of Phyrexia: All Will Be One . At the end of New Phyrexia's Invasion of the Multiverse , she was un-compleated , and subsequently lost her spark as part of the consequences of the invasion. Nissa has long dark hair, large pointed ears, and Joraga tattoos on her face. She is usually clothed in green leather clothes with a high collar and cloak, knee-high leather boots, and a bright green sash about her waist. She stands 5’5″ tall and weighs 115 lbs. Her eyes are green, including the sclera, iris, and pupil. When creating spells, Nissa's eyes and tattoos shine bright green. During her compleation , Nissa had two new arms grafted onto her body. Black tears streak her cheeks. Much of her body was replaced with copper root and bramble. Her voice was left unchanged. After she was brought to Zhalfir and before her uncompleation, Koth , Karn , and the Zhalfirin healers removed as much of the Phyrexian metal from her body as they could. Nissa was first presented as a proud nature mage who believed that elves are the pinnacle race of the multiverse , and the Joraga the greatest of them all. Born on Zendikar , she possessed a deep love for her home plane, originally to the exclusion of all others. She was said to have a deep-seated hatred of vampires , a fear of snakes , and a love for flowers. Her first incarnation as such was a tribal Elf planeswalker Nissa was retconned into an animist whose ties to her home plane go beyond that of a normal shaman or even a druid . As such, most other planeswalker iterations of Nissa were based on land animation or Elementals. Her soul speaks to Zendikar, and the land is as much a part of her as the blood pumping inside her veins. In this view, she is much more tolerant of other races . Since leaving the Joraga, music became Nissa's favorite indulgence. Before joining the Gatewatch , she meditated daily. Nissa's magical abilities are rivaled by her martial strength, she's a seasoned warrior who is as comfortable in a sword duel as stomping through a city riding a massive animated tree. She has archery, swordplay, and scouting skills. Her affinity for Zendikar lends her power there beyond what she's capable of elsewhere in The Multiverse , able to channel the planes' vast reservoirs of magic into incredible feats. She can communicate and connect with the Worldsoul from every plane and manipulate leylines . She has sensitive hearing. Nissa Revane is primarily Green -aligned but secondary in Black and tertiary in Blue . In her original origin, Nissa was born in the jungles of Bala Ged and led an unremarkable childhood. That is until her spark ignited while she was still very young. She thought nothing strange about her knowledge of the multiverse and was unabashedly curious. Unfortunately for the girl, her curiosity and behavior were anathemas to the Joraga tribe to whom she had been born. Cruelly, she was exiled from her tribe and left to the unforgiving mercies of the jungles. She lived a miserable life until finally, she found a new Joraga tribe willing to take her in. With her newfound second chance, Nissa rationalized that it was for the best that her gifts lay dormant and that it was much more fulfilling to fit in with her kinsmen than to explore her abilities. Soon after she joined her new tribe, she underwent the Joraga ceremony to become an adult, eating an extremely poisonous mushroom that would stop her heart and poison her blood against vampires. She lived and earned both her stem sword staff and a place amongst her people. She sought to live her life to exemplify the Joraga ways, and very quickly she gained recognition for her adherence to her people's culture. So great were her contributions that her tribe offered her the rites to become a leader of the Joraga Council. The rite would, unfortunately, once again send her away from her beloved lands, to live and learn amongst the other elven nations of Zendikar. Nissa chose to go further than that and turned to the endless nations of the Blind Eternities . The sight of the Eldrazi trapped in Zendikar makes Nissa's spark ignite. As a youth, Nissa was plagued by dreams. She and her mother Meroe were the last animists, and she was the only one to still have visions. Animists are shamans who can communicate with all parts of land and nature. According to the Joraga chief Numa , the animists somehow angered Zendikar and paid the price (implying that they were all killed by the Roil ). Meroe disagreed with his interpretation, but Numa was adamant to send them away because of the danger to the tribe. Thinking that Numa was right, that her visions were not a gift but a warning for Zendikar's retribution, Nissa packed her staff-sword and bow and slipped out of the house before her mother could notice. After her flight, Nissa was confronted in the forest by a glowing stream of light and life that was the land’s soul. It gave her a vision of wrongness in the land, a horrid writhing and buzzing inside of a mountain far away, and of Nissa herself confronting that danger undaunted. After the vision cleared, Nissa found out that her friend Mazik had tracked her. She explained to him that Zendikar was in pain and it wanted her help to save it. Through mesas and marshlands, the soul of Zendikar then guided them toward the danger. When they were confronted by a pack of vampires , Nissa discovered her power to summon elementals and defeated them. When the Roil occurred, she found out she could connect to the land and calm it. She could see it then; the Roil wasn’t an alien force; the Roil was Zendikar’s reaction to the dark enemy. Through the mountains, they traveled further to Akoum . There Mazik and the soul left her, leaving her alone to confront the evil in the central peak. With her newfound power, Nissa tried to obliterate it. This proved to be fruitless, and the confrontation with the unspeakable horror ignited her spark , which caused her to planeswalk away. In her original origin, her planar travels took her to the sunny world of Lorwyn where elves thrived and ruled uncontested. There she met elves who fully embraced their role as nature's pinnacle, using life magic and its deadly shadow to assert their primacy. This encounter led Nissa to experiment with black mana on her terms in secret, using it to complement her elvish teachings. Nissa on Lorwyn When Nissa arrived on Lorwyn, she immediately made a connection with this plane as well. She felt a pain here as well, the coming of the Great Aurora . When she recovered she was confronted by Dwynen's pack of elves, chasing eyeblights . They accepted her alien beauty and forced her to join the hunt. After a while, she realized that Galed and Dwynen 's pack were hunting and killing innocent boggarts . Just as she confronted the elves about this, the Great Aurora arrived and changed all of Lorwyn to Shadowmoor . Nissa was tempted to learn the dark secrets of the plane but found the power to planeswalk back to Zendikar. As she tumbled into the vast space, she saw her path unravel through the eternities. It would lead her to many places, but for now, it would lead her home. Eventually, Nissa's studies abroad settled in more mundane locations. Two encounters, one occurring on the city plane of Ravnica that terrified her, and the other to a metal world where she was taken prisoner, led her to cease her explorations and seek guidance in the Turntimber of Ondu . Here, she approached the Tajuru elves and petitioned to study with them. Speaker Sutina appointed her a Captain Leaftalker to a village north of the hometree of Mosscrack . She was met with suspicion and distrust, but she once again convinced herself she didn't care. However, there were bright sides to her time with the Tajuru. She befriended a man named Hiba and learned to enjoy music, a luxury she knew she would miss when she returned to the Joraga, who forbade such things. Sorin and Nissa Her peace was shattered when nearby villages began to go silent, and an emergency meeting was declared to determine the cause. They did not have to ponder long, as the Eldrazi brood attacked the meeting and killed Sutina shortly after it began. Left without their leader, Nissa took up the role Sutina had left for her and took her squad to investigate the nearest disappearances. It was to be a doomed mission though, costing Hiba and all but Nissa their lives. Nissa would have fallen to the brood herself, if not for the timely arrival of Sorin Markov . He liberated the vampiric slave Anowon and demanded that the two take him to the Eye of Ugin . Nissa agreed, if for nothing else to avoid facing the shame of having her squad wiped out. Nissa and her companions traveled to the nearby Graypelt Refuge to meet with another of Nissa's friends, the merfolk named Khalled , where they received a map to the Eye of Ugin in return for Anowon's texts. Khalled gave her supplies for their long journey to Akoum . Khalled provided them with whatever support he could, including a pathway stone piece of the puzzle tower Tal Terig so that they could find their way. The trio descended into the Makindi Trench and after avoiding The Roil several times, encountered an enormous band of Kor refugees. Shortly thereafter, they encountered a Kor of another kind. A babbling Kor woman traveling with a large group of goblins. Nissa and her company shared their campfire with the woman, who would only speak in bursts of ancient languages which fascinated both Sorin and Anowon. The Goblins told them that the woman was named Smara and that she was a \"witch vessel\" for a spirit trapped in a crystal she was carrying. They were also on their way to the Eye of Ugin, and Sorin suggested they travel together. Eventually, the mismatched group came to the Piston mountains and Zulaport beyond that. The trio decided to stay the night in Zulaport and find some way to cross the ocean in the morning, but a vampiric death attributed to their group led to them fleeing to the sea. Nissa stole a boat and summoned a massive behemoth to swim the ocean and pull the boat with it. The party soon regretted their hasty departure, as whatever food was on the boat was soon exhausted and the goblins traveling with them began to vanish one by one. Nissa could not sleep without allowing the behemoth to be dismissed and with no food or sleep, she was forced to repeat her hard-learned Joraga fasting mantras to survive. During this time, Sorin finally told Nissa the nature of their mission as well as admitted to being a walker much like her. Sorin told her that the great gods of the past, and the progenitors of the brood, the Eldrazi Titans were bound beneath Tal Terig long ago, and it was his mission to make sure they stay that way. The next morning, they approached the beaches of Akoum. Nissa Revane It was a hazardous landing as the compatriots were to learn. The bays of Akoum were littered with shipwrecks and crystal reefs, but the greatest threat came from the Moon Kraken that ruled those waters. Brinelin demanded tribute from their boat, and Sorin casually killed one of the remaining goblins to satisfy the great creature. That tribute was found lacking, and Sorin had to reveal more of his true nature to the creature. Brinelin remembered Sorin and was somewhat terrified to find him returned after so long, but would not let them pass. Since Sorin's intimidation had failed, Nissa gambled that her diplomacy might work. She spoke of Sutina, who had been friends with the Kraken, and told Brinelin of her death. Greatly saddened by the news of his friend's death and discouraged by the return of the brood, Brinelin finally acquiesced to lead them safely through the crystal reefs. The party soon approached Tal Terig, which was surrounded by brood, and found themselves captured by elves Nissa had never seen. They were the keepers of Ora Ondor and planned to sacrifice the group so that their sacred Kolya fruits would grow. In their madness, they had underestimated the brood, and Ora Ondor came under siege by the brood. Nissa and what remained of their party, now greatly diminished to a single goblin who traveled with Smara and the trio, escaped during the confusion and as they fled, Ora Ondor fell. The goblin, whose name was Mudheel agreed to lead them all to the Eye, for his knowledge of Akoum was better than that of Anowon, but without supplies, the group soon fell into dire straits. After finally collapsing in the wastelands, they were saved by a water scout who altruistically shared his spoils with the group. Anowon killed the man with Sorin's permission to satiate his hunger which left Nissa aghast. The small band became aware that they were being followed after this incident, and they were finally ambushed by an army of Nulls under the direction of two vampires later that night. Nissa fell during the combat and awoke as a prisoner of the vampires. They told her that they were hunting the Mortifier , who Nissa mistakenly believed to be Anowon. They carried her for several days, all the while leaving Nissa wondering why they had left her alive before her allies rescued her. When she tried to approach Anowon about what she had learned, he told her that she was mistaken and the true extent of Sorin's nature came to light. Once the group arrived at the Eye of Ugin, Nissa's plans abruptly changed from what Sorin had expected. Instead of helping Sorin reinforce the spell containing the Eldrazi, she shattered the main Hedron and released the enchantment imprisoning the titans. Nissa thought the titans would flee, that they would leave Zendikar far behind them. She was wrong, and Sorin washed his hands of her and the entire plane, choosing to go about his own business once more since Nissa wouldn't heed his instructions. Weeks later, Nissa returned to Bala Ged and appeared before the Joraga Council. She told them of what had transpired and swore to find Sorin, to drag him back to Zendikar to help with the Eldrazi menace. With that declaration, she stepped away from her beloved home and hoped there would be something to save when she returned. Two years after the Eldrazi were freed, the Joraga tribe came under attack from Ulamog and his brood. Nissa had barely survived, a band of humans saving her, apparently the only survivor of the Joraga tribe. The one who found her, a Graypelt member named Hamadi , helped her recover, and through him and his friends, Nissa, despite feeling guilty for causing the Eldrazi disaster, realized that race and tribe no longer were of utmost importance, and her magic was needed to save the Multiverse. Teaming up with Hamadi and several others, she successfully defeated a Pathrazer of Ulamog . Tapping into her roots as an elementalist and druid, she now commanded the lands of the planes to protect the Multiverse from the Eldrazi. Her new status as \" Worldwaker \" is a direct translation from the nickname \" Shaya \" given to her by Hamadi in the Graypelt tongue. One of the Elementals that Nissa was able to summon was different because it did not return to the land after a battle. It became her companion, and she named it \" Ashaya \". If she was the Worldwaker, then it only made sense that the elemental was \"The Awoken World\". Ashaya showed Nissa that she was one with Zendikar. As long as Zendikar was in danger, so too was Nissa. And as long as the world was fighting back, so too would Nissa. It also showed how to see and manipulate the leylines of Zendikar that were connected to the Khalni Heart and use this ultimate power to use the land itself in the attack on the Eldrazi. A vampire arrived to meet Nissa after one of her battles with a brood of Ulamog. The Malakir vampire informed her that Anowon had taught him all about Nissa and planeswalkers and that she was the final hope to preserve Zendikar's legacy. He gave her seeds of Zendikar's most prominent native plants: Kolya, red mangrove, Jaddi, and bloodbriar, the last of which was extinct on the plane due to the destruction of Bala Ged by Ulamog. The vampire beseeched her to take the seeds and plant them on another plane. By doing so she will carry with her the last legacy of their home plane. Before the vampire left he also informed her that Anowon had been missing for some time. With Ulamog successfully enthralling the vampires of Ghet, the Ruin Sage may have also been enthralled. Nissa fighting the Eldrazi After a recent battle with one of Ulamog's broods, trying to save the residents of Fartree Hamlet, Ashaya was ripped apart and Nissa lost her connection to Zendikar. While stumbling around trying to reconnect with the plane, she reached Sea Gate which was almost taken over by the Eldrazi. She was rescued and then assisted several kor and merfolk in fighting more broodspawn but they were nearly killed. They were rescued by Gideon Jura who had arrived to save the merfolk Jori En and bring her to Jace Beleren . She instantly recognized him as a planeswalker and assisted him in fighting through the Eldrazi. She introduced herself to him as they made their way back to their refugee camp while hoping that he might know why Zendikar was silent. However, Gideon, despite being a planeswalker, was not a Druid and as such did not understand her question. As they rested, Nissa continued trying and failing to reconnect with her home. She then decided to travel to the Khalni Heart , a place that Zendikar could have retreated to. Nissa and Ashaya. Nissa traveled into the depths of the devastated continent of Bala Ged and found the Khalni Heart in a Surrakar cave. Through it, she rekindled her connection to the plane—but she also ran afoul of the demon Ob Nixilis , a former Planeswalker who hoped to use the power of the Khalni Heart to reignite his spark. Flush with the elemental power of Zendikar, Nissa bested Ob Nixilis, removed the Khalni Heart to safety, and escaped with the revived Ashaya. They returned just in time at Sea Gate to join Gideon's army in its bid to reconquer the city. Jace soon arrived to teach her, Gideon, and Kiora what he had learned from Ugin . When Ulamog arrived, Gideon and Kiora with their armies attacked it to buy Nissa enough time to unearth several hidden hedrons around Sea Gate. Jace then activated the hedron's magics and trapped Ulamog. Everything looked to be smooth sailing until Ob Nixilis arrived and knocked the hedrons out of alignment to position himself between them. The demon planeswalker absorbed a massive amount of the hedron's magic which reignited his planeswalker's spark and allowed him to escape from Zendikar. Meanwhile, Ulamog was confused, battered, and weakened by the network's activation, still rather immobilized, and appeared on the edge of defeat. Gideon ordered the joint army to attack and he leaped forward to attack the titan. Somehow in this panic, Chandra Nalaar also arrived to help. However, in a final act of spite and vengeance towards Zendikar, Ob Nixilis used his newfound power to coax the second Eldrazi Titan, Kozilek from its hiding spot under the plane's crust. Kozilek's arrival completely scattered the front defensive lines. Nissa spotted the demon gloating and charged toward him in a rage. However, she was not prepared for the assault of Kozilek's reality distortion. As she began to fall unconscious, Nixilis mocked her. The demon stated that if she had left him alone to take Khalni Heart's power he would have left the plane peacefully. Now, he would kill her out of spite. Nixilis mentally dominated some of Kozilek's drones and directed them to slay Nissa. After she fell unconscious, she was rescued by Jace and Gideon, who were both subsequently defeated by Nixilis. Oath of Nissa - “For the life of every plane, I will keep watch.” Nixilis took the three planeswalkers to a cave where he tortured them. Luckily, Chandra Nalaar had arrived on Zendikar, found the trio, and freed them. The four together could finally defeat Nixilis, who retreated and swore that he would travel the multiverse to find a fitting punishment for them. The four planeswalkers realized that they were helpless against large threats on their own, but that they could stand against just about any force in the Multiverse by working together. Thus they swore an oath to stand together and the Gatewatch was created. Seeing that he could not keep his promise to Ugin to neither harm the Eldrazi nor allowing them to escape from Zendikar, Jace decided to slay the Titans with the Gatewatch's and Kiora's help. After consulting with Nissa, he described the Ley Line pattern to her that would bind Kozilek and Ulamog to Zendikar, drawing the bulk of the Titans into the plane so that their energy could be dispersed into Zendikar, killing them in the process. To attract them, the remaining forces of Zendikar's defenders would act as bait. While the plan worked at first, with Gideon keeping the Eldrazi swarms away from the army, Kiora clearing out any other swarms, and Chandra supporting them, once the Eldrazi titans were anchored to Zendikar, their destructive essence threatened to assimilate Zendikar into themselves. Afraid, Kiora tried to persuade Nissa to release the Titans and allow them to flee, but Jace objected. Chandra offered to burn the Titans instead, and after preventing Kiora from attacking Nissa, Jace agreed. The pyromancer then connected with the animist, allowing her to channel her pyromantic magic through Zendikar's Ley Lines directly into the titans. In one brilliant blaze of flame, Ulamog and Kozilek were incinerated and destroyed, leaving only ashes raining from Zendikar's sky. After the defeat of the Eldrazi titans, Nissa planted the seeds of Bala Ged she once had received from the vampire straggler: Jaddi tree, Kolya tree, red mangrove, and bloodbriar. She was sure they would flourish on Tazeem. She wanted to stay on Zendikar to watch over its recovery, but Chandra convinced her that there would be interplanar threats to help the Gatewatch defeat, as well. Nissa and Tamiyo seal Emrakul in Innistrad's Moon. When Jace returned from Innistrad, he brought news about Emrakul, who had been summoned to the plane. Traveling to Innistrad , Nissa tried to communicate with the plane but found it less receptive and more harsh and dark than other planes she had visited. With the Gatewatch assembled, they hoped to contain Emrakul in the same way they did the other titans. However, as the Ley lines were already controlled by the cryptoliths , Nissa could not use the seal that she had used on Zendikar. They decided to try and use two smaller ley lines and link them to Chandra to assault Emrakul. The plan did not work, because the Gatewatch found themselves under constant assault from Emrakul's corrupted minions and Innistrad's ley lines did not obey Nissa in the same way those on Zendikar did. They were saved by Liliana , who arrived with an army of undead that she had raised on the way to Thraben. Despite initial objections from Nissa and Gideon, they came to work together. While under Emrakul's mental assault, Nissa was taken inside the protection of a mental ward created by Jace. Even within, Emrakul's influence reached her through her connection to Innistrad and its Ley Lines, warping the mana she channeled until a glimpse of Jace brought her back to her senses. Once they had regained consciousness, Nissa remarked that Emrakul was too vast to be destroyed like the other two, reminiscing about the time when her spark had ignited. Taking care of the unconscious Liliana, Nissa was asked to combine her powers with that of Tamiyo , placing her sigil on Innistrad's moon and trapping Emrakul inside. Using the few ley lines that had remained uncorrupted, Nissa tried to power the spell but would have failed if not for another spell from Tamiyo. Nissa's sigil was branded on the moon, trapping Emrakul inside. Nissa, Vital Force In the three months that followed, Nissa relocated to Ravnica along with the rest of the Gatewatch, taking up quarters in Jace's home. Nissa felt uneasy on the plane since nature was so far away and its soul was alien to her. She passed her time trying to connect with what little vegetation was present and sparring with Gideon. When the Vedalken Dovin Baan arrived and attempted to hire the Gatewatch as a security force, Nissa mainly kept to herself. A troubled Chandra came to her to seek solace, but left again quickly, much to Nissa's confusion. She then talked with Dovin Baan, who was eager to hear how she had bound the Eldrazi Titans, and told her about the Aether on his plane. When the rest of the Gatewatch discovered that Chandra and Liliana had left for Kaladesh, Nissa volunteered to search for them. She arrived along with Dovin Baan in Ghirapur , exactly at the moment when Head Judge Tezzeret was about to arrest Renegade Prime, Pia Nalaar , in front of Chandra. Nissa fled along with Liliana and Chandra and later berated Liliana for having instigated Chandra's reckless behavior. In the wake of the argument, Liliana left the two by themselves. Chandra and Nissa were found by an old friend of the Nalaar's, the lifecrafter Oviya Pashiri . Pashiri comforted Chandra and told her that they were going to rescue her mother. They went to the party of the aetherborn Yahenni, who was quickly fascinated by Nissa's exoticism. On inquiries about how a city like Ghirapur could be home to an elemental-like being as an Aetherborn, Yahenni retorted that nature was still all around them, even in the city. It just had a form that Nissa had not encountered before. This allowed Nissa to understand Kaladesh's cyclical nature and its connection to the Great Conduit. After interrogating a Consulate officer, Yahenni told the group that Pia was imprisoned in the Dhund. Along with Chandra and Pashiri, Nissa searched in the tunnels beneath the night market in the rumored position of the Dhund. With her aid, they managed to locate the aether pipelines that connected the prison to the rest of the city's infrastructure and found the hidden prison. When they entered it, however, Baral already awaited them, having been warned by Dovin Baan . Baral lured the group into an airtight, enchanted Deadlock Trap , intending to turn Chandra's pyromancy against them by using up the air faster while filling the trap with poisonous gas. Not even the combined power of the two planeswalkers managed to crack the prison. They were freed by the leonin planeswalker Ajani , who had come in search of Oviya Pashiri. The group reunited with the rest of the Gatewatch that had been brought by Liliana. After learning that Pia Nalaar was to be executed in a quicksmithing duel against Tezzeret after the Fair, they infiltrated the arena and attacked the artificer. Tezzeret announced the end of the Inventor's Fair and retreated to a skyship. Discovering that their presence had been used as a distraction to confiscate the inventions displayed at the Fair and to take the inventors prisoner, the Gatewatch swore to uncover what Tezzeret had planned. Supporting the Renegades in their struggle, Nissa managed to bring the Aetherborn Yahenni to support their side. Nissa also came to support Chandra in her confrontation with Baral, who tried to goad her to self-destruction. Using her lessons about calm, she managed to soothe her friend down and then protected her with her elementals. After it was revealed that Bolas was behind the upheaval on Kaladesh, Nissa abstained from deciding the next course of the Gatewatch, given that she had no experience with the Elder Dragon and could not assess his danger. She then attended Yahenni's last party and revealed the existence of the multiverse to the dying creature and how it was all connected via Aether. Later, during a meditation, she saw a glimpse of Yahenni within the Aethersphere of Kaladesh. In Amonkhet Nissa uses blue mana, completing the Kefnet trial. Together with the rest of the Gatewatch, Nissa planeswalked to Amonkhet only to find themselves in a desert. Nissa immediately felt that the plane was sick in some way, with its mana corrupted and death ever-present. As they came under attack by zombies and wurms , Nissa discovered that the living on this plane were cursed to return as undead. After the Gatewatch was saved by Hazoret , they discovered the enclave of Naktamun. Within that place, Nissa was able to contact Amonkhet's soul and learned that it suffered under a terrible curse. Together with Chandra, she walked across the city and discovered Rhonas's Monument . Here, she discovered old monuments and sarcophagi from which Nissa gleaned clues about the time before the God-Pharaoh and his trials. When Gideon arrived to announce that he would compete in the trials , Nissa decided to learn more about that place by entering Kefnet 's temple. Within that temple, Nissa found herself trapped in a trial until she was confronted by an angel she immediately associated with the telepathic voice of Emrakul. Within that trial, she learned not only to trust her instincts but also to utilize her thoughts, making her able to utilize blue mana. With that, she transcended the trial and managed to step above it. There, she witnessed how a dark serpent coiled around the world and infected its stars with darkness, bending them to its will or extinguishing them. Seeing visions of the anointed working in mines to produce a blue mineral , people dying in the sands outside of Naktamun, thousands of worlds connected by the same darkness that had infected the stars, a descending sun disc that joined with another and cracked open, a fizzling torch, a broken clock with a clean face, a mummified head facing backward atop a mummified body, a split tree with its sap oozing into the ground, a shattered shield with its shiny metallic pieces torn and scattered, as well as of blue-covered giants marching through the streets and finally a blinding white light that extinguished a world. Then, she saw the angel again, who asked her if she was a queen or a pawn. Knowing that Emrakul was sealed a world away, she hoped to force the appearance away, but the angel instead advised her to stop being a mere piece on a chessboard and instead become the hand that moved the pieces. Then, Nissa found herself interrupted by the intervention of Kefnet, who was furious that she had made a mockery of his trial. While the god tried to extinguish her, Nissa barely managed to use her newfound understanding of magic to alter the god enough for him to not want to destroy her. Having learned enough, she left the temple. Nissa's Defeat at the hands of Bolas. The Gatewatch discovered that Bolas had been creating an army of Eternals ; highly trained fighting specialists which had been zombified while keeping their skills intact. When they confronted the dragon, they were soundly defeated. Nissa was mentally overwhelmed by Bolas after she found out that he controlled the leylines of the plane. At the last moment she was saved by Gideon and she barely managed to planeswalk away. She arrived at Dominaria , where she confronted Liliana. Angry at her for using them to save her from her past, she became even more infuriated when she learned that another demon the necromancer was indebted to, Belzenlok , was on the plane they had planeswalked to. Believing that the Necromancer was on her way to becoming as much of a threat as Bolas after she had mastered the Chain Veil , Nissa renounced her oath and returned to Zendikar, unwilling to lend further aid to the Gatewatch . Nissa awakens Vitu-Ghazi. Jace returned to Zendikar and attempted to convince Nissa to rejoin the Gatewatch, to no avail. Nonetheless, she ended up being forced to fight alongside her former teammates anyway: she was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . Nissa animated Vitu-Ghazi , the hometree and guildhall of the Selesnya Conclave , to fight the Dreadhorde . She used it to tear down Bolas' statue, greatly boosting the morale of the Ravnican forces. Unfortunately, Bolas responded by bringing his God -Eternals through the Planar Bridge . The undead gods quickly destroyed the great tree, tearing it to pieces. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. Nissa rejoined the Gatewatch at this meeting, renewing her vows. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Kaya , Teyo , Araithia , and Nissa were all sent to persuade the guilds that remained neutral ( Selesnya , Gruul , Golgari , and Rakdos ) to join the fight against Bolas. It was expected that Nissa would be useful in their negotiations with the Selesnyans, but the opposite proved true; they were infuriated with Nissa for inadvertently destroying Vitu-Ghazi, and she was forced to leave. Later, Nissa performed a ritual at the ruins of the Guildpact Chamber: with the help of a representative from each guild, she was able to repair the leylines that empowered the Living Guildpact (which had been disrupted when Bolas destroyed the Guildpact Chamber by opening his portal there). Using a device that Niv-Mizzet had constructed before his death to preserve his consciousness, they were able to resurrect Niv and grant the power of the Living Guildpact to him. Niv came back to life just in time to save the others from the God -Eternal Kefnet : using his newfound power, Niv was able to completely incinerate Kefnet in a torrent of flame, although the strain of channeling enough energy to kill a god caused him to fall unconscious.\nNissa survived the battle and was present during the Planewide Celebration that followed. At that moment, Chandra and Nissa professed their love for each other. Nissa participated in the memorial service for Gideon on Theros . She invited Chandra to come with her to Zendikar, but Chandra's issues had soured their relationship and their goodbye was quite cold. Nissa of Shadowed Boughs . Meeting Nahiri again, Nissa initially decided to cooperate with her, bonding over their roles as guardians of Zendikar. However, Nahiri's desire to stop the Roil , even if it harmed the plants and soul of Zendikar, and her lack of remorse over accidentally killing Nissa's elemental friend prompted the elf to turn against her. Nissa then retreated to Ravnica, seeking Jace's help, but she grew frustrated with his desire to understand Nahiri's artifacts so she decided to make her stand against the Kor planeswalker. All the while she tried to emulate Gideon's example, mourning him and idolizing his assertiveness when it came to decisions. When Jace finally showed up on Zendikar, they teamed up again and followed Nahiri to the Murasa Skyclave . While climbing up to the skyclave on a thorn ladder Jace and Nissa witnessed Akiri falling and Nissa managed to save the Kor warrior. Returning to the ground, they saw Nahiri leaving and Nissa immediately followed to confront the lithomancer. Deep in the Singing City, Nissa found the magical focal point from where Nahiri could channel the Core's energy all over Zendikar through the leylines . Shortly after Nahiri and Jace arrived at the focal point, but they found that Nissa had destroyed it with Ashaya and her other elementals . Nissa didn't appreciate the fact that Jace had teamed up with Nahiri to research the Lithoform Core and he was unable to prevent the following all-out battle. Nissa and her Elementals attacked both Jace and Nahiri. Their force was so overwhelming that they had to retreat into the Singing City. Barricading the entrance, Nahiri began to collect power from the stones. When Jace tried to persuade her to flee to Ravnica with him, she refused. When she tried to remove him from the equation, Jace turned the tables on her and took control of her mind. Taking the Lithoform Core from Nahiri, he tried to find Nissa to tell her that he would take it to Ravnica to study it. Before he could make his argument, he was caught by Ashaya who took the Core and handed it to Nissa herself. Using the power of  the lithoform core, Nissa restores Zendikar . As Nissa held the Core, she found that it was an ancient piece of Zendikar's soul that spoke to her, arguing that she could use it to restore Zendikar to power. When Jace tried to take control of her mind, and Nahiri returned with a vengeance, Nissa used the power. It collided with Nahiri's hedrons in a shower of sparks and energy. The dull roar became a screaming bellow. The light became blinding. The air rushed away. Then there was nothing at all and the Core went quiet and dull in her hands. What she saw made Nissa's breath catch in her throat, and panic rises in her chest. The Singing City was gone. Flattened into dust. So was a large swath of the forest. All were reduced to ash. Across the battlefield, the elementals were lying motionless in the dust. Feeling desperate for a moment, she next felt the Elementals recovering. And so did the soil around her, sprouting new life in increasing abundance. Nissa realized that the Core had served its purpose. It had undone the damage to the plane. Zendikar was healing, turning into something healthier, stronger than it was before the battle with the Eldrazi. Though the scars were still there, they were memories now, not their defining features. Nissa called up her vines and grinned as they grew and twirled underneath her, raising her in the air. She turned east, and moving as quickly as the wind, she followed the leylines of the land, flying through the forest, toward Bala Ged, to home. She spent months afterward on Zendikar, ignoring the problems of the Multiverse to focus on helping the citizens of her home plane. Chandra traveled to Zendikar to inform Nissa of the Gatewatch's plans for defense against the New Phyrexian threat. After discussing the threat on Ravnica, Nissa agreed to help in the fight, and both traveled to Dominaria. Compleated. After some soul searching, Nissa joined the planeswalker strike force to attack New Phyrexia, However, as soon as she arrived on that plane, a trap shunted her away — as if she had somehow been forced to planeswalk again. She ended up in the Hunter Maze where she was attacked by a Phyrexian monstrosity and saved by Lukka . The Wanderer provided some assistance before forcibly planeswalking away. A compleated Nissa being used by Elesh Norn to control Realmbreaker. The Wanderer revealed she knew where Vorinclex was and suggested that they should eliminate him while they had the chance. Nissa dueled Vorinclex while Lukka dueled Glissa, but while she managed to wound the praetor, Lukka had compleated himself and Nissa fled, hunted by the other planeswalker. When the other members of the planeswalker strike force failed to destroy Realmbreaker with the Sylex , Elesh Norn revealed that Nissa had been caught and compleated . She now walked on a forest of whip-thin cabling, using the root-link formations of her lower body like tentacles. Extra appendages sprouted from woody protrusions covering her flesh including her staff now grafted as her back right arm, and her face was marked with glistening oil . Given the Mirran intelligence on Realmbreaker at the beginning of the assault, it's implied the compleated Nissa may have accelerated Realmbreaker to its full capacity. Norn revealed Nissa's compleation to the three remaining planeswalkers at the Seedcore before initiating the invasion of the Multiverse . Deeply attuned to Realmbreaker , the Invasion Tree, Nissa was able to steer the tree and open viewing portals or omenpaths at will. When Chandra, Wrenn and Seven arrived to stage another attack on Realmbreaker, it was Nissa who stopped them and tore Seven apart limb from limb. In the final fight of the invasion, Nissa was knocked out by Elspeth and brought to Zhalfir by Chandra. There, Koth , Karn , and the Zhalfirin healers removed as much of the Phyrexian metal from her body as they could. Using a specialized magic ritual , Teferi, Karn, and Melira restored her body and revived her damaged spark. Nonetheless, Nissa's spark faded in the following days as part of the Great Pruning . Though Chandra retained her spark, the two chose to travel together through the Omenpaths in search of Nissa's home on Zendikar. Nissa made her debut in the Xbox 360 game Duels of the Planeswalkers , though Nissa's art, by Jaime Jones , was slightly altered for Duels' packaging and marketing, because the Entertainment Software Rating Board (ESRB) rejected the original art for use on packaging. They felt her outfit was a bit too revealing. Nissa appears in the trailer for ManaStrike . The Stem Sword. Although an animist, Nissa carries a powerful gnarled wooden staff that increases her powers. The staff stands taller than her head, with a tip spiraling into a helix of four intricate arms. The Stem Sword is a concealed weapon hidden within the staff. It is a thin blade with a sharp point, a design optimized for stabbing over cutting. It channels mana into the wounds it causes, which can cause vines to sprout from the wounds. The staff was later fused into her skin as a right arm during her Compleation , while the sword became Bitterthorn . The sword and staff were later cleansed of their oil during her un-compleation. The Lithoform Core , an artifact channeling Zendikar's power. Associated cards: Depicted in: Quoted or referred to: Nissa Revane . Planeswalker Biography . Wizards of the Coast. Nissa Revane, New Planeswalker . MTG Salvation . Michael Yichao (July 8, 2015). \" The Art of Nissa \". magicthegathering.com . Wizards of the Coast. Michael Yichao (August 12, 2015). \" Hints of Nissa \". magicthegathering.com . Wizards of the Coast."}