{"text": "O-Kagachi , a.k.a The Great Old Serpent (oh-kah-GAH-chee; Japanese: 大 口縄 ; rōmaji : Ōkagachi ; literally: \"Big-Mouthed Rope\"), was the mightiest of the kami on Kamigawa . O-Kagachi has been variously described as the embodiments of both the Kakuriyo and Utsushiyo, the great kami of all things, the soul of the world , the first kami, the kami of all kami, the ultimate guardian of both realms and the boundary between them, the embodiment of the barrier between the two realms, and the kami of the veil between worlds. O-Kagachi was the Kami of the Barrier that divided the physical world from the spirit world. O-Kagachi's manifest form was that of an immeasurably vast, eight-headed serpent with eyes that blazed like stars. It was the soul of the world, the very first kami, as old as the plane itself. But when Lord Takeshi Konda raided the Spirit World, he tore out O-Kagachi's \"heart,\" its divinity, that which gave it purpose, and used it to bring glory to his own realm. He cast it in the shape of a stone disk and placed it upon a pedestal in his inner chamber. Enraged by the theft of its core and child, That Which Was Taken , O-Kagachi's fury moved the other kami to strike back at the mortal world in an attempt to reclaim it, and thus the Kami War began. O-Kagachi was not seen for the first nineteen years of the war—in fact, very few people on Kamigawa seemed to know of its existence. It first manifested in the material world during the twentieth and final year of the Kami War, and its arrival significantly shifted the tide of the conflict in the kami's favor. Its first appearance resulted in the demise of three-thousand warriors, who had been sent by Lord Konda to rescue Princess Michiko from the hands of the thief Umezawa . When O-Kagachi struck, its jaws ripped upward from the very earth and downward from the sky, devouring Konda's men—as well as a sizeable portion of land—in one bite. It also defeated Hidetsugu's master, the All-Consuming Oni of Chaos easily. This devastating event shocked the mortal world, and the morale of Konda's people instantly dropped. When O-Kagachi manifested a second time, it did so on the plains south of Eiganjo Castle. It slowly began to make its way toward Lord Konda's stronghold, where it knew its scion—its \"daughter\"—was being kept in imprisonment. It rolled across the sky like a storm cloud of vast coils and descended upon the castle. The guardian dragon of Konda's realm, Yosei , the Morning Star, attempted to fight it off, but it was insignificant in the shadow of the Greatest of All Kami. One of O-Kagachi's heads caught Yosei in its jaws and ripped him in half, forcing the dragon to flee, mortally wounded. Meanwhile, Lord Konda awaited the Great Old Serpent in his tower, believing that the power of The Taken One would protect him from O-Kagachi's wrath. But O-Kagachi tore through the defenses of his castle, devouring and crushing the armies that Konda had sent to intercept it. Eiganjo Castle, which had been protected by some of the most powerful spells and enchantments on the plane, was reduced almost completely to ruin. In the midst of the chaos, Toshiro Umezawa , the rogue samurai from Takenuma Swamp, used the power of the Myojin of Night's Reach to teleport through the shadows and into Konda's inner sanctum. He stole the Taken One from the pedestal upon which Konda had kept in for the past twenty years, and fled. When the Taken One disappeared from Eiganjo, O-Kagachi sensed that its presence was gone. The Great Old Serpent retreated to continue its search elsewhere, leaving in its wake the ruins of Konda's kingdom. Attacking the mortal world. When the Taken One was released from its stony prison by Princess Michiko and Toshi Umezawa in Jukai Forest, O-Kagachi instantly flashed into being across the sky, its coils dominating the heavens to every horizon. The Taken One, O-Kagachi's scion and daughter, took the name Kyodai and bound her power with Princess Michiko Konda. In the battle that would decide the outcome of the multi-decade Kami War and, ultimately, the fate of the world itself, Kyodai and Michiko rose to fight O-Kagachi as it struck down at Kyodai, seeking to consume her and make her a part of itself again. But O-Kagachi was no longer the most powerful being on Kamigawa. Though Kyodai seemed insignificant in the shadow of her \"father\", she had once been a part of O-Kagachi, and not just any part—she had been its divinity, the core of its being. Now that she was separate from O-Kagachi and had a form and will of her own, she did not wish to be consumed into the essence of the Great Serpent again. She desired to keep her freedom and individuality and to save the lives of the people who had set her free after twenty years of imprisonment. Sharing her power with Princess Michiko, she confronted her father. With the greatest magic in Kamigawa at their fingertips, Michiko and Kyodai worked together to immobilize O-Kagachi's heads one by one. The battle was long and vicious, but in the end, O-Kagachi succumbed to the divine power that had once been its own greatest strength. When only two of its eight heads remained, the Old Serpent was torn down from the sky, diminished in size by the power of Kyodai and Michiko until it was no bigger than a garden snake. The two women who had brought it down — one the child of a god, the other the daughter of a king — bit off O-Kagachi's remaining heads, then cast the limp body aside. O-Kagachi's role as guardian of the veil between the mortal and spirit realms was assumed by Michiko and Kyodai. The war ended soon after the Serpent's defeat, and, after twenty long years of conflict, the people of Kamigawa were finally able to begin rebuilding their broken world. The death of O-Kagachi caused the barrier between the two realms to break down, thus precipitating the merging of the two realms (Kakuriyo - spirit realm and Utsushiyo - mortal realm). Depicted in: Although in the storyline O-Kagachi is always referred to as a serpent, his card has the types dragon spirit ."}