{"text": "Ob Nixilis (/ɑːb nɪksɪlɪs/ OB niks-ILL-iss ) was a human warlord and tyrant who became a planeswalker when he discovered that he was manipulated by demons to be the sole survivor of a world that only knew war. He became a demon himself after being cursed by the Chain Veil . In New Capenna , he is called The Adversary . He lost his spark in the Great Pruning . While being a brilliant tactician, wizard, and warrior, Ob Nixilis had also studied the history of his world, where society had been destroyed consecutively in cataclysmic and destructive wars only interrupted by mere decades of peace. He came to believe that every society was doomed to collapse at one point and that the only thing that mattered was taking as much for yourself as you could before the collapse occurred. As a result, he resorted to treachery and underhanded tactics without much thought. Due to his curse, he is now a black horned, winged, and tailed demon. In this form, Ob Nixilis wields a form of magic that acts like anti-life magic, contrasting other forms of death magic like necromancy. With it, he can weaken his enemies and erode solid matter, and even consume the life energy of other beings to increase his own power. He also managed to control a few Eldrazi drones, although how exactly isn't clear. Ob Nixilis is primarily black -aligned, and secondary in red mana. As Ob Nixilis planeswalks, he disappears in flame. Before the curse of the Chain Veil . More than 1000 years ago, Ob Nixilis was a warlord on an unnamed plane beset by war. He was outmaneuvered by opposing warlords and stumbled upon an ancient demon summoning chamber.  He sacrificed his last remaining soldiers to bring forth the demons and call for victory, however, the demons saw the true desire in his heart and killed every living thing in his world.  Ob Nixilis's spark ignited while he walked away from his dead plane after he finally realized the futility of life and all his ambitions.  After his ascension, he began conquering other planes. Eventually, he went to Shandalar and acquired the powerful Chain Veil but it cursed him and turned him into a demon. He went to the plane of Zendikar , hoping to use its rich mana to purge the curse and restore his original form. No spark and trapped in Zendikar . Before he knew what was happening, Nahiri , Zendikar's self-appointed protector, intercepted him and fused a small hedron into his forehead. This hedron bound his spark , trapping him on the plane, while also stripping him of what power he still possessed. When he could finally rise from the ground, the bones in his shoulders crumbled. His wings were useless and they fell off a few days later. For trapping him, and most of all, for making him small and weak, he vowed revenge on the plane and its inhabitants. Ob Nixilis studied the hedrons for centuries. He came to know their magic better than anyone, except Nahiri herself. And when a Planeswalker would come to his place, he would make a point of making introductions. There were dozens over the countless years. And sure enough, Jace Beleren finally took his lure. The proud planeswalker struck him down and extracted the hedron to be used in a ritual to save Garruk Wildspeaker. Thus Ob Nixilis regained his strength and could regrow his wings. Still missing his spark, he knew it was in his reach. And that the only cost to regaining it would be the complete obliteration of Zendikar. First, he found the Khalni Heart on Bala Ged and tried to leech its power to reignite his spark with a small hedron network. However, he ran afoul of Nissa Revane who was fighting for Zendikar. Flush with the elemental power of Zendikar , Nissa bested Ob Nixilis, removed the Khalni Heart to safety, and escaped. After recovering from his defeat, Ob Nixilis plotted while attempting to locate where Nissa might have gone. Upon reaching Tazeem , he found that the Battle for Zendikar was in progress. The troops of Gideon Jura were attempting to imprison the titan Ulamog within a hedron network. Ob Nixilis, gleaming with joy, slaughtered a few Kor guards and siphoned the power of the hedrons into himself, reigniting his spark. In one final act of vengeance against Zendikar, he destroyed the hedron network and awoke the slumbering Eldrazi titan Kozilek . Nissa, enraged for his actions at the Khalni Heart and now, attacked him. Despite her fury, Nissa is defeated in short order. Ob Nixilis then mocked her stating that if only she had left him alone to absorb Khalni Heart's power, he would have left Zendikar peacefully. However, now he wanted to crush and burn her world out of pure spite. He then prepared to leave but not before ensuring that no one left Sea Gate alive. He suddenly realized that Jace was attempting to manipulate his mind to get him to want to just leave. Using a pain-inducing spell, he broke the telepath's concentration, but Jace managed to spike his mind with just enough time to prevent Nixilis from taking his head off. However, the demon's glancing blow broke Jace's cheekbone and sent him sprawling. Retaliation of Ob Nixilis Before Nixilis could snap his neck, Gideon arrived and shredded one of the demon's wings. Despite being in pain, he was impressed by Gideon and offered to have a rematch duel at a later date, offering Gideon the choice of what plane to have it on, and what rules to use. Gideon's refusal caused him to comment that the current post-mending planeswalkers are both weaker and less civilized than the pre-mending walkers like himself. Nixilis attempted to kill Gideon but was stunned and delighted at Gideon's invulnerability. As they dueled, Nixilis mocked Gideon by killing several nearby fleeing Zendikari and played mind games, inquiring if Gideon's need to protect Jace was his own feelings, or caused by the telepath's mental manipulation. Nixilis used that moment of doubt to close the gap. Both of them proved very evenly matched as they wrestled, but the demon planeswalker's superior experience won out as he pinned Gideon to the ground. Nixilis then proved that invulnerability was nothing as he proceeded to drown Gideon in the muddy waters at their feet. As Gideon finally went limp, Nixilis mocked him one final time comparing Zendikar's worth to that of the dirty water. Nixilis then took Gideon, Jace, and Nissa prisoner, transported them to a cave, and tortured them. However, Chandra Nalaar showed up and freed her friends. Their concerted attack managed to scare the demon away from Zendikar, although he promised vengeance against the four. Trapped in Ravnica . Ob Nixilis was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . With no affection for either the Gatewatch or Bolas, he sought gratification in random acts of torment against Ravnica's people and animals. He absorbed the souls of the Eternals he killed, fueling his power. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. Despite being loathed by many of the planeswalkers there (including the Gatewatch and Nahiri ), Ob Nixilis attended the meeting, as he was desperate to free himself. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Karn , Ob Nixilis, Dack Fayden , and Samut volunteered to go through Bolas' Planar Bridge to Amonkhet and shut the portal down from the other side, although Nixilis made it clear that he was only helping them because he wanted to escape from Ravnica. While Nixilis and Samut fought off the Eternals, Dack distracted Tezzeret, giving Karn an opening to fly one of Saheeli's explosive micro-drones into the Bridge control mechanism in Tezzeret's chest. The portal collapsed, and the wounded Tezzeret revealed that he was glad they defeated him: he hoped they would succeed at killing Bolas so he could finally be freed from his servitude to the dragon. With that, Tezzeret planeswalked away. By this point, Nixilis had absorbed the souls of thousands of Eternals, greatly increasing his power and causing his body to double in size. After the Bridge's destruction, the remaining Eternals on Amonkhet became inactive, and Nixilis incinerated them en masse. The planeswalkers were then visited by the god Hazoret , who arrived with the rogue planeswalker Sarkhan Vol . The god sought to aid them in their fight against Bolas, but Nixilis was uninterested in their struggle. Refusing to go back to the battle on Ravnica, he planeswalked away to safety. After the War of the Spark ended, Karn suggested that the Immortal Sun might be useful against the threat of Ob Nixilis. To gain power, he attacks the heads of families. Nixilis kills Xander personally. Ob Nixilis wants dominion over others. Before he became a demon, Ob Nixilis was a human warlord obsessed with conquest. In his pursuit of power, he was transformed by the Chain Veil, an ancient magical artifact. Although he initially sought to remove the curse, he eventually embraced his new form and the power it bestowed on him. Ob Nixilis enjoys subjugating others and is a collector of petty servants, hoarding the broken shells of his former foes in servitude to himself. He takes special pleasure in the challenge of breaking or corrupting the strong or noble and bringing them under his dominion. Though he has established domains on many worlds over his long life, he grows bored quickly and the need for fresh conquests drives him to move on. At some point, Ob Nixilis became involved with the demonic gang families of New Capenna and planned to take control over the plane alongside his henchmen. Siphoning members from each of the families with promises of Halo , he activated his agents on the night of the Cabaretti Crescendo , ordering them to attack all five families and leave none of the leadership alive. Nixilis himself travelled to the Maestro Museum, killing the family's leader, Xander , personally. After the Font escaped the Crescendo celebrations with Elspeth Tirel and Vivien Reid , he followed the trio to a Park Heights cathedral. In the ensuing fight, he nearly overcame Tirel before being badly wounded and planeswalking away to safety. Though he returned to New Capenna, Ob Nixilis chose not to participate in the defense of the plane during New Phyrexia's Invasion of the Multiverse , choosing instead to wait the battle out and side with the victor. Losing his spark after the events of New Phyrexia's Invasion of the Multiverse , Nixilis is now stranded on New Capenna, at the mercy of the five families wanting revenge. Associated cards: Depicted in: Quoted or referred to: ↑ Played out in Magic 2015/Duels of the Planeswalkers ."}