{"text": "The cat-headed Oketra was the Amonkhet god of stability, order, and protection. Oketra valued coordinated purpose and cooperative action. Her Trial of Solidarity was the first one undergone by initiates, forcing them to rely on the other members of their crops and stand or fall together. She was an archer with unshakable focus who never missed her mark. Her arrows were made from the light of the Second Sun , and a single wound was enough to take down even the largest desert horror . On Amonkhet, Oketra was the goddess of solidarity. She led many initiates through the first Trial: \"At the beginning of the trial, Oketra shoots a massive arrow to the far side of the chamber. The floor of the monument shifts, creating a treacherous landscape, and all manner of enemies swarm in—viziers, anointed mummies, horned beasts, and even angels. The enemies assault both the initiates and their obelisk. The crop must work together to defend their obelisk and retrieve Oketra’s arrow. They succeed or fail together.\" In the Hour of Promise, Oketra was killed by the Scorpion God . Before or after meeting with the Scorpion God, Oketra used her last remaining bit of strength to heal some of the people caught in the Hour Of Devastation. Oketra was zombified . During the War of the Spark on Ravnica , she reappeared as a God-Eternal in Bolas's army. While under Liliana 's command she took a shot at Gideon with her bow, as he charged at Bolas to deliver the killing blow. However Liliana made her miss, the Divine Arrow impaling Gideon's Pegasus instead, leaving Gideon tumbling through the air. After she repented, Liliana commanded Oketra and Bontu to attack Bolas. As Oketra and Bontu advanced, Nicol Bolas remained confident and defiant but was surprised by Niv-Mizzet who impaled the God-Pharaoh through the back with Hazoret's spear.  Bolas managed to obliterate Oketra, but the distraction gave Bontu the opening to bite Bolas and despark him. Oketra could be inspired by Bastet , the Egyptian goddess of dance, music, protection, family. She could also be inspired by Sekhmet , the lion-headed goddess of war and healing. Bastet was also a lion-faced war deity, but her image changed over time to a more protective cat goddess. Sekhmet had close ties to the sun and so did Bastet before becoming associated with the moon after Greek influence. Another inspiration would be Nebet-Het , a goddess who represents divine assistance and protective tutelage. Associated cards: Depicted in: Quoted or referred to:"}