{"text": "Oko is a fey planeswalker from an unknown plane . He is the father of the half-fae Kellan . Oko is a shapeshifter who is as charismatic as he is conceited, a man who is mysterious, uncommonly clever, and vain. He also has healing and mind-controlling powers. He considers himself pretty and witty and tends to talk too much. He has high cheekbones, pale skin, and pointed ears. His arms are blue as if they had been dipped in woad. His upper face has the same blue tone, giving the appearance of a blue mask across his eyes. His eyes are dark, pensive, and even a little melancholy. Oko's somewhat meager telepathic ability once allowed him to escape his persecutors. The technique to mesmerize someone was used on him long ago before he'd turned the tables on his captors. For this reason, he hates inflicting this on others (although it doesn't stop him from doing it). Oko can shift another person into the same shape as he is taking if he is touching them when he does it. Hating authority, Oko is an iconoclast and a bit of an anarchist. He sees it as his mission to help others — the hapless, the ignorant, the weak, the youthful strivers — to embrace their freedom and to cast off the rules of any government. He also seeks out alleged hypocrisy wherever he finds it. This often leads to quite cruel “pranks.” Ruining a wedding day, stealing the spotlight at someone's lifetime moment of triumph, fooling a mother into believing her child has returned from a conflict – these are all great shapeshifting jokes to Oko who sees nothing as sacred, least of all the noblest of emotions. He usually avoids having to deal with the consequences of his actions by planeswalking away. Oko generally tries to avoid revealing himself to other Planeswalkers, preferring trickery and manipulation to all-out battle. He is almost always mistaken for an elf . Oko has access to green and blue mana . Oko Concept Art Oko is from a plane ruled by Fey who believe in a unified society, one where the ruling class has decided that for the betterment of all, the natural mischievousness of the Fey has to be suppressed. To the ruling class, they had created a perfect society — but for Oko, who was born with incredibly powerful shapeshifting abilities, this culture went against everything he was and contradicted his deepest, truest self. Styling himself as a speaker of truth, Oko felt he held a mirror to the hypocrisy of his world. The ruling class did not quite see it this way. They subjected him to magical procedures intended to suppress his powers but only succeeded in igniting his spark . It was a terrible experience for him and one that would make it almost impossible for him to trust anyone again — especially those in positions of authority. At some point shortly after arriving in Eldraine around 4547 AR , Oko met a hedgewitch's apprentice in a field of nightshade. Over the next few years, the two met regularly in the same location and shared knowledge of their planes. She left her mistress and began learning magic from Oko, and he promised her a throne. She eventually became pregnant with a son, the half-fae Kellan . Upset at the villagers' dislike and mistreatment of his lover, Oko lashed out at them, causing her to leave him. On his return trip years later, he reached out to the woman again, but she chose to remain with her son. Having just returned to Eldraine around 4560 AR , Oko found out that he was stalked by Garruk Wildspeaker . Trapping the brute in a net of thorn-laced vines, he found out that Garruk was a planeswalker hunting his peers, and that he for some reason had a hedron embedded in his flesh. Oko mesmerized Garruk, turning him into a slave bodyguard called Dog . On Eldraine, Oko sought to disrupt the rule of the Realm , and to do so he plotted to eliminate the High King himself. Seeing a chance to destroy the tentative peace between the elves of the Wilds and the five courts of the Realm, he waited for the Grand Procession to take place, a time when the king would travel throughout the Realm to reinforce the peace. While he waited, he came upon Will and Rowan at the Choking Drum, and had Garruk save the duo from a horde of redcaps . Quickly he used his charms to gain the favor of Rowan, while her brother remained cautious and suspicious of the man. Traveling with the duo, he had Garruk await in the forest as they arrived at Beckborough and they split ways. At some point he took the form of the knight Cado , and slipped into the Grand Procession, giving the twins a wink that bewitched them and made them forget their encounter with him. Having Garruk kill the king's guards, he kidnaps the man and fled into the wilds. Oko, Thief of Crowns Over the following months, he tried to gain the favor of those who were the least secure in times of peace. Queen Ayara , an elf, was his primary target, and he attempted to spark the animosity that much of her race held towards humans, but the woman thought him suspect. As midwinter came around he retreated to the Wilds and tried to meet the Council of Druids to further his plans, however, Queen Ayara herself met with them, warning them against the stranger. Oko, however, had another plan in motion; he had transformed the High King into a stag and had magically put it to sleep, to awaken on that morning with the rising sun. Awaiting within his faerie circle on a makeshift throne he awaited Garruk to find the stag so he could guide the Wild Hunt to it that night. As he awaited he was surprised to see the Kenrith twins walk into his circle, where his glamour on them faded and their old memories returned. Oko played upon their naivete, mainly Rowan's, to learn of their vision within the mirror , until Cado and the loremage Elowen stumbled into the circle. Elowen quickly deduced he was not of Locthwain as he claimed, for he did not wear their emblem and his ploy to get them to eat within the circle was obvious. A scuffle broke out and Oko turned himself and Elowen into eagles before he reverted to his true form, the transformed mage flying away. As Garruk arrived with the healer Cerise, her unicorn , and the stag, Oko revealed his plans and created a dome of thorns to bind the adventurers as he walked away with the stag they had sought. Later, the twins came upon him again as he guided the Wild Hunt after the creature, however, he evaded them by releasing a small swarm of faeries . As the stag was cornered, Oko watched from a tree in the form of a raven. As a fight broke out between the gathered knights and the elves, he took the form of Queen Ayara (who had hidden near the back of the gathering to not be seen) and shot the stag in the chest with an arrow. He was almost struck down that instant by Garruk who ambushed him from behind, but he took the form of a raven once more to avoid his axe and took to the air, taking the form of a drake as griffins tried to stop him. Avoiding Garruk once more, he accidentally flew into the electrified ice of the twins and was quickly pinned to the ground. As Garruk moved to kill him, Rowan forbade it, which Oko thanked the girl for. Too quickly for the twins to comprehend, he shifted form into a drake once more, then a raven, a crested eagle, then an antler before dissolving into golden sparks, planeswalking away to parts unknown. At some point, Oko arrived on the plane of Thunder Junction , where he would be joined by some of the most famous villains of the Multiverse. Oko's character is loosely based on the Shakespearean character of Puck . In the video game Magic: The Gathering Arena , Oko is voiced by Usman Ally . Associated cards: Quoted or referred to:"}