{"text": "Old Stickfingers is a horror from Innistrad . It is an ancient creature thousands of years old, with thousands of names like Aval, the Vine Lord of the Hearth , Macath , and The Destroyer . Old Stickfingers is considered a \" hearth spirit \", an entity summoned to protect a certain area (a property or a house, for example). He is summoned through a ritual using a wooden mobile and \"sacrifice\" from an animal (where the animal must be delivered to him). Thin as an alder, taller than a man, skin stretched tight against small bones, fingers like twigs. A creature of nightmare, of every child's imagination. At his feet, everywhere he stepped, hoarfrost bloomed and mushrooms grew. His face was more deer skull than human flesh, embers dripped from his jaws like blood, and he had more antlers than any natural beast of any natural forest.  He had too many eyes. Every moment, the number seemed to change, and each glowed with pale green fire, and each one was watching you. He was there and he wasn't there, you could look right at him and be sure he was creeping up on you. He has super strength and affinity with animals, being able to bark like deer and dogs, and his blood is white. An interesting fact about Old Stickfingers is that he is right behind you. Old Stickfingers was invoked by Arinos to protect the farmer's property. But the ritual was not completed properly, causing Old Stickfingers to kill several people across the village of Lambholt . The cathar Rem Karolus and the archmage Vadrik were called in to investigate the mysterious deaths. After investigating, Vadrik, together with Arinos' daughter, Ariosa , managed to contain Old Stickfingers by completing the ritual. Looking back on the events, Vadrik had a hunch that Arianos wasn't killed by Old Stickfingers but may rather have been possessed by him. Ariosa adds the line: \" Every time you break my skin, I will break another man .\" She summons Old Stickfingers with the rhyme, \" Tall man, long man, will you guard this home? Protect the one who calls, who dwells here all alone? Old Stickfingers, of the alders, take this goat in lieu of me. Aval vine lord, old destroyer, harm you none without my plea. \" Later, another variation of the rhyme is given:"}