{"text": "Olivia Voldaren is a vampire native from Innistrad and the progenitor of the Voldaren bloodline. In life, she had been described as a beautiful yet strange, hermetic, and antisocial woman who preferred to live far away from human civilization, in manor homes built for her from her seemingly boundless wealth. Like her, Voldaren vampires tend to live in distant places, such as the borderlands and edges of Innistrad's provinces. Olivia travels often, visiting the far-flung Voldaren manors and fortresses that are scattered across the four provinces of Innistrad. The elite among vampires know that Olivia throws the best parties, and the nobility will happily make the trek out to the estate for her seasonal ball. She is a famous eccentric and bon vivant. She appears to have developed the ability to fly and has a keen interest in watching Cathars lose their faith right before their demise. Olivia was sought out by resident planeswalker Sorin Markov to help him in his quarrel with Nahiri . In exchange for Olivia's services, however, Olivia requested that Sorin kill his beloved angel Avacyn . After this wish was fulfilled, Sorin and Olivia assembled a vampire army and went to war against Nahiri. During the war against Nahiri, Olivia was seen leading her own host of vampires against Nahiri's cultists. When Nahiri finally confronted Sorin on the battlefield, Olivia intervened - telling Nahiri that despite how much Sorin deserves what is happening and how much she would love to allow Nahiri's vengeance, Sorin enlisted her help and she cannot allow Nahiri's revenge. Nahiri then summoned a swarm of Eldrazi fiends to occupy Olivia and her vampires while she dueled Sorin. After Sorin was defeated and encased in stone by Nahiri, Olivia proclaimed herself the new lord of Innistrad and took his sword from him. After leaving Sorin for dead, Olivia and her vampire army headed to Thraben where the residents of Innistrad were preparing to make their last stand. When Thalia and her fleet arrived the two agreed to a temporary truce so they could work alongside one another to purge Thraben of the monsters trying to overtake it. While battling inside Thraben, Olivia killed Seeta - the Leader of the Sinpurged, right in front of Thalia. Olivia interrupts the ritual. Olivia was informed about the Harvesttide festival and the actions of Arlinn Kord to halt the Eternal night , but chose not to interfere. She was confident that her preferred outcome would be realized anyway and that you should 'never interrupt someone doing your work for you'. As the Harvesttide festival was reaching its conclusion, Olivia swept down from the skies and held Katilda hostage, demanding the Moonsilver Key from the assembled party. Arlinn agreed, and when Olivia had possession of the key, she hurled Katilda towards the ground, injuring both when Arlinn attempted to catch her. With her plans successful, Olivia left the ruined festival. The veil of her wedding dress is made from the souls of her victims. The vampires of Innistrad united for an ultra-exclusive wedding and reception everyone was dying to attend, where Olivia planned to marry Edgar Markov . She aimed to form a pact with the Markovs to take control over Innistrad and its vampires families. For this she planned to use Sigarda 's blood and the powers of the Moonsilver Key in order to control Innistrad's angels . After stealing the Key, she captured Sigarda sometime after the archangel's fight against Sorin Markov . But to carry out her plans she needed Edgar's sangromancy powers. Olivia used her own blood to wake Edgar from his sleep and in doing so managed to charm him. In his confused state, the elder vampire agreed to marry her. During the exchange of vows between Olivia and Edgar, Sorin attacked Olivia and at the same moment Katilda 's spirit manifested by coming out of the Key. Katilda used her powers to free Sigarda from her prison. Being free Sigarda exploded her angelic aura in fury causing the surrounding stained glass to shatter, hurting or killing many wedding guests. Olivia and Edgar were not severely injured. Sigarda's outburst lowered the wards around Voldaren Manor, allowing the Gatewatch to begin their raid. While initially belligerent towards the intruders, Kaya breaking Olivia's hold on her train of geists was enough to make her flee, pursued by Arlinn Kord . Ostensibly cornered, Olivia was beset by Arlinn who was searching for the Key, but was able to impale Arlinn with her hand after Arlinn lost control of her werewolf form. With the Moonsilver Key in hand, Olivia fled and was later found by Edgar who pleaded with her to end their plans. They were discovered by Arlinn and her packmates, including Tovolar who was held back from attacking Edgar by Arlinn. Olivia dropped the Moonsilver Key in defeat and escaped with Edgar through one of the broken windows. Olivia is the primary antagonist of the trailer for Innistrad: Crimson Vow . Associated cards: Depicted in: Quoted or referred to: Magic Creative Team (November 02, 2011). \" A Planeswalker's Guide to Innistrad: Stensia and Vampires \". magicthegathering.com . Wizards of the Coast. Monty Ashley (September 28, 2011). \" The Vampire's Back \". magicthegathering.com . Wizards of the Coast. Mark Rosewater (February 16, 2015). \" Kings & Things \". magicthegathering.com . Wizards of the Coast. Luis Scott-Vargas (March 16, 2016). \" Olivia, Mobilized for War \". magicthegathering.com . Wizards of the Coast."}