{"text": "Omenpaths are planar portals originally created by Kaldheim 's World Tree and later by New Phyrexia 's Invasion Tree . After New Phyrexia's Invasion of the Multiverse and the Desparkening , these passages are now the main way to travel between planes . Omenpaths can vary in appearance. Some can be tiny, some huge. Some permanent, some temporary. Some stable, some moving. They present a great risk for non-planeswalkers, as there's no promise of a way back. Not every plane is connected to every other plane, so some trips can be quite a journey. Some could be one-way. Nissa described an Omenpath as a glowing blue light hovering in the air and pulsing to the beat of the leyline song. Its edges resemble ragged cloth as if someone cut the fabric of reality. Kellan described one as a swirling series of interlocking triangles, something like a cloudy mirror, standing free. On Kaldheim denizens of one realm could always cross the dangerous Cosmos and enter another realm. As realms shifted on the World Tree , Omenpaths sometimes opened between realms. Inhabitants of one realm could use an Omenpath to reach another one. Sometimes this was as simple as walking through a shimmering light on the landscape, but other Omenpaths were more treacherous and involved crawling through shifting tunnels and being deposited unexpectedly on the mountaintop of an unfamiliar realm. Once an Omenpath between realms had opened, some powerful mages could close and reopen them at will. The opening of an Omenpath often was a precursor to the two realms overlapping in a violent Doomskar . Because of the Cosmos Elixir that makes the gods what they are, the gods of Kaldheim were immune to the disorienting effects of the Cosmos and could cross between the realms more easily than other races. Shapeshifters' ability to change form and the Omenseekers ' rune-enhanced longboats also enabled passage between realms. On the other hand, a Planeswalker 's ability to travel to other planes could not be used to traverse the Cosmos, with Kaya requiring Cosima 's longboat and Tibalt using the Sword of the Realms . During New Phyrexia's Invasion of the Multiverse , the Phyrexians created Omenpaths with Realmbreaker to transport their troops in seedpods. The Angels of New Capenna traveled through these Omenpaths to aid other planes. After the Invasion, these new Omenpaths have become a lasting Multiversal phenomenon. While Kaldheim 's omenpaths were round, those after New Phyrexia's Invasion of the Multiverse are triangle-shaped. This shape was chosen because it is the \"strongest shape\" and the omenpaths are meant to \"hold the weight of the multiverse.\" The \" Omenpath Arc ,\" beginning with Wilds of Eldraine , is the first part of a three-year Magic story arc following the Phyrexian Arc . Depicted in: Referred to:"}