{"text": "The Order of the Ebon Hand was a religious sect in Sarpadia founded by Tourach the Dark One . The Order of the Ebon Hand worshipped the Ebon Praetor and later Tourach himself, who was deified after his death. The Order was one of the few places on Sarpadia that welcomed humans and non-humans in the same place. The Order of the Ebon Hand was at war with Icatia , specifically the Order of Leitbur . Much of the origin of the Ebon Hand is forgotten, but it seems to have been originally started as a cult that worshipped Gix . There are several parallels between the Demon , the Hand of Gix , and the Praetor as well as the Order itself. Most prominent is that members of the Order upon joining sever one of their hands. There are even mentions of there being a link between the Order and their sworn enemy the Order of Lietbur. In spite of these similarities, the Ebon Hand was a staunch opponent of Phyrexia and its cults. Endrek Sahr , a prominent Wizard in the Order, created Thrulls to serve them as slaves and ritual sacrifices. Created through a mix of necromancy and alchemy, they proved invaluable resources and were experimented on further. Eventually, they would be created as a replacement source for armor, expendable soldiers and ritual assistants. Endrek Sahr eventually traveled to the future through a time rift, but little is mentioned of this and its impact on his work as he was ordered executed for the creation of the Derelor which drained Order resources. A time rift seemed to be the only reprieve for Endrek Sahr as he disappeared into the future seemingly escaping his death sentence. Vaylesh , a priestess of the Order of the Ebon Hand, captured Tymolin Loneglade and lured Oliver Farrel to her and other Ebon Hand warriors. The entire plot was an attempt to lure the Farrelite out of the shadows into open combat. When Farrel killed Tym, the planeswalker Tev Loneglade killed all the troops present with a massive Fireball . Tev Loneglade then seemed to forsake all humanity and transformed into Tevesh Szat and began to incite the entire continent into full-fledged warfare. A combination of the intelligence of Thrull Wizards and the brawn of Thrull Champions led to the spark of the Thrull Rebellion. Without Endrek Sahr there to aid against his creations, Jherana Rure led a military resistance against the Thrulls. Necrites eventually assassinated Rure and ended the resistance in a single blow. They continued on to overrun the entire continent and nothing further was heard about the Ebon Hand, apart from the fact that Belzenlok claimed to be its Master. Tourach - Founder, Deity Thurzen Klathe - Lord High Priest Vaylesh - High Priestess Endrek Sahr - Master Breeder Jherana Rure - Thrull Rebellion Counter-Insurgency Commander Ivra Jursdotter - Mercenary Associated cards: Referred to:"}