{"text": "The Oriq is a secret society of mages on Arcavios who use magics \"forbidden by the colleges of Strixhaven ,\" and are obsessed with power at any cost. The Oriq are mostly mages who couldn't pass the entrance exam of Strixhaven or drop-outs. They argue that Strixhaven is controlling access to magic on Arcavios and that the world would be better off without it. If they destroy the university, anyone anywhere in the world can practice magic. The Oriq are usually dressed in dark clothes, with metal masks hovering where their faces should be. One of their most powerful tools is the Mage Hunter , a vile monstrosity created to seek out and snuff out the arcane. The Oriq reside far from Strixhaven but often infiltrate the university looking for spells and recruits for their dark schemes. Oriq agents use deception, stealth, and their darkly powerful brand of magic in pursuit of their sinister goals. Duels to the death, stealthy assassinations, infiltrating institutions full of mages, and blood rituals, the Oriq agenda is dangerous and taxing, so the organization frequently needs new members. Oriq agents actively seek out and recruit promising mages, and one of their favorite hunting grounds is Strixhaven. An Oriq agent will frequently reach out to powerful but underperforming mages or students who have fallen through the cracks of the institution, using illusion magic and subterfuge to hide their Oriq identity. A student doesn't typically know they're being groomed for Oriq recruitment, they only see that they're being invited to an exclusive engagement by an alluring and complimentary stranger. And then when the mage is at their most vulnerable, they are offered the mask. Rumors abounded at Strixhaven University that the Oriq are threatening the school grounds. Professor Onyx witnessed an Oriq agent looting the Biblioplex, but the rest of the Faculty doesn't pay much attention to her warnings. Meanwhile, the planeswalker Lukka had become interested in their activities and sought contact. Lukka was captured and taken to the leader of the Oriq , who Lukka discovered knew planeswalkers and the Multiverse . The Oriq leader offered up that there were things he could teach Lukka and proposed a trade. Lukka helped the Oriq by distracting Kasmina and coordinating a Mage Hunter attack on Strixhaven. Professors Onyx, Kianne and Imbraham rallied and protected the students, and the Founder Dragons also joined the fight, but they were unable to prevent Extus Narr from reaching the Hall of Oracles and finding the books that he needed to start the ritual of resurrecting the Blood Avatar . On her way to the Hall of Oracles, Onyx was joined by Will and Rowan Kenrith . Associated cards: Depicted in: Referred to:"}