{"text": "Park Heights was the top tier of the metropolis of New Capenna , situated above the Mezzio . It was the primary home of the Brokers . Park Heights was the airy uppermost borough of New Capenna where buildings glittered in chrome, gold, glass, and steel, scraping the sky and arcing above the clouds. There was nothing above Park Heights but the celestial arc of stars. The least densely populated borough of the city, Park Heights hosted the homes and headquarters of New Capenna's bosses, owners, and titans of industry. Opera houses, orchestra halls, members-only clubs, venues, shops, parks, estates, and gardens could all be found in Park Heights as well: anything exclusive, anything opulent, anything that citizens of the Caldaia and Mezzio think frivolous—but secretly desire—one could find in this borough of the city. It was a beautiful place, with rolling green parks, trees, public terraced gardens, aeries, waterscapes, fauna, and terraced gardens and the only borough where one could look up and see nothing but sky. During New Phyrexia's Invasion of the Multiverse , the Capennan resistance collapsed Park Heights on Atraxa , killing her but destroying the borough. The Cloud Spire The Cloud Spire - A seemingly inaccessible skyscraper that served as the main Obscura stronghold and sanctum of the family's boss, Raffine . In its uppermost observation decks, Raffine kept her office amidst the Obscura's most sensitive, powerful instruments of augury and surveillance: the air itself was full of whispers and ghostly images, a real-time feed of the city fed to Raffine by her field agents. The Interfactorium - Contained in the lower levels of the Cloud Spire, where Obscura agents plotted and schemed using scale maps of the entire city and a temporal-prophetic library of histories and potential futures. Crossponte Bridge Station - A train station connecting to Cloudponte Bridge in the Mezzio. Falco 's penthouse . Ferara Park - The central feature of Park Heights, and the park that gave the borough its name. The city fathers commissioned landscape here that emulated the elysian acres of Old Capenna , including a kraken they imported and installed in the park's central lake. Grand Capenna Hall The Grand Opera House Mergino Fountain - A calm area of the city with orderly rows of palm-leaved bushes and winged architecture. Museum of Old Capenna - Headquarters of the Maestros and the family's boss, Anhelo , who served as its chief curator. Halo smoking was not allowed inside the building. It contained a vast library holding a million volumes on display, as well as miles of hidden passages beneath. At the museum, one could wander through the warm, clean halls of New Capenna's history, viewing art, sculptures, and artifacts from the Kingdom Era, the city's early history, and even some contemporary pieces. It was obliterated by Atraxa during New Phyrexia's Invasion of the Multiverse and reduced to rubble. The Shadow Hostel - An opulent safehouse containing Xander's Lounge , where assassins gathered to trade secrets and contracts. Xander's Vault - Xander's private collection of artifacts, weapons, mementos, and art from before the city's founding. Upper Bridge Plaza Herculaneum Candy Shop - A candy shop owned by the devil Henzie Torre . It sold stained-glass and beetle-shell sugar candy, twizzle sticks, Halo-infused lollipops, and bittersweet horehound candy drops. Two blocks from Crossponte Bridge Station, it was popular among visitors from the Mezzio. Referred to: Park Heights' design is based on 1920's Hollywood."}