{"text": "Consul Pia Nalaar is the mother of Chandra Nalaar and was the wife of Kiran Nalaar . She was the leader of the Renegades in Ghirapur , Kaladesh , earning her the moniker Renegade Prime , and now serves as the city's Consul of Revival. Pia Nalaar is a middle-aged female human with dark hair. Pia and Kiran Nalaar Pia and Kiran Nalaar were inventors, who secretly trafficked a controlled substance, the mystical aether , to those who needed it. When they discovered that their daughter was a fire mage, they fled Ghirapur to escape the Consulate forces that would try to eliminate what they perceived to be a threat. After their hiding place — the village of Burarat — was burned down by the troops of Captain Baral , Kiran was killed, Chandra was taken away to be executed and Pia was jailed. In her cell, Pia was often visited by Baral, who delighted in reminding her what she had lost. As a consequence, Pia went from an optimistic young inventor to an impassioned revolutionary, vowing to challenge the Consulate and steer it away from tyranny and oppression. It is unknown how Pia escaped. Mother and daughter reunite after years According to the Consulate, Pia has a troubling public record, including malicious modification of devices, embezzlement of Consulate resources, and over a dozen counts of aether siphoning. Her appearance at the Inventors' Fair coincided with reports of renegade demonstrations. She was held responsible for organizing these dangerous displays. Pia had to face a formidable opponent when Head Judge Tezzeret managed to locate her. At the same moment her daughter Chandra, who she had presumed to be dead, showed up with her friend Liliana . When head inspector Dovin Baan also arrived, sending gearhulks against her daughter to restrict her, Pia willingly turned herself into custody again. Tezzeret set up a quicksmithing duel between himself and Pia, as the culmination of the fair. In reality, this was meant as bait for Chandra and her friends, and a distraction from his theft of the winning inventions and the abduction of the inventors. Pia came away unharmed. She visited Gonti , who promised aid in taking the central Aether hub of the city in exchange for services rendered later. After altering Gonti's hidden cache of artifacts into weapons, the renegades attacked the Aether Hub . The personnel of the hub yielded when faced with the superior numbers. After the successful revolution, Pia Nalaar became the new consul of Allocation. She met Chandra for monthly tea appointments to catch up. Consul and Mother The planeswalker Tibalt intruded into Pia's home and tortured her, as a way to feed on Chandra's agony. Pia testified to the Consulate about the impending interplanar invasion if the strike force failed, which came to pass four days after. While most of the city of Ghirapur was evacuated, Pia and the artisans worked to defend the aetherflux reservoir, which if breached would destroy the city. Several days into the defense, Pia rendezvoused with Saheeli, who confirmed that the reservoir was drawing the interest of the Phyrexian forces. Pia swore to keep Kaladesh safe for Chandra's return. Associated cards: Depicted in: Quoted or referred to:"}