{"text": "Planeswalker Lore List of planeswalkers Igniting Colorshifts By format Trivia Planeswalker card: 1) card name , 2) mana cost , 3) type line , 4) Loyalty ability , 5) Ultimate ability, 6) starting loyalty In the storyline of Magic: The Gathering , planeswalkers are among the most powerful beings in the multiverse . Within the game, they represent the thematic identities of the players . Planeswalker is also a card type within the game. As part of the lore of the game, each player is meant to be a planeswalker, which has been a part of the lore and marketing since the Alpha rule book. This is in spite of the radical changes of the nature of planeswalkers that have occurred throughout the series. The lore behind what the \"planeswalker\" type means has changed as the rules around them vary, but it has been somewhere between \"calling in a favor\" - which reflects the loyalty - and some form of time manipulation - to justify deceased characters and multiple selves. In terms of the rules engine, however, players are not related to the type \"planeswalker\" for the purposes of targeting. Attempts to retain flavorful rules quirks (planeswalker redirection, type-line uniqueness) have been revoked in favor of more practical gameplay. Original Future Sight playtest card for Garruk . Planeswalker card types were introduced in Lorwyn . Like the player, a planeswalker card represents a powerful being that is able to move from plane to plane. Planeswalkers borrowed their \"attack me to lower my loyalty\" mechanic from something called structures that Richard Garfield made for Ravnica: City of Guilds , but never had been used. An earlier design for planeswalkers, meant to be introduced in Future Sight would later inspire the design of Sagas . Planeswalkers have an intrinsic ability to enter the battlefield with a set number of loyalty counters, printed in the lower right of the card. A planeswalker can be attacked, like a player, or be damaged by an opponent's spell or ability. Any damage dealt to planeswalkers removes that many loyalty counters and a planeswalker with no loyalty counters is put into the graveyard. Changing the card type to another will remove this vulnerability. Much of the development revolves around the fact the strongest answer to a planeswalker is being attacked by a board of creatures, and the turnwise advantage engine makes it prized against all archetypes. Planeswalkers usually have three abilities: one ability that adds loyalty counters as a cost for a small benefit, one that removes a small number of counters as a cost for a larger effect, and one that removes a large number of loyalty counters for a big effect. The last effect is commonly referred to as the planeswalker's \" ultimate \" ability and usually leaves the opponent in a devastated state. The starting loyalty of a planeswalker is commonly significantly lower than the cost of its ultimate and a player has to build up the loyalty to access it. Unlike most other cards in a set, planeswalkers are designed by the people who work on Standard (currently the Play Design team; formerly the development team, with contributions from people who played in the Future Future League ). Due to Mythic exclusivity, storyline relevance and recency bias, planeswalkers that overshot on power level are often greatly maligned. Until War of the Spark , all planeswalkers had been printed with the mythic rare rarity, except for Ajani Goldmane , Jace Beleren , Liliana Vess , Chandra Nalaar , and Garruk Wildspeaker , which debuted in the Lorwyn block when the mythic rare rarity did not yet exist. War of the Spark featured rare and even uncommon planeswalkers. All planeswalkers in the set have a static or triggered ability . In addition, the uncommon planeswalkers have only a minus loyalty ability (no plus abilities), the rare planeswalkers have a plus and a minus loyalty ability, and the mythic rare planeswalkers have the usual three loyalty abilities. By the time of Zendikar Rising , Planeswalkers could be released with set-specific mechanics (something which was previously avoided). Kamigawa: Neon Dynasty introduced the first planeswalker-exclusive keyword in Compleated . Phyrexia: All Will Be One introduced Ichormoon Gauntlet , the first card to grant non-copied loyalty abilities to planeswalkers. March of the Machine ' s Commander release printed a cycle of \"Talents\", which are the first Auras to specifically enchant planeswalkers, and also grant them a new loyalty ability. Starting with Wilds of Eldraine , the number of Planeswalker cards was scaled back to one per premier set. This decision was both story-driven and play-design-driven. Planeswalker symbol The handprint-like planeswalker symbol symbolizes planeswalkers and their ability to traverse the planes of the Multiverse . It is, for example, used to planeswalk in the Planechase format, as part of the Masters 25 expansion symbol , and hidden in card art (e.g., Barren Glory and Omniscience ). It seems to refer to the different paths or planes that a planeswalker can choose to walk. Specifically: five choices, as in the five colors of Magic . On the other hand, Mark Rosewater has said that it also has a “five becoming one” aspect, to match Magic's ethos of the colors working together. The latter could also mean there is a connection to the Lorwyn Five or the Gatewatch . There used to be a symbol designed for planeswalkers in Future Sight , but it was not used when the introduction of planeswalkers was moved to Lorwyn . This was different from the current planeswalker symbol. From the glossary of the Comprehensive Rules (September 1, 2023— Wilds of Eldraine ) Planeswalker A card type. A planeswalker is a permanent. See rule 306, “Planeswalkers.” From the Comprehensive Rules (September 1, 2023— Wilds of Eldraine ) 306. Planeswalkers 306.1. A player who has priority may cast a planeswalker card from their hand during a main phase of their turn when the stack is empty. Casting a planeswalker as a spell uses the stack. (See rule 601, “Casting Spells.”) 306.2. When a planeswalker spell resolves, its controller puts it onto the battlefield under their control. 306.3. Planeswalker subtypes are always a single word and are listed after a long dash: “Planeswalker — Jace.” Each word after the dash is a separate subtype. Planeswalker subtypes are also called planeswalker types. Planeswalkers may have multiple subtypes. See rule 205.3j for the complete list of planeswalker types. 306.4. Previously, planeswalkers were subject to a “planeswalker uniqueness rule” that stopped a player from controlling two planeswalkers of the same planeswalker type. This rule has been removed and planeswalker cards printed before this change have received errata in the Oracle card reference to have the legendary supertype. Like other legendary permanents, they are subject to the “legend rule” (see rule 704.5j). 306.5. Loyalty is a characteristic only planeswalkers have. 306.5a The loyalty of a planeswalker card not on the battlefield is equal to the number printed in its lower right corner. 306.5b A planeswalker has the intrinsic ability “This permanent enters the battlefield with a number of loyalty counters on it equal to its printed loyalty number.” This ability creates a replacement effect (see rule 614.1c). 306.5c The loyalty of a planeswalker on the battlefield is equal to the number of loyalty counters on it. 306.5d Each planeswalker has a number of loyalty abilities, which are activated abilities with loyalty symbols in their costs. Loyalty abilities follow special rules: A player may activate a loyalty ability of a permanent they control any time they have priority and the stack is empty during a main phase of their turn, but only if none of that permanent’s loyalty abilities have been activated that turn. See rule 606, “Loyalty Abilities.” 306.6. Planeswalkers can be attacked. (See rule 508, “Declare Attackers Step.”) 306.7. Previously, planeswalkers were subject to a redirection effect that allowed a player to have noncombat damage that would be dealt to an opponent be dealt to a planeswalker under that opponent’s control instead. This rule has been removed and certain cards have received errata in the Oracle card reference to deal damage directly to planeswalkers. 306.8. Damage dealt to a planeswalker results in that many loyalty counters being removed from it. 306.9. If a planeswalker’s loyalty is 0, it’s put into its owner’s graveyard. (This is a state-based action. See rule 704.) From the glossary of the Comprehensive Rules (September 1, 2023— Wilds of Eldraine ) Planeswalker Symbol The Planeswalker symbol appears on the planar die in the Planechase casual variant. See rule 107.11. Planeswalker cards used to have a similar rule to the \" legend rule \": If a player controls two or more planeswalkers that share a planeswalker type , that player chooses one of them, and the rest are put into their owners’ graveyards. This was called the \"planeswalker uniqueness rule\". Starting with Ixalan , this rule was abandoned. All planeswalkers past, present, and future gained the supertype legendary and became subject to the \"legend rule\". Thus, if a player controls more than one legendary planeswalker with the same name , that player chooses one and puts the other into their owner's graveyard. This has also enabled planeswalkers without types to be printed, such as The Wanderer . The change was made to simplify gameplay. There are no current plans to create nonlegendary planeswalkers. Up until Rivals of Ixalan the following rule was in place: If noncombat damage would be dealt to a player by a source controlled by an opponent, that opponent may have that source deal that damage to a planeswalker the former player controls instead. This is a redirection effect (see rule 614.9) and is subject to the normal rules for ordering replacement effects (see rule 616). The opponent chooses whether to redirect the damage as the redirection effect is applied. Starting with Dominaria this \"planeswalker redirection rule\" was removed. Instead each relevant card will tell you on the card specifically whether the card dealing direct damage can target planeswalkers. Older cards received errata to have \"player\" changed to \"player or planeswalker\", and similarly for \"target opponent\". Most others that could previously target a \"creature or player\" would now refer to simply \"any target\", defined to include creatures, players, and planeswalkers. Planeswalkers are permanents. You can cast one at any time you could cast a sorcery. When your planeswalker spell resolves, it enters the battlefield under your control. Planeswalkers are not creatures. Spells and abilities that affect creatures won't affect them. They can become creatures by spells or abilities, though, such as the abilities of several Sarkhan and Gideon planeswalkers, among others. All planeswalkers have supertype \" legendary \" and are subject to the \"legend rule\". Planeswalkers with the same subtypes can exist under your control as long as they are not of the same name . Planeswalkers each have a number of activated abilities called \"loyalty abilities.\" You can activate a loyalty ability of a planeswalker you control only at the time you could cast a sorcery and only if you haven't activated one of that planeswalker's loyalty abilities yet that turn. The cost to activate a planeswalker's loyalty ability is represented by a box with a number inside. Boxes with a point facing up contain positive numbers, such as \"+1\"; this means \"Put one loyalty counter on this planeswalker\". Boxes with a point facing down contain negative numbers, such as \"-7\"; this means \"Remove seven loyalty counters from this planeswalker\". You can't activate a planeswalker's ability with a negative loyalty cost unless the planeswalker has at least that many loyalty counters on it. Planeswalkers can't attack (unless an ability such as the one from Gideon Jura 's third ability adds the creature type). However, they can be attacked. Each of your attacking creatures can attack your opponent or a planeswalker that the player controls. You say which as you declare attackers. If your planeswalkers are being attacked, you can block the attackers as normal. If a creature that's attacking a planeswalker isn't blocked, it'll deal its combat damage to that planeswalker, regardless of what other types the planeswalker has. A planeswalker is removed from combat if it's being attacked but ceases to be a planeswalker. Its attackers will not be removed from combat and will still exchange combat damage with any blockers, but will not deal damage to the (former) planeswalker it was attacking. Any damage dealt to a planeswalker causes that many loyalty counters to be removed from it. This does not apply if they have ceased to be a planeswalker, such as if they have turned into a creature (in that case, creature rulings apply). If they are both a planeswalker and a creature, damage affects them as both types, so they do lose loyalty and also have the damage marked on them as creatures. If a planeswalker is also a creature, it may block as normal, including blocking a creature attacking the planeswalker itself! It deals combat damage as normal as a blocker, but does not deal combat damage to creatures attacking it which are unblocked (or which deal trample damage to it). Loyalty abilities can be used by non-planeswalkers. A planeswalker which turns into a creature can still use its loyalty abilities, with the same timing restrictions and the same cost or addition of loyalty counters as usual. It will not go to the graveyard for having 0 loyalty until it becomes a planeswalker again. The subtype for planeswalkers is called planeswalker type and is exclusive to planeswalkers. R&D have decided that they don't want to have to rein in other card types because they might impact planeswalkers in a dangerous way. They decided not to add these other types when they chose to not make Karn an artifact Planeswalker. Some planeswalkers (including some pre-Mending era planeswalkers) are now represented as planeswalker cards that can be used as commanders . Some have text allowing them to be commanders, while others are double-faced cards with legendary creatures on the front side and planeswalkers on the back side. The current number of planeswalkers that can be used as commanders are 28, which come from the following sets with the subsequent subtypes: Commander 2014 — Ability Daretti ( Daretti, Scrap Savant ) Freyalise ( Freyalise, Llanowar's Fury ) Nahiri ( Nahiri, the Lithomancer ) Nixilis ( Ob Nixilis of the Black Oath ) Teferi ( Teferi, Temporal Archmage ) Magic Origins — Legendary creatures that transform into planeswalkers Gideon ( Gideon, Battle-Forged ) Jace ( Jace, Telepath Unbound ) Liliana ( Liliana, Defiant Necromancer ) Chandra ( Chandra, Roaring Flame ) Nissa ( Nissa, Sage Animist ) Battlebond — use partner with ability Will ( Will Kenrith ) Rowan ( Rowan Kenrith ) Core Set 2019 — Legendary creature that transforms into planeswalker Bolas ( Nicol Bolas, the Arisen ) Commander 2018 — Ability Saheeli ( Saheeli, the Gifted ) Windgrace ( Lord Windgrace ) Aminatou ( Aminatou, the Fateshifter ) Estrid ( Estrid, the Masked ) Commander Legends — use partner with ability Jeska ( Jeska, Thrice Reborn ) Szat ( Tevesh Szat, Doom of Fools ) Kaldheim — Modal double-faced card with a legendary creature on front and planeswalker on back Tibalt ( Tibalt, Cosmic Impostor ) Strixhaven: School of Mages — Modal double-faced card with a legendary creature on front and planeswalker on back Lukka ( Lukka, Wayward Bonder ) Modern Horizons 2 Grist (a legendary creature insect in all other zones besides the battlefield, according to rule 113.6C , it fits the requirements for a commander) ( Grist, the Hunger Tide ) Commander Legends: Battle for Baldur's Gate — Ability Minsc ( Minsc & Boo, Timeless Heroes ) Elminster ( Elminster ) Tasha ( Tasha, the Witch Queen ) Dominaria United Commander — Ability Jared Carthalion ( Jared Carthalion ) Geyadrone Dihada ( Dihada, Binder of Wills ) Sivitri Scarzam ( Sivitri, Dragon Master ) Commander Masters — Ability Commodore Guff ( Commodore Guff ) Heroes of the Realm - Ability Ersta, Friend to All Byode, Inverse Sun During the time of release, planeswalkers were almost never referred to on rules text, being withheld from commons as to increase the mystique of the card type. Over time, and especially after the release of War of the Spark , R&D relaxed this requirement, and now many more spells can interact with them. White is the color that most interacts with planeswalkers. It can search the library for them and get them back from the graveyard, among other positive interactions. Fated Retribution is one of the few white cards that specifically can remove planeswalkers, while Planar Cleansing destroys all nonland permanents, including planeswalkers. Bound in Gold and Nahiri's Binding show a trend to allow answers to planeswalkers using Auras. Banishing Light effects have usually had any nonland permanent at 3 mana and creatures only at 2 mana, with only Prison Realm bridging the gap. Black is the primary color that can have the text \"destroy target creature or planeswalker\". A small number remove counters from planeswalkers or a subset of permanents. Red previously could damage planeswalkers through the planeswalker redirection rule, but with the rule change damage spells now need to specify planeswalkers as valid targets. Due to Lava Axe type effects being liabilities often, both damage spells to creatures and damage spells to players may now carry planeswalker as a secondary target. Green doesn't call out the planeswalker type by name ( Nissa's Defeat being an exception), but can destroy non-creature permanents; however, this effect is fairly rare, and to compensate some of Green's Bite effects have started to target planeswalkers. Blue normally countered planeswalkers alongside other noncreature spells like with Negate . Lately blue has now some creature-target counterspells that also hit planeswalkers ( Reject , Anticognition ), and also some bounce spells and controlling spells that hit creatures or planeswalkers ( Barrin, Tolarian Archmage , Mass Manipulation ). Some iconic Dungeons & Dragons characters have appeared as Planeswalker cards in the cross-over sets Dungeons & Dragons: Adventures in the Forgotten Realms and Commander Legends: Battle for Baldur's Gate . However, this does not mean that these characters have a planeswalker's spark . According to Wizards of the Coast, they wanted to make these characters as cool as they could possibly be, and as Planeswalkers were a regular part of new Magic sets, the Planeswalker card type in their opinion would make a great fit. Further non-canon planeswalkers will be found in sets belonging to the Universes Beyond -series. Main article: Planeswalker (lore) Brady Dommermuth . (August 16, 2007.) \"You Are a Planeswalker\" , magicthegathering.com , Wizards of the Coast. (Internet Archive snapshot) Erik Lauer (October 19, 2007). \" Playtesting Planeswalkers \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (October 22, 2007). \" Planeswalker Enchantment Art \". magicthegathering.com . Wizards of the Coast. Devin Low (October 26, 2007). \" The Nineteen Principles for Developing Planeswalkers \". magicthegathering.com . Wizards of the Coast. Doug Beyer (October 24, 2007). \" Planeswalkers Unmasked \". magicthegathering.com . Wizards of the Coast. Doug Beyer (June 04, 2008). \" Planeswalkers and the Written Page \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (July 25, 2008). \" You Are a Planeswalker \". magicthegathering.com . Wizards of the Coast. Tom LaPille (January 09, 2009). \" To Kill a Planeswalker \". magicthegathering.com . Wizards of the Coast. Doug Beyer (March 18, 2009). \" Planeswalking into Conflict \". magicthegathering.com . Wizards of the Coast. \"A Planeswalker's Primer for Conflux: Planeswalkers\" — YouTube Doug Beyer (May 19, 2010). \" Planeswalker Potpourri \". magicthegathering.com . Wizards of the Coast. Adam Lee (August 25, 2010). \" Slime, Trials, and the Inner Garruk \". magicthegathering.com . Wizards of the Coast. Doug Beyer (August 03, 2011). \" The Bloodthirsty Chef \". magicthegathering.com . Wizards of the Coast. Doug Beyer (November 09, 2011). \" Six Ways to Fail at Creative Endeavors \". magicthegathering.com . Wizards of the Coast. Doug Beyer (June 17, 2014). \" Checking in on the Planeswalkers \". magicthegathering.com . Wizards of the Coast. Gavin Verhey (January 26, 2017). \" Walkership Down \". magicthegathering.com . Wizards of the Coast. Gavin Verhey (June 29, 2017). \" Death to Planeswalkers \". magicthegathering.com . Wizards of the Coast. Mark Rosewater (July 23, 2018). \" Planeswalking Down Memory Lane \". magicthegathering.com . Wizards of the Coast. War of the Spark - Mechanic Spotlight: Planeswalkers | Magic (Video). YouTube."}