{"text": "Rakdos is the demonic parun and guildmaster of the Cult of Rakdos on Ravnica . He spends most of his time slumbering in a lava pit located in Rix Maadi . He was given the responsibility of a guild by the Guildpact to bind him to a greater purpose, or at the very least keep him busy enough that he would be less of a problem for the other guildmasters. Rakdos has been described as \"Big as a dragon, with arms and legs muscled and proportioned like a gigantic wrestler. Two sets of horns, one arcing upward, outward, and backward like a steer's, the other arcing down and curving up like those of a humongous ram. Burning yellow eyes. Razor teeth, locked together in a rictus grin. A beard of bone spurs emerging from a wide jaw. Bat wings. Cloven hooves. Blood-red hide clothed in chains and skulls. And his brow, a wreath of flame.\" He is known as the Defiler , the Enslaver , the Demon-God , and, in more obscure histories, the Rat-King . Rakdos embodies hedonism and is known for his capricious cruelty and megalomania. Older than the Guildpact itself, Rakdos is an ancient, powerful, and evil demon who personifies the chaotic fury of red mana and the death and defilement of black. He is also a consummate entertainer, whose mere appearance is an act of grisly performance art. A monstrous figure standing thirty feet tall, spreading enormous wings, crowned with fire, and swinging a flaming scythe, Rakdos demands the spotlight. His every entrance is a showstopper. Rakdos' armor resembles the signet of the Rakdos guild. Sometimes, after his grand entrance, Rakdos crouches to witness the performances of those who adore him. To them, his opinion is the only one that matters, but he is a demanding spectator. He has seen thousands of years of circus tricks and has no patience for performers who don't give their all. His flaming sword has brought more than one tepid show to a sudden and spectacular close. Jaded as he is, Rakdos attends his cult's performances only rarely. He often retreats in his lair below Rix Maadi , for months or years at a time, but his followers know that he might emerge at any time to witness the latest spectacle. Getting him to show approval of a performance or even actual interest, is regarded as the ultimate test of a Cultist of Rakdos. As a parun, Rakdos existed before the signing of the Guildpact, though his exact origins are unknown to all but himself. Izolda , the then-acting guildmaster of the cult, raised Rakdos from his pit to wreak havoc on Ravnica. She awakened him with the blood of Myc Zunich , son of the Golgari guildmaster Jarad , and planned on using a concoction of draconic cerebral fluid to take control of her demonic master. Myc's parents intervened, which resulted in Myc gaining control over Rakdos. After a brief rampage, Izolda was able to finish the ritual and took control over Rakdos herself. Unbeknownst to her, Momir Vig , who had supplied her with the cerebral fluid, had planned to use Project Kraj to defeat Rakdos and use this victory to convince the inhabitants of Ravnica to give him control of the entire plane . However, Vig was killed by Agrus Kos and Kraj fell later, during the fight. Rakdos suffered extensive damage and Izolda suffered the backlash of the spell. Unfortunately for her, her fellow cult members saw her moment of weakness and tore her limb from limb to feast on her flesh. With the nature of the spell, Rakdos's mind was split among all those who consumed a piece of the blood witch and he dropped into a coma as a result. Later, the new Boros guildmaster Feather dumped Rakdos' body back into his lava pit, unsure if he would ever rise again. Rakdos is still alive and is destabilizing the authority by mocking and undermining the authority of other guilds. The Cult's performances range from satire and mocking the leaders in their shows to having special shows that end with the killing of the individual. Rakdos and Gideon Jura. In the War of the Spark , Rakdos initially was not cooperating at all with the anti-Bolas efforts because Hekara , his emissary was killed. Kaya 's group was going around to every non-cooperating guild to convince them to help out in Niv-Mizzet 's plan of becoming the new guildpact. Rakdos still refused to cooperate with the plan, but Hekara's corpse was brought back by Tomik and she was revived as a bloodwitch. Hekara said that she would help Kaya's group. Exava tried to object but lost to Hekara in a fight. Rakdos didn't say anything but did not actively prevent Hekara from leaving. Neither did he object when Hekara served as the Cult's representative at the resurrection of Niv-Mizzet as the new Living Guildpact . Later he was Gideon Jura 's Unlikely Aid when they attacked Nicol Bolas together. He was knocked out of the air by Bolas when Gideon was riding him. He was fine and at the end of the War, making preparations to \"lighten the Ravnican people's hearts\" and help them forget the horrors of the war with the performances of the Rakdos circus. His minions celebrated his victory over Bolas for a long time after. At some point after the New Phyrexia's Invasion of the Multiverse , Rakdos travels through Omenpaths to the world of Thunder Junction , where he would be joined by some of the most famous villains of the Multiverse. Ravnica Thunder Junction Of the ten paruns, Rakdos is the only one still in charge of his guild. Niv-Mizzet is still alive but, as the Second Living Guildpact , he is no longer part of the Izzet , while Azor , having given up his spark to make the Immortal Sun , remains trapped on Useless Island on Ixalan . Represented in: Associated cards: Depicted in: Quoted or referred to:"}