{"text": "Ral Zarek (/ræl zɛrɪk/ RAL ZAIR-ik ) is a planeswalker native to the city plane of Ravnica and current guildmaster of the Izzet League . Ral is a young man with a smirking smile and streaks of silver-white in his frizzled black hair. He is a Storm Mage who can create electrical storms and has control over rain. He has to be in the open to recharge his electric powers. On his back, he often wears a Mizzium -Ion Electrostatic Accumulator that can channel ambient static through his arm-mounted gauntlets. When he ascended , he thought to have managed to hide this fact from Niv-Mizzet , an impressive task in and of itself. Indeed, Ral has never looked to the ancient dragon as a role model or mentor, but as a nuisance at best and a likely adversary at worst. Despite all of this, Ral has consistently served the Firemind with loyalty. Ral is the husband of Tomik Vrona , a famous and wealthy Orzhov property lawyer who serves as Teysa's right-hand man. The two of them have a committed romantic relationship and share an apartment. Since they are high-ranking officials in rival guilds, they kept their relationship hidden from the public eye. However, it became public knowledge when they worked together to organize the guild summit . Ral is immune to the effects of electricity, and he is centered in red and blue mana. When he planeswalks, he disappears in an explosion of electrical sparks. Ral grew up in a small Ravnican district where everyone seemed to pick on him as a “rain mage.” He quickly learned to keep to himself and eventually came to the Tenth District on his own. There he picked up the local accent and studied the history of all the guilds. When he found the Izzet, Ral learned everything he could about them. He studied storm magic based on Niv-Mizzet's equations and worked his way through the guild.  The happiest day of his life was becoming part of the Izzet League as a guildmage . Ral's mother had been a poor laborer, working in a cloth factory until she'd been mangled in an accident when Ral was eleven. She'd lived a cripple for another two years, never really healing, with Ral doing everything he could to help her. After she'd finally died, it had only taken a few months for the thirteen-year-old to abandon his drunken lout of a father and strike out on his own. Four years later he was finding jobs as a rain mage and was in a relationship with the young poet Elias . After an unfortunate encounter with some noble youths, he encountered a man who offered him a job. The man introduced himself as Nicol Bolas . In the three years after becoming employed by Bolas, Elias's career took off in a way neither of them had imagined possible. Non-withstanding their lavish lifestyle, they grew apart because of Ral's secret missions for Bolas. During one of his enforcer jobs, Ral was stabbed by a young boy. Returning home wounded, he found Elias in the embrace of another man. The shock ignited his planeswalker's spark and he disappeared from Ravnica. Ral arrived on an unidentified plane. Not knowing where he was, or how he had gotten there, he found an apprenticeship with an old tinkerer who worked with electricity. He also found a new lover in the tall and broad-shouldered Harith. After learning all that he could from Ghazz, Ral, and Harith robbed him. Afterward, Ral betrayed Harith as well and left with all the loot. Ten years later he had created a small imperium for himself and also had created the first version of his accumulator. But when Bolas returned to collect his debt, Ral abandoned his enterprise on the plane and planeswalked back to Ravnica. Ral Zarek becomes a prodigy within the Izzet League . Ral became the chief researcher for the Izzet League . He investigated the ancient codes laid out in the Tenth District , the leylines and secrets that made up the Implicit Maze that fascinated his guildmaster . Deep into the project, Ral's efforts took him underground to the most ancient catacombs of the Undercity with his goblin attendant Skreeg . He was drawn by the potency of the leylines, the invisible bands of energy running deep beneath Ravnica's heights. Unfortunately for many involved, the Izzet team ran afoul of the Golgari Swarm , who insisted that any unclaimed territory was their own. When Ral refused to be cowed by the Golgari threats, the swarm of shamans raised the myriad dead to drive them out of the tunnels, or murder them, whichever was most expedient. His team overwhelmed, Ral used the mana coils, a device meant to track the leylines, as a power source, funneling the entire energy of a leyline through his elemental gauntlets. It blew apart virtually everything in the tunnels, leaving only himself and several of his Izzet accomplices standing. This added the Golgari Swarm to the ever-growing list of guilds concerned about the Izzet activity. Luckily, the explosion had the unintended side effect of exposing the pattern Ral's party had been looking for in the first place. Several days later, in search of the Dimir gate , Ral and his goblin assistant caught the attention of Jace Beleren . Their activity had drawn the young telepath to the Izzet's goals and he had begun his line of research. As they were followed, the pair made directly for Izzet territory where they gave their report directly to Niv-Mizzet, who detected their erstwhile shadow. Ral continued his research, his attentions drawn vertically as the leylines rose into the sky. As his quest continued, Ral became more and more reckless and less inclined to let anything stand in his way. When the leyline crossed an Azorius aerie, Ral took the most immediate solution he could think of, summoning a massive storm elemental to wreak havoc across the tower, forcing a confrontation with the Azorius occupying it. A short battle ensued with Ral one step closer to his goal. Ral reported to Niv-Mizzet, having traced the mana braids through every territory except Orzhov and Simic. However, the massive casualties of the people under his command finally roused the ire of the great dragon and Ral was taken from the project. Under threat of being devoured, Niv assigned Ral the task of tracking down the mage who had touched his mind. Ral was to find Jace Beleren. The guildmage began by finding Beleren's sanctum but mostly found naught but ash and rumors. Within those ashes though, he knew the secrets of Beleren's research remained, and weaving a complicated spell, he learned what Jace had sought to destroy and how close he had come to solving the riddle of the Implicit Maze . So close... that he felt he didn't even need Niv anymore. Using Jace's notes, Ral traced the patterns of the maze, finally tracing it to the Forum of Azor . The place teemed with power, but it seemed utterly inaccessible. Ral was left dumbstruck, unable to cope with the failure, and bridling with resentment over everything he was denied. Left with little choice, he reported back to his guildmaster. The dragon patiently explained that the maze had been built by Azor not to test the brightest or most powerful, nor to grant power to either of those. It was a failsafe in the event the Guildpact was ever disrupted. Against Niv-Mizzet 's orders, Ral becomes a maze runner. Niv revealed that the only way the maze would activate is if every guild took part in its activation... and to facilitate that, he sent Ral to reveal nearly everything they had worked on to the other guilds. Once his task was accomplished, Ral returned to Nivix and began preparing to run the maze. However, Niv-Mizzet revealed that he was not to be chosen, instead, working to produce the ideal champion, a weird they dubbed Melek . Wroth, Ral objected but was ultimately silenced by his draconic guild master. Ral was still chosen to accompany Melek and act as the coordinator for the event. The assembled champions declared themselves and their allegiance, but as Melek stepped to declare himself, Ral absorbed the weird's essence into his gauntlet, effectively murdering the rightful champion. Without an alternative, he declared himself the Izzet maze runner and began the race with a surprise attack upon every other entrant. He easily made his way through the gates and finally waited for Jace to show up at the Izzet Guildgate. There, he forced the telepath to tell Emmara Tandris the truth about being a planeswalker, an act that cost Jace dearly. Of Jace's perceived slights against him, Ral planned to end the other planeswalker, but he was ultimately foiled when Jace used his illusions to escape Ral's justice. Ral eventually found his way to the Forum of Azor once more, just as Lazav arrived and drove each of the other champions into fighting. The maze prepared to execute the contingency that would wipe away the guilds and all of the Tenth District when Jace reached out to each of them with his telepathy, uniting them mentally and stopping the destruction Ral and the others were going to unleash. Curious about the Living Guildpact that had foiled his plans, Niv-Mizzet set Ral the task to trace Jace and research his many sudden disappearances. When his co-worker, the Chamberlain Maree , came close to exposing the existence of planeswalkers, Ral had to work together with Jace to successfully distract the Firemind. Despite the loss of funding, Project Lightning Bug continued to show when a planeswalker entered or left Ravnica. As a result, Ral learned that a group of four planeswalkers had come to dwell on Ravnica, as well as the presence of the criminal planeswalker Vraska . Noticing that Vraska seemed to planeswalk into a void , Ral met with Jace in a Rakdos Carnarium to alert him to this danger. He warned Jace to not leave Ravnica for some time, only to be interrupted by Liliana Vess , who reported that she had seen Tezzeret on Kaladesh . Jace fetched Gideon and left Ravnica behind, against Ral's better judgment. Dragon's Maze key art After Bolas's crushing defeat of the Gatewatch on Amonkhet and the collection of his Eternal Army, he sent Tezzeret to fetch Ral. On Ravnica, Tezzeret tried to collect a debt that Ral owed to Bolas. Ral refused, and their encounter quickly turned into a fight. In the absence of Ral, a Dimir agent controlled by Bolas meanwhile managed to infiltrate Nivix and plant a thought in the mind of Niv-Mizzet. After capturing the intruder and examining her mind, Niv-Mizzet sent for Ral. He revealed that he knew about planeswalkers all along, that Ral was one such creature, and that Nicol Bolas was planning an invasion of Ravnica. He tasked Ral with uniting the ten guildmasters to change the Guildpact and provide Niv-Mizzet with the necessary power to withstand Bolas. In return, Ral was promised control of the Izzet League . By request of Niv-Mizzet, Ral also turned Project Lightning Bug into a beacon to call other planeswalkers to Ravnica. Ral called the guild summit to organize the resistance against Bolas. All ten guilds had to be represented to change the Guildpact and to transfer its power to Niv-Mizzet. In order to gain the support of the Orzhov Syndicate , Ral staged an attack by the Golgari Swarm on Orzhova . This allowed for Kaya to kill the Obzedat , and was meant for Teysa Karlov to regain her power. However, Kaya involuntary became the new guildmaster using the Orzhov magic rules. The guild summit eventually convened at New Prahv . Although Isperia promoted cooperation, the guilds were quick to display their adversarial positions. Niv-Mizzet then arrived to reveal their true enemy, Nicol Bolas . The Firemind proposed to implement the “fail-safe” and grant him the power of the Living Guildpact . For each guild to properly evaluate Niv's request, Isperia adjourned the meeting until the following morning. That night, Vraska killed Isperia , causing the summit to fail. As a backup plan, Ral proposed to construct artificial lines of energy to superficially alter the design of the Implicit Maze . To evade the \"power network\" that Azor had created, Ral planned to build a great machine across the Tenth District that would, in theory, enable the ascension of Niv-Mizzet without the consent of all ten guilds. To work, Ral acknowledged that the nodes in Gruul and Golgari territory would have to be taken by force. Aurelia and Dovin Baan agreed to attack the Gruul Rubblebelt with their guilds, while the Orzhov and the Rakdos agreed to attack the Golgari in the Undercity . Both locations are conquered at the cost of many lives. Dovin Baan played along until right before Bolas's arrival on the plane and then sabotaged the plan. After the failure of Ral's great machine, Niv-Mizzet admitted that he had once again underestimated Bolas but complimented Ral for exceeding his expectations. As Bolas and his forces began their arrival, Ral was sent to activate the Interplanar Beacon while the Firemind flew off to delay Bolas for as long as possible. With the help of Kaya and Hekara, Ral was able to bypass the Azorius guards and enter the Beacon Tower, only to find Vraska and a possessed Lavinia waiting for them. At the coast of Hekara's life, Ral was able to defeat Vraska and free Lavinia. Ral activated the Interplanar Beacon to bring other planeswalkers to Ravnica for help, but it turned out that was exactly what Bolas was counting on. Guildmaster. Once the Beacon was active, Bolas brought the Immortal Sun to Ravnica, trapping the planeswalkers there. Like all the planeswalkers who'd been lured to Ravnica by the Beacon, Ral found himself trapped. Bolas' invasion began shortly after that, and the Eternals of the Dreadhorde marched forth from the dragon's Planar Bridge . Alongside many other planeswalkers and Ravnicans, Ral fought against Bolas' forces. He befriended Teyo Verada , a newly-ignited planeswalker who had just arrived on Ravnica. With the help of a Gateless street urchin named Araithia Shokta (nicknamed Rat), Kaya and Ral helped explain the situation to Teyo. Alongside Chamberlain Maree , Ral led Izzet forces into battle against the Dreadhorde. He also convinced Vorel to join the fight, sending Simic Combine mutants, super-soldiers, and biomancers to fight against the Eternals. During this time, Ral was deeply worried about Tomik, who had gone missing during the chaos. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. At Jace 's recommendation, they decided to split up into teams to focus on specific tasks. Ral and Maree went to disable the Interplanar Beacon. Unfortunately, the Beacon was nearly indestructible and there was no way to turn it off since Ral sought to protect it from Bolas when he built it. This left Ral with no other option but to disable the machine by completely draining its power, a long and exhausting process that pushed the limits of Ral's ability to channel electricity. The amount of energy involved was so large that Ral was able to drive off the God -Eternal Kefnet by releasing the stored-up power in a massive bolt of lightning, blasting the god's arm off. After disabling the Beacon, Ral joined up with Kaya, Teyo, and Rat in the Undercity . In Vraska's absence, the other leaders of the Golgari Swarm squabbled for control of her throne, but Vraska returned and united them. Despite Ral and Kaya's suspicion of the gorgon , Vraska pledged the Golgari to the fight against Bolas. With the help of Ajani and his team of planeswalkers, they were able to evacuate many civilians to the tunnels beneath the city, where they would be safe from the Dreadhorde. Using the Interplanar Beacon 's energy, Ral attacks Kefnet . After that, Vraska, Ral, Kaya, Teyo, and Araithia journeyed to Rix Maadi to negotiate with Rakdos . The demon lord was initially hostile due to the death of his emissary Hekara , and the blood witch Exava ordered the group to leave. However, much to Ral's relief, the Orzhov representative Tomik showed up, explaining that he'd been convincing Orzhov leaders to join the fight against Bolas. Tomik had also brought Hekara's corpse with him, and the Rakdos cultists resurrected Hekara as a blood witch. After defeating Exava in a fight, Hekara used her newfound authority as a blood witch to lead the Rakdos against Bolas. Once all ten guilds were on board, Nissa performed a ritual at the ruins of the Guildpact Chamber: with the help of a representative from each guild, she was able to repair the leylines that empowered the Living Guildpact (which had been disrupted when Bolas destroyed the Guildpact Chamber by opening his portal there). Ral served as the representative for the Izzet League. Using a device that Niv-Mizzet had constructed before his death to preserve his consciousness, they were able to resurrect Niv and grant the power of the Living Guildpact to him. Niv came back to life just in time to save the others from the God -Eternal Kefnet : using his newfound power, Niv was able to completely incinerate Kefnet in a torrent of flame, although the strain of channeling enough energy to kill a god caused him to fall unconscious. Ral survived the battle and was present during the Planewide Celebration that followed, where he and Tomik reunited and shared a private kiss. Later, he joined Niv-Mizzet and the other guildmasters (with Tomik now representing the Orzhov Syndicate in Kaya's place) when they confronted Kaya and Vraska. They decided to spare the planeswalkers who formerly worked with Bolas but defected before the battle, on the condition that they make amends by hunting down the planeswalkers who stayed loyal to Bolas or defected too late. Ral volunteered to capture Tezzeret as his penance. Aided by The Wanderer ’s unique abilities that allowed her to track Tezzeret and the Planar Bridge technology he carried, Ral Zarek and The Wanderer traveled to multiple planes in search of their target. They eventually found Tezzeret in his fortress on Alara in Esper , once known as the Seekers' Sanctum . The pair were greeted by a squadron of etherium gargoyles in which all but the leader, Brokk , were destroyed. Ral and The Wanderer entered Tezzeret's base and battled against his minions through multiple traps. Upon reaching Tezzeret, The Wanderer was knocked unconscious by the lead gargoyle and automatically planeswalked away. Ral found his powers useless as Tezzeret's Planar Bridge technology absorbed and redirected his lightning strikes. Nevertheless, Ral challenged Tezzeret to continue fighting, and in hand-to-hand combat, Ral was badly beaten. Not wanting to be hunted further, Tezzeret showed mercy and gave Ral his damaged etherium arm to provide proof of a kill. Ral returned to Ravnica in defeat where he ultimately told the truth about his failure. Seeking to capitalize on her Izzet guildmaster 's misfortune, Chamberlain Maree called for a vote of no confidence in Ral's leadership. Ral managed to solidify his support within the guild and retained his position as guildmaster. At some point after this, Ral and Tomik were married during the springtime on Ravnica. Ral Zarek prepared countermeasures in advance of New Phyrexia's Invasion of the Multiverse . When Phyrexian forces led by Vraska attacked, he reinvented a sonic method to make the glistening oil disintegrate, similar to the one used by Urza and Xantcha millennia before, and managed to win the battle. Along with many members of the Simic Combine , numerous Izzet willingly underwent compleation out of sheer curiosity, resulting in great distrust from the other guilds. An accumulator to store static energy. Goggles designed by Niv-Mizzet , make planeswalkers recognizable by their aura. The haemalectric switch: a small, cylindrical device attuned to Phyrexian oil. Ral Zarek made his debut in the Duels of the Planeswalkers 2012 expansion. The third such character to appear in such a way, after Nissa Revane and Kiora . Ral narrates the trailer for Dragon's Maze . The art for Ral, Izzet Viceroy shows him holding a piece of white fabric, and he wears it on his wrist in the Mythic Edition and various art throughout the Guilds of Ravnica block . This is likely a piece of Tomik 's robe. In turn, Tomik, Distinguished Advokist wears a piece of Ral's red robe on his wrist. In the video game Magic: The Gathering Arena , Ral is voiced by Brandon Routh and Bryan Daniel Porter. Associated cards: Depicted in: Quoted or referred to:"}