{"text": "Ramses Overdark was the imperial assassin , and later the imperial regent, in Madara on Dominaria . Unlike his contemporaries, the imperial champion Tetsuo Umezawa and the kentsu general Marhault Elsdragon , Lord Overdark didn't follow emperor Nicol Bolas loyally but was always trying to find loopholes in the emperor's commands that he could exploit to expand his might. He was especially focused on replacing the champion and the general with his minions and even wished to replace the emperor if he ever could amass enough power to do so. When the Edemi Islands rebelled against the empire, Bolas first sent Overdark to reclaim them. He sent his most skilled assassin, Xira Arien , to assassinate the leaders of the uprising, chief among them Lady Caleria . But Overdark also incorporated a plan to kill his nemesis Tetsuo in his counterattack on the island. Arien was to set Caleria against the imperial champion before she killed the rebel leader, and Lady Orca was sent to terrorize the islands under Tetsuo's banner. On top of that, Arien infected Tetsuo's healer Kei Takahashi to lure Tetsuo to the Edemis. Overdark hoped that either the rebels would kill the champion or Arien and Orca could deal with both him and the rebels in one go, but Tetsuo and his entourage defeated his minions and even his trump card, a serpent generator . As punishment for his failure, Bolas ordered Ramses to stay out of the business in the Edemis and let the kentsu handle it. But Overdark disobeyed the direct orders of the emperor and sent agents to the islands anyway. Marshal Jorgan Hage , second in command of the kentsu was possessed by the assassin's powers without even realizing it himself and the shapeshifter Halfdane was stationed on Kusho to poison the mana lines of the island. He even forged a decree of the emperor to get Lady Orca on the island, pretending she would be used only to defeat the Akron legionnaire that defended Caleria's castle. But after the kentsu was victorious Orca turned against them, and in the chaos Hage decapitated Elsdragon and usurped the title of general, making the leader of Madara's powerful army one of Overdark's minions. Shortly after his coup of the kentsu, Overdark was visited by the emperor, who already knew all his assassin had done. But instead of punishing him, Bolas was impressed by Ramses's ambition and claimed the ruling structure of the empire had been obsolete anyway. Bolas then awarded Overdark with the title of imperial regent. But his rule was not to last. Tetsuo had renounced his title of imperial champion and swore vengeance for the grief Overdark and his minion had caused to the empire and specifically Tetsuo and his entourage. Lord Overdark lived in a keep in the northern swamps of Madara. Here he kept many powerful artifacts and he had hidden meditation chambers from which he cast his most powerful spells. The keep was protected by an efreet called Zalgadib , who had made a deal with Ramses: Zalgadib would serve him for approximately 300 years, and then the efreet got to eat Overdark. It never came to this, however, as Kolo Meha was ordered to destroy the keep by Tetsuo Umezawa, killing Zalgadib. Tetsuo had sent Kolo to deny Overdark his main source of mana. Tetsuo traveled to the Imperial Shrine , defeating many of the regent's minions along the way. Finally meeting his nemesis in one-on-one combat, Tetsuo killed Overdark and absorbed his powers to use them against Bolas."}