{"text": "Rankle is a faerie rogue from Eldraine known for his evil pranks. Rankle, a mercurial fae of the Wilds , delighted in tormenting the stupid knights of the Realm and their idiotic virtues. To an outsider, Rankle's antics seemed pointless, and they frequently were, but while most faeries of his kind are annoyances, Rankle's pranks were downright cruel. Rankle showed an occasional glimmer of low cunning, concocting elaborate plots to create desired outcomes. The price to win an audience with Rankle could range from compromising one's virtues to plucking out an eye, depending on his mood and sense of humor that day. His behavior showed him to be not only vicious, but arrogant, childish, and myopic as well. One day, believing he was being coronated by his fairy subjects, Rankle was instead kicked out of his glade. His subjects revealed they all hated him for various personal slights: he'd put bees in Orla 's mouth when she was sleeping, sewed Fifer 's mouth shut, and never got along with Mags . One of his wings was tattered in the process, leaving him with one good wing. Distraught, he wandered the land for some time before a chance encounter with Ayara , the Queen of Locthwain . He resolved to be her next husband and set off to find a love potion. When Rankle went into a witch's shop to buy a love potion, she sent him on a wild goose chase for an imaginary flower that was supposedly a necessary ingredient. While in the wilds, he happened upon a dog that grew mechanical components and attacked him; it happened to be that New Phyrexia was invading the Multiverse . He was rescued by Torbran , who was traveling to Locthwain. Rankle accompanied him, but upon arrival, found that his love, like the rest of Locthwain, had been compleated . Unfazed, he stole Torbran's ring of three wishes, which the dwarf had planned to use to fight the Phyrexians, and wasted the first two wishes on a basket of cookies and a love potion. While Torbran complained that Rankle had doomed them all and they had no way to lure the invading Phyrexians into a chasm that would soon form, he confidently used his third wish on a rain of love potion. His plan worked; all the Phyrexians, affected by the love potion, pursued Rankle and fell into the chasm, just as the Wicked Slumber overtook them. Rankle drowsily joined the pile of bodies, believing himself a beloved king of devoted subjects. After the curse was broken, Rankle awoke and quickly returned to playing pranks. Associated cards: Quoted or referred to:"}