{"text": "Ratepe , son of Mideah (or Rat for short) was a human slave from Efuan Pincar on Dominaria who physically resembled Mishra . He was recruited by Xantcha to free Urza from his madness. Ratepe was born the son of Mideah, a lector of philosophy in Efuan Pincar. His childhood was comfortable, with loving parents, until a group of religious zealots called the Shratta appeared and burned the libraries and schools in the city to the ground. In the ensuing years of chaos and fighting between the Shratta and the Red Stripes (a group founded to stop the Shratta), Rat's family tried to stay out of trouble, but were eventually discovered and had to flee. From there, it was only a short time until the Shratta found them again, killing Rat's family while he was away. He was caught by slavers soon after he returned. Xantcha encountered Ratepe in the city of Efuan Pincar and purchased him to take him back with her to Urza. She explained to him that he was meant to act as though he were Urza's brother Mishra, which would hopefully bring Urza out of his obsession with the past and focus him on the current Phyrexian threat. Upon their first meeting, Urza was adequately convinced that Rat was Mishra, but he fainted upon seeing Urza's powerstone eyes. Over the next year, Rat worked with Urza and Xantcha to help Urza see past his obsessions and stop Phyrexian sleeper agents from appearing across the main cities in Dominaria. He could hear the whispers of the Weakstone while in Urza's presence, allowing him to quickly and accurately present himself to Urza in exactly the way Mishra would — a trait that saved him and Xantcha on multiple occasions. He also traveled with Xantcha across Terisiare , helping her find and defeat Phyrexians trying to enter Dominaria secretly. Spending so much time with Xantcha resulted, fairly quickly, in a blossoming romance between the two, although Xantcha's Phyrexian origins gave her little understanding of the customs of love. Nevertheless, the two became close, to the point that Urza had taken notice, and to their surprise supported the relationship between his \"brother\" and a Phyrexian. He allowed them to travel together to Efuan Pincar to take part in the Festival of Fruits, where their anti-Phyrexian plan had also been staged. Ratepe had helped Urza in the creation of \"screaming spiders\" capable of affecting, and slowly killing, Phyrexians while leaving non-Phyrexians unharmed. During the Festival of Fruits, these artifacts were set off across Dominaria, including in Efuan Pincar, where Gix had been waiting. After a short fight with Urza, Gix escaped to Koilos to await him. Urza followed the praetor and they fought to the death. At first, it seemed as if either could win. Then, Gix was gaining an upper hand in the battle. Xantcha and Ratepe knew what they had to do if Urza was to survive and Dominaria was to stand a slim chance of surviving Phyrexia's invasion—they had to sacrifice themselves, and so they did. The disruption made Gix pause and gave Urza the chance to defeat him. Xantcha and Ratepe may have been killed saving the planeswalker, but they would always be remembered."}