{"text": "Rath was an artificial plane utilized by the Phyrexians as a staging point to invade Dominaria . Created out of flowstone generated in the central Stronghold , the plane slowly expanded over centuries until it was the same mass as Dominaria itself, at which point it would transpose atop the target plane, carrying its armies directly into the field. As Rath grew, regions of the two planes would overlap briefly, bringing Dominarian inhabitants into this new, hostile environment. Rath was ruled as a Phyrexian fiefdom by appointed evincars , though an effective uprising was led by Eladamri just before the planar overlay . Rath was the setting for the Tempest , Stronghold , Exodus , and Nemesis expansions . The origin of Rath was never fully explained. It was said to be created by Yawgmoth , sometime after the fall of the Shard . Yawgmoth ordered the use of Rath for the storage of Phyrexian troops and the formulation of his plan to attack Dominaria. It was hidden in a small pocket plane attached to Dominaria, making it hard for planeswalkers to find it. Rath was sustained by a massive machine in its center called the Hub. This device spewed a somewhat intelligent substance known as flowstone , which the plane was mostly made from. Flowstone expanded and would be used to increase the plane's mass consistently until it merged with Dominaria. The Hub also housed the Stronghold , the seat of power on Rath where the evincar ruled. Rath's evincars were Phyrexian agents under the command of Yawgmoth. These rulers had to put down the revolts of Rath's inhabitants, the Kor, the Vec, and the Dal, as well as the elves of Skyshroud . Most of the peoples of Rath were left grasping for survival under the neglectful tyranny of the Rathi leaders since they were of no concern to the evincar and a nuisance to the Ineffable's plans. The skies of Rath were a maelstrom of energy that was dangerous to fly ships. A planar barrier enveloped the pocked plane about a thousand feet off the ground. Rathi skies changed elevation and could be raised higher — or dropped to ground level — at any point in time. Anything caught in the barrier of energy when in Rath would be torn apart or pulled into a place called the Shadows , the void between Rath and Dominaria. Creatures were also pulled from Dominaria during this disturbance, and that is primarily how those dwelling on Rath aside from Phyrexians came to be there. Another phenomenon known as the Parallax appeared as a jagged line of light that grew in brightness and intensity until it resembled a miniature sun. Once it had reached its peak, the sun would explode, sweeping a blinding light outward that saturated everything it touched in arcane energy. All solid objects - living and dead - melted, broke up, and floated away as a collection of soft globules. It is unclear if the parallax was related to Rath's other phenomena or if it transported its victims to Dominaria, the Shadows, or simply destroyed them. The Stronghold - a massive fortress between two sides of a volcanic chasm, part of a three-mile high volcano, supported by large beams and foundations running into both walls. Near the top blue-hot flowstone is released. The Evincars lived here, in the stronghold, which is a part of the Hub. The City of Traitors , home to the Rathi Tribes . Skyshroud - home of the elves. Rootwater - a large swampy body of water under the mangrove canopy of Skyshroud. The Riptide merfolk are at home in Rootwater. The Heartwood - A forested region, populated by Dryads , Giants and Treefolk . The Cinder Marsh - An area where vents from the Stronghold spray waste and thermal excess. There is a lot of pollution in this area. The Sliver Lair - A series of tunnels where the hordes of slivers are kept, near the Stronghold. They were led by the Sliver Queen , which could direct the actions of the slivers through its hive mind. The Furnace of Rath - A fiery lake below the Stronghold, in a set of rocky catacombs in the volcanic mountain. It was at one point used to regulate the temperatures and environment of the artificial plane. The Death Pits - The Death Pits of Rath was below the Stronghold and just past the Furnaces. Here Volrath brought all of the creatures of his failed experiments and had them cast into a noxious, black ooze that was capable of grabbing out at moving objects. The Eye of Korai - A small island in the Skyshroud/Rootwater area. The Flowstone Desert - A desert area of rolling crevices of flowstone. Many Vec lived here. Kor Haven The Kor , the Vec , and the Dal were the three tribal peoples of Rath. They each primarily lived as nomads battling for survival throughout Rath. The Dal and the Vec founded and attempted to protect some towns, however, the threats that resided on the plains and the Phyrexian rule posed a strong challenge to the safety of these settlements. Dal are humans, dressed in crude leather, living in scattered villages. The Vec are similar to middle-eastern folk of Medieval times and were the most civilized of the three, living in cities around Rath. Kor are catlike, blue humanoids and lived in small, reclusive tribes in the deserts and plains. The three peoples split again into two groups-- en , and il . The en were members of any of the three races that resisted and lived separately from the evincar's control. The il were members that either sold their services to the Phyrexian rule lived as slaves under evincar control, or simply gave the evincar their allegiance. Three other peoples from Dominaria, now generally known as Etherics, were taken from their home plane: the Thalakos , the Dauthi , and the Soltari . During the time of their planeshift, the Soltari were at war with the Dauthi, and the Thalakos remained entrapped in the conflict, despite their neutrality. None of them ever successfully made it to Rath. They were all trapped within the \" Shadows ,\" the extraplanar space between Rath and Dominaria. They were left in an incorporeal state, unable to communicate with people on either plane, yet able to see into both the Dominarian reality and that of Rath. This predicament led the Thalakos and the Dauthi to lose their sanity. The Soltari maintained a stable mental condition by following a religion that offered them peace and solidarity. Two more races from Dominaria, the Rootwater merfolk and the Skyshroud elves were originally at peace on a large construct floating in the oceans. However, this peace was shattered when the floating home of the elves and the merfolk was transported to Rath through the Rathi transplanar distortion, along with a large body of water. Once in the new land, the elves and merfolk began to run out of resources and eventually faced each other in armed conflict. The elves then used magic to create Skyshroud, a massive forest of mangroves that grew up from the sea that covered most of the water's surface, growing so dense that little sunlight came through. The merfolk were left to live in the deep swamps under Skyshroud. The body of water from Dominaria came to be known as the Riptide Sea. Skyshroud elves made their homes in the new forest, while the Rootwater merfolk descended into savage, carnivorous, and animalistic lifestyles warped not only by the lack of sunlight, food, or space but by secret experimentation from the evincar as well. Rathi Lin Sivvi translates to \"Striking Viper\". Karn Urza The plane's first inhabitants The Phyrexian invaders Davvol The crew of the Skyship Weatherlight , notably: Crovax Ertai Gerrard Capashen Hanna Mirri Orim Sisay Tahngarth Volrath Represented in: Associated cards: Quoted or referred to:"}