{"text": "Ravidel , called \" the Battlemage \", \" the Journeying Angel \", \" Breaker of Lands \", and \" Collector of Lives \" was a crazed, wicked and powerful planeswalker from an unknown plane. He initiated the Planeswalker War . Ravidel was born during the time of the Ice Age , somewhere among the twelve planes of the Shard . The calamities brought on by the Brothers' War threatened to wipe out Ravidel's people, and his parents thought it best to apprentice the young magician to the planeswalker Faralyn . This wizard accepted Ravidel as a spellsquire and set him to be the keeper of the Elder Dragonling he held in thrall – the Chromium Dragon Rhuell . Ravidel was embittered for being cast out of his homeworld. He would have chosen the dignity of suffering alongside his people rather than being exiled into the multiverse with a strange wizard. But he took solace in caring for Rhuell, and even under these extreme circumstances, the two became friends. It was one of the last times Ravidel would ever feel compassion for another being. Together with the dragon, Ravidel aided Faralyn in the study of the physics of the Shard. A resurrected Ravidel Eventually, Faralyn deduced a method of escape from the Shard. He led several other planeswalkers to the Summit of the Null Moon . Although most people present were told that they would find a way to puncture the Shard together, Faralyn, Tevesh Szat and Leshrac had already made their plans: they would manipulate the present planeswalkers into attacking one another, hoping that one of them would die so they could use their energy to escape the Shard to the plane of Shandalar . In the course of the battle, Rhuell was slain – and so was Ravidel. Faralyn used his spellsquire's life energy to escape from the Shard, leaving the young man's corpse behind. The planeswalker Kristina of the Woods cast a spell of resurrection and revived Ravidel with a fully-manifested spark . Betrayed by his honored mentor, his truest friend Rhuell lost to him, Ravidel went insane with grief and cursed Kristina with his enmity forever. Ravidel might well have become just another minor planeswalker were it not for the planeswalker Taysir , who was also at the summit on the Null Moon and a long-time friend of Kristina. For perplexing reasons, Taysir eventually found Ravidel and took him on as a spellsquire after his falling out with Kristina. Taysir was one of the most powerful planeswalkers ever, and his tutelage allowed Ravidel to grow in power exponentially. The pair spent some time tracking down the planeswalkers Leshrac and Tevesh Szat to exact vengeance for their slaying of Rhuell and Ravidel at the summit. They found Leshrac and trapped him in Phyrexia , but Szat stayed out of reach. However, Ravidel's hatred of Szat burned as strongly as for Kristina, and this did not rest well with Taysir. The planeswalker was in love with her and had hoped to reform Ravidel to some degree. This was not going to happen. Taysir, discouraged, eventually tired and cut Ravidel loose to continue as he saw fit. Ravidel took this to mean he was entering a new phase of his apprenticeship, and began a series of conquests throughout the multiverse, collecting artifacts and perfecting his dueling skills. Returning to Dominaria, he crossed paths with the Ash Warlord Embereck , one of that world's most powerful planeswalkers, and they dueled over the fabled Argivian Sylex amidst the submerged ruins of a city in Terisiare . Ultimately, Embereck defeated Ravidel but allowed him to leave with the Sylex. Ravidel explained that he needed the Sylex to take revenge on those who had wronged him (Szat and Kristina), and the honor-driven Embereck sympathized. He would soon come to regret his poor judgment. Over the next few centuries, Ravidel would occasionally visit with Taysir and continue his training. Taysir consented to this reluctantly, but he gave little thought to Ravidel or his desire for vengeance, considering him just another hotheaded young planeswalker. As the last vestiges of the Ice Age disappeared on Dominaria, a new age was dawning. Many of the world's greatest wise people gathered in the Haven of Minorad , the northernmost habitable point in Corondor , to share their knowledge and document the passing of time. The new Corondor calendar was established, and the date of the meeting was declared Year One of a new age. Ravidel attacked this Summit of Minorad and hatched an insidious plan. He used the Argivian Sylex to blackmail his arch-foe Kristina, as well as the Ash Warlord Embereck, Grenfell Mor of Golthonor, Altair of Coloni , and Liana of Minorad , all-powerful planeswalkers – into his servitude. He did this by using the Sylex to threaten the butchering of all Minorad's sages. The last bastion of Corondor's knowledge would be destroyed before their eyes, and the new age would end before it began. Ravidel's demand was deceptively simple: to be left alone to perform his business on Dominaria, no matter the nature of that business. Seeing no alternative but further violence (and perhaps racked with guilt over Ravidel's current condition), Kristina convinced most of the planeswalkers to acquiesce. Only Embereck refused and vanished with a vow of vengeance against Ravidel. Taysir had no inkling of what his apprentice was up to. He next saw Ravidel some years later, when Ravidel gleefully brought him the news that Kristina had taken a lover. Ravidel brought Taysir to the woods of Corondor, where they witnessed Kristina walking with her new love: a young planeswalking minotaur named Sandruu . Enraged, Taysir attacked Sandruu at the next opportunity. The battle occurred on Ulgrotha . In the end, Sandruu was banished to a distant plane for centuries, and Taysir was slain by the guardian of the Homelands, Feroz . Kristina knew none of this. Taysir's spirit lived, however, and later returned to the world of the living. Ravidel had now lost his master Taysir, whom he greatly respected and admired. He decided to finish Taysir's abandoned quest: the destruction of Tevesh Szat. To this, of course, Ravidel added several embellishments. He wanted to destroy Kristina and all other planeswalker foes, to establish a stranglehold on all of Dominaria. He remained on Dominaria, gathering his power base in Corondor. He corrupted Lord Adam Carthalion and eventually killed him at the Battle of Aster Fall . Ravidel used the Carthalion family's power to undermine the rulership of Corondor and worked towards the day when he would rule the continent. When resistance in the Corondoran city of Arathoxia grew too great, Ravidel launched an all-out assault on the city. This resulted in the city's destruction and the slaying of the Scarlet Vizier . Adam Carthalion's young son Jared , who had been living in the city amongst a band of street urchins, finally puzzled together enough of his secret past to realize Ravidel was his arch-enemy and escaped the conflagration. A series of occasional battles between Jared and Ravidel followed; battles which also involved Jared's new mentor Kristina and several other planeswalkers. In the end, two of these brave heroes – Liana and Altair – died at Ravidel's hands. In the final battle, Ravidel secured several powerful magical artifacts known as Moxes . Ravidel hatched a long-term plan to erect a Mox Beacon with the Moxes, thus drawing all planeswalkers that had ever harmed him to Dominaria so they would slaughter each other. In particular, he sought to draw the attention of Tevesh Szat so that he, at last, could take his revenge. Ravidel was destined to succeed in drawing Szat to Corondor. A tremendous war was at hand, with numerous planeswalkers stepping up to stop Ravidel – or join him. Ironically, in his quest, he had created his nemesis by robbing Jared Carthalion of his title, his wealth, his parents, and his friends. Jared was taught by Kristina and became her lover, and the two went on to lead the fight against Ravidel. The end of the Planeswalkers' War , and thus Ravidel's ultimate fate, is unknown, but Kristina is known to have survived it. Ravidel's home plane within the Shard of the Twelve Worlds Dominaria"}