{"text": "Rebbec was the chief architect of the Thran Empire 's capital of Halcyon on the plane of Dominaria . She was the wife of master artificer Glacian . Both of them were part of the 28 leaders , a group of people who had proven their worth to the empire and who would decide on matters if the council of elders could not agree. When her husband was stabbed with a powerstone by Gix , one of the Untouchables , he became ill. None of the Thran healers could cure him, so Rebbec used her influence to have the eugenicist Yawgmoth return from his exile. Yawgmoth discovered that Glacian's disease, which he called phthisis , was caused by powerstone radiation. This discovery led to an insurrection of the Untouchables, who had almost all contracted the disease due to living under the Mana Rig Glacian had built. Yawgmoth found a cure, which put him in a bargaining position with the rebels . Since all technology of the empire was powerstone-based, more and more people began contracting the disease and Yawgmoth used this to increase his influence, even joining the council of leaders. He deliberately diluted the serum he was giving to the Untouchables to cause another insurrection and used devices the sick Glacian had thought up to quell it and take over the Halcyte Guard. While this was happening, Rebbec was building the Thran Temple , a gigantic structure hovering over Halcyon. While Glacian was starting to become delusional, paranoid, and amnesiac because of his disease, Rebbec and Yawgmoth started falling in love, although neither of them acted upon it. Then one day a delegation of elves , dwarves , barbarians , catfolk , Viashino and minotaurs arrived in Halcyon. Yawgmoth had manipulated or even killed all their leaders during his exile and now that he was getting more and more power in the empire, their nations had allied themselves with the Thran city-states that opposed Yawgmoth. They threatened to go to war with the Thran Empire if they did not surrender Yawgmoth to them. The council voted on whether Yawgmoth could stay, but the votes went 50/50. Only because Yawgmoth and Rebbec were members of the 28 leaders themselves was Yawgmoth allowed to stay. He immediately overthrew the council and imprisoned its elders, as well as the delegates. While preparing for the war, the planeswalker Dyfed cracked a powerstone to open a permanent portal from Dominaria to Phyrexia , the plane that Yawgmoth wanted to make his paradise. He asked Rebbec to construct a new infirmary on this new plane. 9000 years later this infirmary had become Gamalgoth , the first city of Phyrexia. But while Rebbec created this masterpiece, Yawgmoth hid the two halves of the powerstone Dyfed had cracked inside Glacian's wounds to accelerate his disease, hoping to be able to claim Rebbec for himself. Yawgmoth was initially successful in the war, but he displayed more and more cruelty, even bombing Phoenon , a city-state that had voted pro-Yawgmoth, after it had fallen to his opponents, killing all invaders and civilians alike. Rebbec traveled to Phyrexia, where Yawgmoth somehow merged himself with her, saying they could rule Phyrexia together. Rebbec refused him. Yawgmoth was furious but had to get back to Halcyon , for the city was under siege. Phyrexia still saw Rebbec as an equal of Yawgmoth due to the recent merger, allowing her to wander the plane freely. What she saw horrified her. On the surface, Yawgmoth had been trying to cure and improve people, but in the lower spheres of the hollow plane, she found the delegates he had imprisoned were mutilated. In addition, Dyfed had been stabbed in the skull with a powerstone knife so Yawgmoth could vivisect her to look for her \"planeswalker organ.\" The disgusted Rebbec removed the knife, allowing Dyfed to die, and then traveled back to Halcyon. She found Glacian dead and discovered the powerstones Yawgmoth had implanted in him. She also found that Yawgmoth had released an all-consuming cloud of energy upon the armies besieging Halcyon and that the controllers of the Null Sphere had rebelled and committed suicide by launching the Sphere into orbit. As all the people of Halcyon were either dying from the cloud or had fled to Phyrexia, Rebbec placed the powerstone that had been inside Glacian on the pedestal where Dyfed had first split it. This would seal Yawgmoth and the Phyrexians away from their home plane of Dominaria. She then ascended the stairs of Halcyon into the white cloud of all-consuming energy. During Yawgmoth's return to Dominaria, he made allusions to the natural spirit of Gaea being Rebbec. Yawgmoth also made allusions to Weatherlight being the spirit of Gaea. Due to the incredible unlikelihood of this being the case, it is commonly regarded by storyline fans as a delusion of the insane being. Though not a planeswalker, Rebbec traveled through the Multiverse using the portal to Phyrexia. Dominaria Phyrexia Quoted or referred to:"}