{"text": "Reveka is the current Wizard Savant and Director of the Wizards' School on the Floating Island . Unbeknownst to her, she is the great-grandniece of Irini . Thanks to her skills of sorcery, wizardry, artifact creation, research, astronomy, alchemy, and other magical arts, she managed to win the position from the previous Wizard Savant in a most unusual challenge - a riddle contest based on astronomical knowledge. Having grown up on one of the ships of the Clan of the Gentle Wave , and with three hundred years of astronomy and sailing experience, the young Sea Dwarf woman won the contest in less than an hour. Reveka is known for her determination and ambition. She is a wise woman, an excellent teacher, and a guide for all the students of the Wizards' School. Thanks to her strong temper and cunning mind, she maintains a careful balance amongst the Council of Wizards that rules the Floating Isle and has the final say on any issues that the members of the Council disagree on. She is also in charge of maintaining the spell that keeps the waters free of warships from Aysen , Koskun or the Dark Barony , and of maintaining relations between the surface folk and the Seafolk that dwells under the sea. Reveka is also rumored to have an ancient text on how to turn an ordinary pearl into an artifact of incredible power, and that she has been creating and hoarding these devices for well over forty years in anticipation of the time when she will need to defend or take control of Aysen. While the previous Wizard Savant was a spineless little bastard with no real morals or compunction to maintain balance, Reveka wants to re-establish a good position for the School among the cultures of the Homelands at nearly any cost but trusts no one's council save her own. She does have the best intentions, but her methods are manipulative and she will do nearly anything to maintain the careful political alliances forged through the years.\nIf the Wizards' School doesn't become a political power, it is in danger of being usurped by either of its \"allies\" at best or being economically destroyed by Eron the Relentless at worst. The only way that the Wizards' School would survive is through subtle control over the rest of the world, taken piece by piece. The Wizard Savant has no intention of seizing dictatorial control anywhere, but she realizes that she needed to have spies and contacts everywhere. She has no choice: she must play a full-scale game of intrigue and try to keep the world from war at the same time. For this, she has traveled to Onella , to Castle Sengir and met ambassadors from Koskun Keep to try to put an end to the feud between the goblin wizards and her people. She even personally sailed a ship through the winter storms to bring food to the inhabitants of Kerselin . In her attempts to maintain this balance and gain a toehold in the political arena, Reveka is also quite conscious of the fact that the Wizard Attendants in the school have the right to challenge her for Directorship, just as she had challenged the previous Director. If one of them would win such a duel, it could mean her exile, the fall of the Wizards' School, and the eruption of open war between Aysen and Baron Sengir . In the original backstory of Homelands , Reveka was named Roveka. Quoted or referred to:"}