{"text": "Rofellos was an elf from Llanowar that was best known for his time aboard the Skyship Weatherlight . Rofellos was sent to Yavimaya to foster relations between the two forests by helping build up Yavimaya's defenses for the coming Phyrexian Invasion . When he arrived, he exchanged places with Multani as the voice of Yavimaya, allowing Multani to go abroad in the world and learn from the crew of the Weatherlight. Yavimaya had a profound effect on him, but he too deeply changed the nature of the forest. While under his guidance, the occupants of Yavimaya became much more militant, and the growth cycle increasingly aggressive. When Multani returned to reconnect with his homeland, he found it an almost alien place, and himself at odds with Rofellos through no fault of theirs. With two guiding minds, Yavimaya had to choose, and unable to deal with being the avatar of a living forest, Rofellos stepped down. In gratitude for helping Yavimaya as much as he had, Multani offered to teach him the secrets of Maro-Sorcery. Soon afterward, Multani took on additional students, and Rofellos studied alongside Gerrard Capashen and Mirri under the tutelage of the forest guardian. The pupils became good friends, so when Gerrard left the forest to join the Weatherlight crew in search of The Legacy artifacts, Rofellos and Mirri offered to come along as well. Rofellos found himself well-liked among the Weatherlight hands, but also kept himself guarded, never revealing how he had come to study under Multani or why he never returned to his homeland. Rofellos was killed when the Weatherlight crew tried to aid Crovax 's family in fighting off the horrors Morinfen and Gallowbraid . The crew was unable to defeat the creatures before Gallowbraid murdered Rofellos. His death was directly responsible for Gerrard's decision to leave the Weatherlight and have nothing more to do with his legacy, and truly, Gerrard never got over the death of his close friend. Depicted in: Quoted or referred to:"}