{"text": "The Roil is the periodic volatility of the earth and climate, resulting from Zendikar 's unique brand of mana . The Roil changes the land and is the reason why the plane remains untamed and deadly. Because it is magical, the Roil affects biology as well as geology and meteorology. Merfolk are the only Zendikari race innately able to sense the Roil. The effects of the Roil include: Rock crags. Large boulders and shards of rock erupt from the earth Extreme weather like dust storms and tornadoes. Floods and tidal waves. Sinkholes. Noxious gas geysers. Meteoric growth (\"Life Blooms\"). Tectonic shifts and earthquakes. Occasionally the Roil animates as elementals . Lullmages and roilmages are elementalists who can influence the effects of the roil. The Roil originated by the plane itself as a defense system against the Eldrazi when these creatures first walked the plane. For those born on Zendikar, the Roil seemed a natural phenomenon — just the way things were. To planeswalkers, it was obvious that this volatility was what keeps Zendikar dangerous, untamed, and without well-developed civilizations. During the Rise of the Eldrazi , the Roil intensified, and it soon became clear that the Roil was Zendikar's effort to purify itself of corruption. In their fight against the Eldrazi, the elementalists led by Noyan Dar used the Roil as a weapon. Like an inflammation that persists after the infection is gone, the Roil remains active even after the destruction of the Eldrazi , and it remains one of the greatest hazards to adventurers who brave the wilds of Zendikar. Directly after the defeat of the Eldrazi, it seemed to be gone. But then it slowly began to return. The guilt-ridden planeswalker Nahiri sought to destroy the Roil, setting her on a path of conflict with Nissa Revane , who had befriended Zendikar's elementals. In the end, Nissa Revane prevailed, and restored the soil and wild nature of Zendikar by use of the Lithoform Core . When Zendikar became a target in New Phyrexia's Invasion of the Multiverse , the Roil once again rose against the now compleated planeswalker Nahiri. She managed to counteract its effects by turning an entire landscape into stone. Associated cards: Referred to: Deadly Perils, Priceless Treasures . magicthegathering.com . Wizards of the Coast (August 12, 2009). Doug Beyer (March 29, 2010). \" The Eldrazi Arisen \". magicthegathering.com . Wizards of the Coast."}