{"text": "Rootha Squallheart is a female orc and mage -student of the Prismari college of Strixhaven on Arcavios . Rootha is a unique and distinct individual with long vibrant colored hair and skin tinted with red and blue hues. Her clothes are expressive and dramatic, often consisting of scarlet fire and aqua-blue water elements. The clothes mix as though she were a painted ocean of lava. Rootha is unsurprisingly artistic, but can sometimes be hot-tempered, matching the flames she wears. She is the fifth generation of her family to be in the Prismari school. She seeks to break free of her family's reputation and make her art. She's impulsive and fiery, with her hair and clothes colored to reflect her position in Prismari, but she's also deeply self-critical and unsure of herself. Rootha has trouble completing her work and handing it in on time for critique, most of her professors have little choice but to chase her down on campus to warrant a glimpse. She claims that her work is never ready – forever conscious that it isn’t quite right. In true self-critic style, Rootha commonly becomes infatuated with a great visionary idea which she spends weeks working on … only to decide she hates it, causing her to destroy her creation in mere moments. With her mother, Samara Squallheart , being a famous, talented caster, Rootha is under pressure to live up to the achievements of the rest of her family line. She carries a heavy weight on her artistic shoulders and the constant link and expectations caused by her family can be frustrating, sometimes anger-inducing. She wishes to break free from her family association and follow her style. Her mother could weave intricate sculptures made from ice and water, but Rootha has wild magic; she can flash freeze water in one magnificent burst. Under the guidance of Dean Nassari , she is learning to embrace her wild magic, to push herself beyond her limits, to seek recognition and fame for her creations rather than those of her ancestors. When New Phyrexia's Invasion of the Multiverse started, the Phyrexians quickly burned through the defenses of Strixhaven. Professor Vess tasked a small group of surviving students - Rootha, Quintorius Kand , Zimone Wola , Dina and Killian Lu - to search for the Invocation of the Founders in the Biblioplex. The group found it and with a representative from each school they could activate it, but the compleated Nassari distracted Rootha enough that Quint could only try to make up her contribution with raw magic and lifeforce. The result was not entirely successful, and in the process, Quint's spark ignited and he planeswalked away. Though the invocation managed to repel the main wave of attackers, Rootha was severely wounded. Rootha appears in the trailer for Strixhaven: School of Mages . Depicted in: Quoted or referred to:"}