{"text": "Samut , the Swift , is a former planeswalker from Amonkhet . She is a renowned warrior and specializes in speed-based magic. She is the current vizier of Naktamun . Samut is a dedicated warrior, thinking of protecting her plane and people at all times. Even when the end of the world seemed to be upon them, she never ran from the battle, going as far as to openly denounce the \"god\" that ruled their world, rallying the survivors against the tyrant. She still upholds the customs of the plane, like honoring the dead. She found people smashing the defeated Eternals to be insulting, and urged for them to be cremated with honor instead. Samut is centered in both green and red mana. Samut was born on Amonkhet , in the city of Naktamun . As a child, she was best friends with Djeru and Nakht . When they came of age, all three became initiates of Tah crop , a group that would train with the ultimate goal of passing the Trials of the Five Gods . Sometime before her initiation into Tah crop, Samut found a forgotten district of Naktamun, which became her secret place. In the forgotten district, Samut found hieroglyphics and murals different from those in the rest of the city which seemed to be much older. She studied one of the old murals, believing them to show forgotten martial arts forms. Just after she, Djeru, and Nakht became initiates of Tah crop, Samut shared this secret district with her friends. Djeru expressed caution and trepidation, but both Samut and Nakht were curious and believed the forgotten areas were worth exploring. That same night Samut, Djeru, and Nakht went to a small hole in the Hekma that Djeru had discovered. Though Djeru objected again, the three of them left the protection of the Hekma through this gap and ventured out into the desert wastelands beyond the city. Out in the deserts, the trio found a fallen and weathered statue half-submerged in the sands. Beyond that, they found numerous ruins that seemed to be ancient by the standards of Amonkhet which had been weathered greatly by the sands. They also began to see the dangers beyond the Hekma for themselves, in the form of a giant monster that stood \"taller than the gods\". In the ruins, Samut and Nakht saw the symbol of the God-Pharaoh carved into the wall, fresher than all the other glyphs, and accompanied by the scrawled symbol for the word \"Trespasser\" . As they decided to leave and hurry back to Naktamun, countless zombies rose from the landscape around them and trapped the children in a building as they barricaded the door. Nakht used his blue magic to control the water nearby and distract and hold off the zombies, urging Samut and Djeru to run. Samut fled, but watched as when Nakht tried to join them, the horror they had seen before returned. Samut watched one of her best friends die, as Nakht \"instantly withered and decayed, drying into a lifeless husk\" before her. Djeru tackled her and kept her from being seen as well, and the two fled home to Naktamun. After seeing Nakht die, Samut was devastated by the senseless loss, and she \"took up the mantle of doubt and questions, of seeking solace and clarity in the past rather the ceaseless march toward the future and the After.\" The Voice of Dissent Samut and Djeru became initiates of Tah crop and trained to undertake the Trials of the Five Gods, but neither forgot the fateful day of Nakht's death. Samut's search for truth brought her back to the mural she had found over and over. Whenever she missed Nakht, she delved deeper into the forgotten, abandoned history of Naktamun. With every new thing she gleaned from the ancient parts of the city, doubt seeded deeper in Samut's mind about the Trials and the nature of the gods of Amonkhet. At some point, Tah crop began undergoing the Trials of the Five Gods. During the Trial of Strength , Samut took down \"a manticore practically by [herself]\". One day, Samut's search brought her to a sealed chamber deep within Bontu 's Monument. There, in a place both forbidden and forgotten to all, she found a glyph she had not seen since her childhood; the symbol \"Trespasser.\" At that moment, Samut realized the truth about Amonkhet and its perceived history: \"The God-Pharaoh is the Great Trespasser.\" Samut realized the God-Pharaoh was not a savior, but the destroyer of the plane of Amonkhet. She realized he had altered the memory of the gods, and the history of the plane. Samut told Tah crop that it was all a lie; the trials, the gods, the hours , everything they knew about the God-Pharaoh. She abandoned the trials, and Tah crop, and was labeled a dissenter for what she said. Pursued by the crop for her blasphemy, Samut ran through Naktamun, shouting her decree of the God-Pharaoh's lies. Nissa Revane spotted her in the crowd, and she and the rest of the Gatewatch witnessed as Samut ran through the city on one of their first days on the plane, though they did not step in to help at the time. Samut leads the survivors after the Hour of Devastation. Three days after abandoning Tah crop, Samut reached out to her childhood friend Djeru to listen to what she had to say. She met him in a former embalming chamber and tried to convince Djeru of the falsehoods in the Amonkhet religion. Djeru tried to convince her in response to repent for her dissension. He held too much faith in the laws of the gods and the promises of completing the trials to heed what Samut said. She tried to convince him not to go to the final trial; the Trial of Zeal . After arguing, the two parted, both expressing hope of changing the other's heart. When she failed to convince Djeru, Samut went to the temple of Hazoret to plead with the goddess to spare Djeru's life at the end of the final trial. She spoke to Hazoret and tried to remind her of who she had been - the Mother of Zeal and Nurturer of Hearts - before the God-Pharaoh corrupted and altered the gods. Hazoret could not remember the time before the God-Pharaoh and appeared unmoved by Samut's words. The god called for Samut to be imprisoned, and she was sealed inside a sarcophagus alongside other dissenters. Samut was saved from this prison by the Gatewatch's arrival. Chandra and Gideon opened her sarcophagus and helped her out. The Gatewatch discussed their next move and argued about the presence of Liliana 's third demon before Samut interrupted, shouting at the Gatewatch to follow her, as she was the only one with any semblance of a plan. Mere moments later, all five gods of Amonkhet arrived for the final running of the Trial of Zeal before the Hours began and the God-Pharaoh returned. Under Samut's leadership the survivors kill the Scorpion God and save Hazoret. Samut, the Gatewatch, and the other dissenters were brought to a great arena before the full pantheon of gods. There, they were pitted against Tah crop and Djeru as the heretics for the initiates to slay as their final trial. Under the influence of Hazoret's magic, they were all forced to fight. Even with her mind bent by the magic only to combat, Samut ran to Djeru's side, and the two fought back to back, Samut's only goal being Djeru's survival. Djeru prayed aloud as they fought, and Hazoret watched him and Samut throughout the battle. As his final prayer, Djeru begged for Samut, his dearest friend, to be forgiven and shown mercy. Hazoret heard his prayer and told Samut and Djeru to approach for their reward: a glorious death. At the last moment, as Hazoret lunged her spear forward to kill Djeru, Samut leaped and tackled her friend away, denying him the death he had sought for so long. Gideon intervened at the same moment, protecting the pair of them from Hazoret with his invulnerability. Djeru was devastated by this, and he screamed at Gideon and Samut for robbing him of his death. Samut spoke to Hazoret, saying she believed in her, that she believed the gods of Amonkhet were good, and that they had to wake up to the truth they had forgotten. Moments later, the Revelation occurred, and the Hours began. In the Hour of Devastation, Samut joined forces with Djeru when the attacks began. Together with Hapatra , they witnessed the death of Rhonas , Kefnet , and Oketra . Afterwards, they were commanded by Hazoret to protect the survivors, to evacuate the city and to hide among the desert sands. Samut's planeswalker's spark ignited when she saved Hazoret from the Scorpion God , and was overwhelmed by euphoria and joy after being thanked by her deity. Samut's Sprint Samut was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . For her, the war was intensely personal. In the Dreadhorde she faced enemies she once had loved as friends and horrors she had once revered as gods . During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize.  When some of the Ravnicans proposed surrendering to Bolas to prevent further destruction, Samut and Vivien insisted that surrender was not an option; given what Bolas did to their home planes, they knew that Bolas would conquer or destroy Ravnica simply for his satisfaction, even if he got what he wanted. At Jace 's recommendation, they decided to split up into teams to focus on specific tasks. Karn , Ob Nixilis , Dack Fayden , and Samut volunteered to go through Bolas' Planar Bridge to Amonkhet and shut the portal down from the other side. While Nixilis and Samut fought off the Eternals, Dack distracted Tezzeret, giving Karn an opening to fly one of Saheeli's explosive micro-drones into the Bridge control mechanism in Tezzeret's chest. The portal collapsed, and the wounded Tezzeret revealed that he was glad they defeated him: he hopes they succeed at killing Bolas so he can finally be freed from his servitude to the dragon. With that, Tezzeret planeswalked away. The planeswalkers were then visited by the god Hazoret , who arrived with the rogue planeswalker Sarkhan Vol . At Sarkhan's request, Hazoret gave them her spear to aid them in their fight against Bolas. Samut was pleased to find out that Hazoret had restored the Hekma and sheltered Amonkhet's survivors in the ruins of Naktamun, where they would once again be safe from the horrors of the desert. Before returning to Ravnica, Samut promised Hazoret that she would come back to Amonkhet to continue protecting her people. Samut was one of the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. She survived the battle and was present during the Planewide Celebration that followed. At her behest, Chandra and Jaya cremated the bodies of the now-inactive Eternals. Samut participated in the memorial service for Gideon on Theros . Upon hearing of the news of the Phyrexian threat to the Multiverse , Samut went into hiding with Hazoret and the survivors of Naktamun. She lost her spark in the Great Pruning . Samut owns a pair of khopesh . Amonkhet Dominaria (non- canon ) Ravnica Theros Associated cards: Depicted in: Quoted or referred to:"}