{"text": "Sarkhan Vol is a human former planeswalker hailing from Tarkir , a plane scourged by war. He is fascinated by dragons , something that has been a blessing and curse to him throughout his life. Sarkhan Vol is a middle-aged, battle-scarred warrior with long hair. He occasionally wears dark-painted fingernails. He can transform into a dragon. He can also change his hands into fire-spewing dragon heads. Sarkhan was originally a soldier, thirsting for power and status, which drove him to seek out a more meaningful status than a pawn. This desire led him down a twisted path, starting when Ugin first contacted him. Driven to find a dragon to worship, he was found by Bolas who manipulated that desire to reduce the prideful Planeswalker into a mindless pawn. Seeing the destroyed body of his peer, Tezzeret, and Bolas's carelessness about those beneath him, Sarkhan found his spirit broken. Only after stumbling upon Narset, where the monk's wisdom and peace helped him focus his shattered mind, did Sarkhan find a means to elevate himself beyond his current status and get revenge on the dragon that manipulated him, by seeking out Ugin and bringing about the downfall of his old master. He is primarily red -aligned. While his mind was broken by Bolas, he had access to black mana. Early on in his life, Sarkhan was a soldier but sought something more than the life of an expendable pawn. He quickly rose in position and power in the Mardu Horde until he came to claim the title of general in his warlord 's army. Growing sick of the endless blood, he set aside his spear and traveled away from the tents. Up into the Qal Sisma mountains , he joined the Whisperers, a clan of shamans that venerated the dragon as the ultimate predator. He found some level of peace, but quickly grew bitter because of the futility of worshipping an extinct beast. When he returned to his warrior life, the Helmsmasher grudgingly sent him forth with a wing of riders to challenge the Sultai . Upon this first expedition, he was touched by an ancient dragon spirit in a trance after having slain the opposing commander. Sacrificing his men, he unleashed a massive spell that wiped the battlefield clean as he ascended , channeling the power of the spirit he'd connected to. This was to be his first and last battle as a general, as he was stripped of his position, leaving no connection left to bind him to that plane. Sarkhan Vol After many years of searching the planes, he found Jund , a place where dragons reign, and continued his quest to find a worthy dragon to pledge his loyalty. For two years, he searched, and during his quest, he found himself under Mount Jhal standing in the path of Kresh and Rakka Mar in their fight against the hellkite Malactoth . He assisted them in vanquishing the dragon, unknowingly assisting Rakka in her secret mission. Buried in the cavern, Kresh glimpsed the Obelisk of Jund before everything went black. Cruel Ultimatum - Bolas breaks Sarkhan's mind Days later, after having escaped the collapsed cavern with Rakka's help, Sarkhan encountered the newly ascended Ajani and spared the leonin from the dragon Karrthus . He explained to the traveler what he had become, as well as the fury of red mana and the merits of vengeance. Taking wing, Sarkhan left Ajani to his own devices and sought revenge against Rakka Mar for her part in what happened in Malactoth's cavern. Eventually, he did indeed find her, but she presented him with a unique opportunity to meet her master and led him to a mountain rife with goblins . Atop this mountain, he met Nicol Bolas and stood in awe of the dragon's power, though his methods were far removed from what he knew of most dragons. Upon that spot Sarkhan swore his allegiance to Bolas and exchanged blood with the dragon, gaining more power than he had imagined from the transfusion. He was given the task of activating the Obelisk of Esper . As a reward for that task, Bolas presented Sarkhan with a flight of 5 dragons, one of which was the brainwashed Karrthus. At this point, Sarkhan began to doubt his allegiance to Bolas but followed through with the next step of Bolas's plan: to goad Naya to war with Jund. He came into conflict with Mayael the Anima 's armies of behemoth and arrived in time to see Bolas absorb the mana of the Maelstrom and be defeated by a duplicate avatar of himself. Seeing his master defeated caused something within Sarkhan to snap, and his mind started to unravel. After the debacle on Alara, Bolas sent Sarkhan to follow the trail of Liliana Vess as she ravaged kingdoms, fueled by the power of the Chain Veil . The extent of the dragon's interest in her is unknown. At some point on an unknown plane, he watched as she left to kill Kothophed and reported to Bolas on this. Sarkhan in his traditional armor. Under Bolas's order, Sarkhan found himself on Zendikar wandering the Eye of Ugin . While in the tunnels and caves, he reminisced about his time as a soldier and spoke to himself, wondering about his purpose and what fortune had in store for him. Very specifically, he wondered if he was being punished by Bolas for some failure on his part. Throughout his time in the Eye, he seemed to be in a hallucinatory state, but eventually, he became lucid in time to save Chandra Nalaar from an attack by the vampire ruin sage named Anowon . He proceeded to threaten Chandra before she detonated a spell next to him, and though it failed catastrophically, he was impressed with its power. He led Chandra deeper into the heart of the Eye, explaining what it was and finally revealing his true agenda as he spoke to whatever voice he had been speaking to in his previously delusional state. He transformed himself fully into a dragon and attacked Chandra, intending to sacrifice her to the voices. His plan was foiled by the sudden appearance of Jace Beleren , who had no clue that Sarkhan is anything more than a dragon. The confluence of these three triggered a reaction from one of the Hedrons, which began to absorb their magic, and when Jace and Chandra discovered Ugin's invisible fire, hinted at in the Dragon Scroll , they used it to defeat Sarkhan.  But this action unwittingly opened the last lock of the Eldrazi confinement spell. Chandra left hurriedly and Jace followed shortly after making sure the unconscious Sarkhan, back to his human form, was alive. Sarkhan in dragon form. Sarkhan woke alone in the chamber and reflected upon his defeat while making his way to the top of the mountain where the Eye of Ugin lay. There he found the rotting corpse of a dragon that a group of Eldrazi spawns was being birthed from. Sarkhan enraged at the scene, fulminates against the spawn and bids peace to the corpse of the dragon. However, the spirit of the fallen dragon appears and taunts Sarkhan with threats of the punishment Bolas will inflict upon him for having failed his mission. Sarkhan cannot discern and does not seem to care if the dragon is a hallucination of his mind or the remnants of the fallen beast. Sarkhan returns to the Eye of Ugin to try to find a way to restore it only to begin wondering if Bolas's secret purpose was for him to activate it all along, as he realizes that the confluence of planeswalkers was what triggered the Eye. Returning to the central hedron, he remembered that as he battled Chandra in his dragon form he could read the runes on the hedrons. Filled with new resolve he returns to his complete dragon form and blasts the taunting dragon spirit. Sarkhan breaks off a large chunk of the floating hedron and 'walks away to meet his master. The shaman arrived upon Bolas's Meditation Realm and hoped to leave his hedron prize unnoticed. Minions, tiny impish effigies of Bolas, appeared around Sarkhan and taunted him until Sarkhan was forced to meet his lord. As he traversed the strange landscape Bolas spoke in his mind, debriefing him and learning the true extent of the events that transpired on Zendikar. Finally, Sarkhan arrived at the heart of Bolas's power, a massive floating Keep. The shaman called upon his wings once again and bows to his master, hoping to deliver his trophy and be done with his punishment. Sarkhan waits in vain as Bolas revealed he intended to free the Eldrazi all along, having manipulated events to unlock Ugin's work. Further, Bolas claims to have dealt with Ugin much to Sarkhan's surprise. When it finally became clear that Bolas has no plans to harm Sarkhan at the moment, the dragon dismisses his pawn, showing Sarkhan the twisted form of Tezzeret with a smile and assured him that he always took care of his minions. His mind broken, Sarkhan returned to his home plane of Tarkir , to see if he could rekindle what he loved most about dragons. After wandering through Tarkir his mind was constantly besieged by Ugin's visions. At some point, he passed by several Temur warriors whom he infuriated. Eventually, in his madness, he entered Jeskai lands and was quickly found by Narset, Khan of the Jeskai. Narset had been guided to him by visions of her own and a kirin. Narset's gentle nature helped Sarkhan to focus his mind temporarily. However, in his madness, Sarkhan revealed the secrets of planeswalkers and other worlds to her. He spoke of Nicol Bolas who had killed Ugin over a thousand years ago. Narset herself who has seen visions of other planes confided in him that Ugin was Tarkir's soul and with his death, the plane was thrown out of balance. Narset helped calm his mind and provide him peace before agreeing to bring him to Ugin's Tomb. During their journey, they formed a bond of respect and friendship. At the tomb, they were attacked by a maddened Zurgo Helmsmasher who attempted to kill Sarkhan in revenge for Sarkhan's actions during his ascension as a planeswalker. Narset fought off Zurgo and injured him before urging Sarkhan to enter Ugin's Nexus, promising to guard his passage. At the apex of their fight, she was accidentally distracted by Sarkhan which enabled Zurgo to land a killing blow. With the last of her strength, she urged Sarkhan to keep moving into the nexus. Horrified at this, Sarkhan continued into the Nexus while cursing Zurgo and swearing revenge on the orc while mourning Narset. Reaching the blazing gate at the end, and after a flash of light, Sarkhan vanished. Sarkhan returns the moment Bolas defeats Ugin. Sarkhan crash-landed in the middle of a vast, snowy Temur tundra alone. More alone than he could have suspected, as he quickly realized that Ugin's voice was completely gone. As he roared his fury towards Ugin's silence demanding answers, a sudden violent storm appeared and from within it, Sarkhan was stunned to see several dragons emerge. With their appearance, Sarkhan realized that he had arrived in Tarkir's past. With tears of joy in his eyes, the Dragon-shaman quietly thanked Ugin for giving him the chance to see this. The dragons led him onwards until they encountered their broodmother . Sarkhan watched as the dragons attacked a Temur encampment and were enchanted by their destructive power. However, his revelry was short-lived as a magical, glowing claw ripped through the sky like a bolt of blood-red lightning, tearing into the sides of the dragon fledglings. He watched as the claw's wielder killed the dragon. Horrified, Sarkhan prepared to attack and assist the majestic beasts, but he remembered Narset's words, claiming that Tarkir had been stronger with the dragons and this was evidence of that strength. Sarkhan began to follow the Temur woman who had routed the dragons. The woman left several strange double curve marks burned into the ground with her staff as she walked, making her easy to follow. Confused, he contemplated that she could be Ugin's herald and was leading him to the Spirit Dragon, but that thought fled when Sarkhan was attacked and trapped by the woman's saber-toothed cat. She demanded to know why Sarkhan was following her. He informed her that he was following Ugin's whispers and thought her to be his spirit guide, and she called him mad to think such a thing. The woman introduced herself as Yasova Dragonclaw , furious with him as he had insulted her while trespassing in her lands and demanded a reason to spare his life. Sarkhan quickly begged for his life stating that he had only heard of her by reputation and apologized as he was a mere beggar who had insulted her. Both pleased and disgusted, Yasova bid him stand and spared his life with a warning that she would forgive his delusions but would not tolerate further disrespect, permitting him to follow her if he wished. Eventually, he saw her making another marking and inquired what the symbol meant. She retorted that she will only do so if he tells her of the whispers that he has been following. Sarkhan told her of visiting the Eye of Ugin but obscured several details by lying that it was on Tarkir and how it led him to her. His question about the dragonstorms shocked her and his reply to his 'homeland' having none of these caused her to reply that he was mad. He attempted to use the Temur concept of The Unwritten Now, taught to him by Chianul to make her understand. With such an explanation, Yasova quickly realized that Sarkhan was from Tarkir's future and eagerly questioned him about the extinction of the dragons. She then stated that it seems to be true that if Ugin dies, the dragon storms would stop and dragons would become extinct. A wary Sarkhan now understood the connection but questioned her on how she received this information. He quickly backtracked and tried to plead to her pride that the people of the future were weak shadows of her. This further aggravated Yasova; she demanded knowing how a life spent cowering in fear made her better than those who need not fear the very skies. She became so angry that she nearly struck Sarkhan down once more, but stayed her hand as she shared with him a vision of her own. A vision of Tarkir with no dragons, fields choked with dragon bones, skies with no more storms, no more fighting, no more war. The Temur conquered Tarkir and her female descendant became the High Khan of Tarkir. Sarkhan saves Ugin using a hedron. The voice in her visions told her how to accomplish this. Sarkhan was extremely confused as this future was completely different from his. She told him that the voice in her visions bid her track the dragon storms, leave a trail to the Spirit Dragon's lair, and in return, the voice's owner would kill Ugin. In a sudden horrific epiphany, Sarkhan asked who the owner of the voice was and Yasova replied that it belongs to a great dragon, with scales like burnished gold with an orb that floated between his horns. Sarkhan finally realized everything. Yasova's markings resembled curved horns . The horns of Nicol Bolas. At first, he was horrified that Bolas followed him to the past before remembering Bolas recounting his victory in the past. Sarkhan finally understood everything. Bolas was coming to kill Ugin at that very moment. With sudden urgency, Sarkhan quickly assumed his draconic form and launched himself into the sky, away from the shocked Yasova. Using the storms as his guide, he tracked his way across the Temur frontier until at last he found the eye of the storm, Ugin himself. However, he was not the only one to arrive, and reality itself rippled as Nicol Bolas came to Tarkir. The two dragons immediately reacted to each other and seemed to speak, though Sarkhan was so far away. He hoped to arrive in time to tip the balance in Ugin's favor, but the battle began even as he flew. Ugin called to his draconic progeny and as they gathered, Bolas struck against Ugin, who fended the Elder Dragon off. However, as Sarkhan reflected on his role in the battle, the balance of power abruptly shifted. Sarkhan saw that Yasova's part in the battle was not over, and as the shaman cast a spell, an intense, overwhelming command gripped Sarkhan's draconic mind: Kill Ugin. With no choice, Sarkhan shed his draconic form, sloughing off the spell even as he began to plummet from the sky. Ugin's dragons converged upon their father even as Sarkhan struck the ground, broken and barely aware. Before his wounds overcame him though, Yasova appeared and began to heal him. She intended to take him prisoner and wring answers out of him, but for that, he had to be whole. However, before the healing spell was done, Sarkhan managed to get to his feet and cast banefire at his would-be savior. In a panic, he lurched away to find where Ugin had fallen, discovering a canyon that had not been there before. Sarkhan climbed down and found the dying spirit dragon, broken and about to breathe his last. Overcome with despair, Sarkhan begged Ugin to tell him what to do, but Ugin had only one thing to say. Speaking directly to Sarkhan's mind, he told him he would always fail so long as he sought guidance instead of truth. In desperation to save the dragon's life, Sarkhan took the hedron he had carried with him this entire time and activated it, the simple stone shard unfolding to an immense device akin to the hedrons on Zendikar, and they wrapped themselves around Ugin, preserving him. However, that simple act was too much, history had been reforged and Sarkhan's life became an impossibility. And he vanished. Sarkhan's deeds in the past were immortalized by the Temur, whose shamans preserved the tale of the Dragon Man, the Sky Khan that had come to save Ugin, only to vanish again into the Unwritten Now. Sarkhan after he returned to the new timeline. Sarkhan found himself back in present-day Tarkir, but things had changed. Dragons now ruled the plane thanks to the actions taken in the past, with the old clans abolished and the very word \"khan\" banned. Sarkhan himself had become a living temporal abnormality. His trip through time had imbued him with the ability to use blue mana. Overjoyed, he traveled across the new Tarkir, marveling at the different breeds of dragons across the plane. After meeting with the Kolaghan (the former Mardu), he learned that no one seemed to remember him, not even Zurgo . He discovered that Narset had never died in this new timeline, so he set out to find her but was swiftly disappointed when he discovered she'd been exiled from the remnants of her clan. Seeking answers, he turned to the only being that might be able to answer him: Ugin. Sarkhan arrived at the canyon where he saved Ugin in the past where he was attacked by spiritual constructs created by the dragon. Ugin himself appeared and apologized stating that his constructs were overeager. The spirit dragon has been studying Tarkir's new history in the various carvings around the canyon. He eventually questioned Sarkhan on his actions and how a hedron from the Eye of Ugin arrived on Tarkir. Sarkhan informed Ugin of the events that had transpired in the previous timeline. As Ugin had no memory of the alternate timeline or the role his spiritual echo played in it, the Spirit Dragon theorized that Sarkhan had now created a time paradox of sorts. Sarkhan Vol had never been born nor had he served with the Mardu. The Dragon Man Sarkhan Vol had appeared from nowhere and saved Ugin the Spirit Dragon before disappearing to reappear a thousand years later. Understanding this, Sarkhan made his peace with Ugin and left. He soon encountered Narset nearby. Although delighted to see her alive he was saddened to learn that she did not know him. He learned that she had unlocked her planeswalker's spark and explained to her the events of the previous timeline. He then decides to accompany her to meet Ugin as they planned to explore the new Tarkir together. Seeking revenge on Bolas for ruining his plane and his mind, Sarkhan conspired with Ugin to defeat the elder dragon. He helped Ugin bypass the wards that Bolas used to protect the Meditation Realm , which enabled Ugin to quickly take back control of the plane. This also allowed Ugin to see through the Spirit-Gem between Bolas' horns, giving him one way to effortlessly spy on his brother without any chance of being noticed. (This was because the Spirit-Gem was metaphysically tied to both Ugin himself and the Meditation Realm, as Bolas had taken it from Ugin's essence after killing him there.) Later, Sarkhan worked with Ugin to enable Niv-Mizzet 's resurrection: After Niv's death, Sarkhan retrieved the device that Niv had used to preserve his consciousness. He delivered the \" ghost box\" to the Meditation Realm, where Ugin could keep it safe until Ravnica 's leaders performed the ritual to bring Niv back to life. After that, Sarkhan went to Amonkhet , where he helped the god Hazoret restore the Hekma in exchange for help against Bolas. Hazoret and Sarkhan then met up with a group of planeswalkers led by Karn , who had come to Amonkhet to disable Bolas' Planar Bridge . At Sarkhan's request, Hazoret gave them her spear to aid them in their fight against Bolas. Karn transported it back to Ravnica and gave it to the newly-resurrected Niv-Mizzet. Sarkhan went back to Ravnica with the planeswalkers, helping the Gatewatch in the fight against Bolas. Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . He survived the battle, and he also attained the vengeance he desired, as Niv's resurrection, Hazoret's spear, and Ugin's control of the Meditation Realm all proved to be crucial factors in Bolas' defeat. While not explicitly recruited to defend Tarkir, Sarkhan was informed in some way of the Phyrexian threat. He returned to Tarkir before losing his spark in the Great Pruning . Sarkhan is not technically the planeswalker's name, but his self-granted title. The word \"šarkan\" (pronounced |sharkhan|) means \"dragon\" in the Slovak language while \"Vol\" means \"flight\" or \"flying\" in French. On his homeworld, Sar-khan means great khan/high khan/sky-khan. Sarkhan's dedication to draconic magic is reflected in all of his Planeswalker cards. Sarkhan the Mad is the first Planeswalker card to lack a \"+\" ability that grants him loyalty counters. Sarkhan narrates the trailers for Khans of Tarkir and Dragons of Tarkir . Sarkhan Unbroken is the second three-color Planeswalker card after Nicol Bolas, Planeswalker, and the first one to feature wedge colors. Sarkhan is the first Planeswalker whose individual cards have used 4 of the 5 different basic types of mana - red, blue, black, and green. With the events of Fate Reforged, Sarkhan Vol had never been born on Tarkir. He simply appeared in its past to save Ugin before vanishing similar to the dragons formed from the Dragon Tempests. The timeline stabilized in this way and this Sarkhan eventually served Nicol Bolas, attacked Naya, and dueled with Chandra, and Jace before reappearing on Tarkir 1000 years after saving Ugin. On Tarkir only Sarkhan, Ugin and Narset know of the plane's alternate timeline, and of those 3, only Sarkhan himself knows the full story of his own life. In the video game Magic: The Gathering Arena , Sarkhan is voiced by Steve Blum . Sarkhan received cross-promotional cards in Lord of Vermilion II and Lord of Vermilion Re:2 . Sarkhan's war-staff He had a hedron fragment acquired from the Eye of Ugin ; he later uses this fragment to save Ugin . Associated cards: Depicted in: Quoted or referred to: Brady Dommermuth , Doug Beyer , Jenna Helland et al. (October 22, 2008). \" Flight of the White Cat, Part III \". magicthegathering.com . Wizards of the Coast. Brady Dommermuth , Doug Beyer , Jenna Helland , et al. (April 15, 2010). \" Enter the Eldrazi, Part 2 \". magicthegathering.com . Wizards of the Coast. Brady Dommermuth , Doug Beyer , Jenna Helland , et al. (April 22, 2010). \" Enter the Eldrazi, Part 3 \". magicthegathering.com . Wizards of the Coast. Sarkhan Vol . Planeswalker Biography . Wizards of the Coast."}