{"text": "Sarpadia is a remote continent in Dominaria 's southern hemisphere that was ravaged by warfare during the period between the Brothers' War and the Ice Age . Sarpadia is isolated from other landmasses and little is known about its denizens and history. What is known is that the five major cultures around 170 AR were destroyed by invading forces and internal strife. Most races were entirely wiped out and others escaped to other parts of the world, leaving the creatures known as thrulls with dominion over the entire continent. Most of Sarpadia's story is told through the Fallen Empires expansion. Long before the time of the Brothers, Sarpadia was ruled by the Tchokta empire, which used its subject peoples to feed an unending need for sapient sacrifices. The last of their war priests, called N'ciczli (a word meaning \"inhuman\") by the early Sarpadians, was summoned away by planeswalkers from time to time. He came back telling of grand battles he saw and fought in when the gods called him, using these tales as inspiration for his battles, and supposedly he was never defeated. The last time he was summoned away, he didn't come back. His people believed the gods had made N'ciczli a god himself and started creating cameos for representing his ascension. The Tchokta, however, were ripped apart by the progenitors of the Sarpadian empires, which killed outright whoever had ties to the old Tchokta religion. After Urza activated the Golgothian Sylex , the climate of the entire world rapidly cooled. As a result, crops failed and many lands became uninhabitable. This put constraints on resources such as food stocks, iron, and wood. Increased need and decreased supply sparked strife between cultures that had once been allies. While the resource shortage primarily affected the empires on land, the merfolk faced attrition from an antarctic race of crustaceans called homarids that began to encroach on their territory as the waters cooled. Sarpadia was the setting of the Fallen Empires expansion. An isolated island continent, there were five major cultures, one for each color of magic: the humans of Icatia (white) and the Order of the Ebon Hand ( black ), the merfolk of Vodalia ( blue ), the elves ( green ), and the dwarves of the Crimson Peaks ( red ). Traditional lines of enemies and allies existed along color lines, but the recent climate changes and increasing internal strife led to conflict and isolationist policy. The tome titled Sarpadian Empires chronicled the rise and fall of these empires, starting with the fall of the dwarven kingdom to a chaos-driven army of orcs and goblins . This was followed by the fall of the Ebon Hand at the hands of their creations, the thrulls, and similarly the elves by their thallid creations. The last empire to fall was Icatia, which repelled the orcs and goblins for some time before succumbing to a combined force of orcs and goblins (aided by the planeswalker Tevesh Szat ), thrulls, and thallids. Icatia was also weakened before these attacks by the subterfuge of the Farrelite Cult . Sometime during this period, the whole of the Vodalian empire was conquered by homarid forces invading from the southern antarctic continent. Next to nothing is known of Sarpadia's history after the fall of the empires. Sometime after Icatia toppled, the goblins were destroyed by the thrulls and the orcs took to hiding in caves. The thrulls learned to evolve themselves, created variants adept at hunting in the caves, and finally wiped out the last of the orcs. The thrulls would continue to evolve over the centuries, becoming more and more powerful. Luckily they lacked the imagination to realize that there was anything in the world beyond Sarpadia and remained content with their solitary existence. The thallids continued to flourish as well but never advanced beyond shambling brutes. Not much is known about the Sarpadian mainland from this period, but the Voda Sea continued to be dominated by homarids. It is unknown when they migrated to Terisiare through a deep continental rift, but the humans of Kjeldor referred to them as viscerids. Here the homarids caused even more flooding problems on Terisiare. Homarids as a whole would be unheard of after this age save for a few specimens that found their way into the future through time rifts. The warming climate likely weakened their birth rate and pushed them back south. Thousands of years later, during the Phyrexian Invasion of Dominaria , it was rumored that the metal demons of Phyrexia met insurmountable resistance from the thrulls in Sarpadia. The Phyrexians, soundly defeated, believed that if the thrulls ever fully realized there is life beyond Sarpadia, Dominaria - and indeed the Multiverse - may be in imminent danger. Around the same time, some thrulls begin to appear on Phyrexia and Rath , though these were far more docile than the Order's variants, suggesting that Yawgmoth and/or the Evincars managed to perfect the secret of their creation. The Citadel was the center of operations for the Order of the Ebon Hand. The Order of the Ebon Hand and the Citadel both were founded by Tourach , known also as the Dark Judge, the Ebon Hand, or the Ebon Praetor . He was the primary deity of the Order religion, which has odd parallels with that of the Order of Leitbur . The primary rite of the Ebon Hand was sacrifice and most of its rituals involved some form it. Most Order neophytes would cut off a hand at the wrist as an initiation rite, while sacrifice beyond the wrist was used as a penance rite. The Order was one of the few institutions where humans and non-humans alike were welcome. Little is known about the Citadel save that it was located somewhere in the Western Swamps. The Keep was the Order's capital, located with the other parts of their empire in the Western marshes. Thurzen Klathe oversaw this site as the Lord High Priest of the Order of the Ebon Hand. In the southern part of Sarpadia lies the Crimson Peaks, a huge mountain range, inhabited by humans and dwarves . In the southern part of the mountains, dragons came to lay their eggs. The orcs and goblins also presumably lived somewhere in or near the Crimson Peaks; the orcs hid in caves among the peaks until their destruction. Kalita is a town in this area, and Teedmar a city. A dwarven stronghold, destroyed by the orcs and goblins along with the rest of the dwarven empire. It was the final bastion of the dwarves to be overtaken. With the dwarven leader General Danhelm slain, the surviving dwarves would take refuge in a nearby abandoned mine under the leadership of Captain Sarya Haasendel . Sarya sent numerous pleas for help but was only aided by the Order of the Ebon Hand who sent the mercenary Ivra Jursdotter . His last correspondence to the elves would ask them to chronicle the dwarven history as Jursdotter's forces were seen amongst the orcs and goblins, presumably joining them and ending all hope of the dwarves' salvation. This mountain range was the home of the dwarven empire whose name was lost to history when the orcs and goblins destroyed it. The dwarves defended their lands until they were eradicated by continual raids. During the initial onslaught, the dwarven hero Kaylen was killed in combat by an orc, setting in motion the rise of the planeswalker Tevesh Szat . Havenwood is a tremendous forest in the north of Sarpadia, reaching its northern coast. It was home to a vast elven empire. The elves lived in many isolated fortress-like villages throughout the forest. Populated primarily by hunters and druids, when trouble arose, all of the farmers and hunters armed themselves and served as militia. Thelon , a powerful druid, learned to create creatures out of fungus called thallids which produced saprolings . Saprolings and thallids were used as a food source when crops began to wither, but they soon grew sentient and, vastly outnumbering the elves, crushed the elven empire in a single day. By the time of the rift crisis , the thallids were the only sentient beings on the continent besides the thrulls. The capital of the elven empire is Havenwood. It served as the seat of power for the elven king and the meeting place for his council. Notable inhabitants included Loren , representing the scouts; Morgan , representing the order of Thelonite Druids; and the council leader and elder druid Kolevi. Icatia was populated almost entirely by humans and was the largest of the Sarpadian empires. It had an extensive mercantile system, elected officials, vast medical expertise, and a powerful army. Icatia was also the home the Order of Leitbur a sect of clerics founded by Bethan Leitbur to worship the Hand of Justice . The Order of Leitbur directly opposed the Order of the Ebon Hand. Corruption ran rampant among Icatia's many officials, allowing Oliver Farrel to gain vast numbers of cult-like followers. On the surface, the Farrelites strove for political and social reform and believed that the Order of Leitbur hadn't gone far enough in opposing the Ebon Hand. The capital of Icatia. Lady Margaret Ellsworth , Prime Minister of Icatia, dwelt here and oversaw the Icatian government on behalf of King Henry Joseph I . An outpost town to the south of Havenwood in the northwest portion of Icatia, Montford housed many troops due to its location and to counterbalance the heavy concentration of the Farrelites in the area. Oliver Farrel himself was very active in this city, as was his champion Sianna . After Farrel slew his ex-lover Tymolin Loneglade , her brother Tevesh Szat opened a Planar Gate over the town in revenge. Through the gate spilled forth the orc-goblin army that immediately attacked the town, backed by the full fury of the planeswalker. A heavy concentration of scouts enabled the Icatians to mobilize quickly against the forces. An Icatian Scout , Ailis Connaut , gave her life to reveal the position of the army, ensuring that the orcs would flee and leave the goblins to be routed. Trokair was an Icatian city whose destruction caused the Farrelite Cult to break away from Icatia as a whole. Led by their mayor Lydia Wynforth , their citizens and troops held out against the goblin and orc forces before being destroyed. Trokair's Flagstones would stand for millennia to come. A mythical place believed to be somewhere in Icatia. Many knights made it their quest to find where it lay. The Voda Sea surrounds the isolated continent, and its waters were the home of the Vodalian merfolk empire. Ruled by a militant, magic-wielding upper class, much of their history is unknown. Many temples to Svyelun , goddess of the Pearl Moon, dotted the ocean floor. The Vodalian emperor died under unknown circumstances, leaving Empress Galina III as the ruler. When the homarids invaded their territory, Marshall Karel Volnikov led the Vodalian army against them. The merfolk initially succeeded but were later overwhelmed by the homarids' capacity to breed and flourish in the cooling waters. Without medical supplies and no stored food source, Vodalia was abandoned, and many of its subjects followed Empress Galina III to Etlan Shiis . The name comes from the word \"voda\", originating in various Slavic languages, which means \"water\" in English. Quoted or referred to: Sarpadian Empires"}