{"text": "The infamous Baron Sengir is a vampire lord, ruling the Dark Barony on Ulgrotha from Castle Sengir . He is the progenitor of the Sengir vampires that can be found on multiple planes . Notable Sengir vampires include Irini Sengir on Ulgrotha , and Arvad , Kazarov , and Verrak on Dominaria . Sengir was the son of a small baron. The young baron was described as having perfectly white teeth, hair of a healthy shade of brown flattened on his head and precisely combed, and eyes almost black. His father started dabbling with black magic and, to be provided with fresh corpses summoned a swarm of Plague Rats to infest a village under his protection. The baron intended to become an immortal and he had begun the path towards vampirism, bringing with him his son. The baron also made his son sleep in a coffin, much to the disgust of the latter. Realizing the evil intentions of his father and believing he could be a better ruler, he started visiting the graveyard of the nearby village during the night. Here he met a little orphan, whose parents had died of the plague. Sensing some magical potential in her, he taught her the song used by his father to control the rats, asking her to kill the baron to free her village from the plague. He couldn't kill his father, or he wouldn't inherit his barony. After some convincing, the girl finally agreed. The two entered the castle, with a swarm of plague rats subjugated by the girl at their heels. When the girl ordered the rats to attack the baron, he sang the same song of control and repelled them. Confused by the battle of wills, the rats attacked the only other prey in the room: the young Sengir. When the rats slashed the boy's throat, the baron shouted a spell that hit his now-dead son. Sensing the right moment, the girl once again ordered the rats to devour the baron: they complied. When she opened a window to let the sunlight enter, she heard a scream behind her. The young baron was alive, the slash at his throat completely healed by his father's final spell. However, he was visibly hurt by the sunlight and receded to a dark corner of the room, hinting at his now complete transformation into a vampire. He complimented the magic of the girl and suspected she would become a planeswalker . The two realized they didn't know each other names: the girl's name was Ravi , while the boy has just become the new Baron Sengir. Unbeknownst to both of them, they would be reunited many centuries later. Homelands comic. Centuries later, Baron Sengir was summoned during a planeswalker duel on Ulgrotha. When the planeswalker lost he fled the plane, leaving the Baron stranded. Without any means to leave Ulgrotha, Sengir chose to make the plane his new home. Unfortunately, by this time the vampire had become as ruthless as his father. He found refuge from the elements in the swamps and tried to dominate the local An-Zerrin peoples. This didn't work as intended since the baron was forced to exterminate them. He settled his eyes on a newly constructed dwarven castle , and decided to make it his own. Sengir began a new barony consisting of several small villages encircling a graveyard. Whenever a villager was buried, they would be promptly raised as a zombie servant of the Baron. Eventually, this self-sufficient system provided him with an army with which to assault the rest of Ulgrotha. He slaughtered the dwarven occupants of the Castle of Morning Light, raising them as undead. When the remaining dwarves came to reclaim the castle he repelled them three times until, to send a clear message to them, he kidnapped the daughter of the king. He turned her into a vampire, charming her to love him like a father and renaming her Irini Sengir . This definitively broke the dwarves' spirit and they abandoned the castle, vowing revenge. At this time, the dwarves decided to keep secret the existence of a planar portal in the dwarven city under the castle. However, the Baron quickly found hidden stairs leading from his throne room to the Dwarven Gate . Even though he knew little of true magic, the vampire knew that a planar gate was a dangerous thing. None of the minions he sent through the gate ever came back. Searching the underground city and torturing dwarven prisoners proved useless in discovering what lay on the other side of the planar gate, so he decided he would get through only prepared with an army. He would forge this army from the inhabitants of the Homelands. Searching the rest of the plane, he reached far in the Dead Zone where he discovered a crumbled spire and, inside it, a sealed coffin. From it, he freed an old crone, completely mad: the two didn't recognize each other, but this was his childhood friend Ravi. In any case, the baron quickly sensed the magical prowess of the woman and he brought her to his castle , renaming her Grandmother Sengir . She became his teacher of black magic, wisdom, and lost knowledge. Baron Sengir Sometimes later, the Baron started sending his vampires against the citizens of Aysen : his intention wasn't to conquer them, but instill fear in them and erode their morale. At one point, the Baron had his servants kidnap humans from Aysen, as well as a vessel carrying thirty-one families from Onella to Kerselin . He had them set up small villages in the swamp of his Dark Barony, where they lived under his influence. Even if he didn't need the short-lived humans for any purpose, dominating them kept him entertained through the long years, and turning their dead into hand servants and vampire warriors made them useful. He instigated firm rules: if one person tried to flee the Barony, he would murder ten people in their place. He was aware of the presence of Serra on the plane. After the arrival of Feroz , the Baron meet the two planeswalkers and invited them to his castle. Here, he told them that, since his summoning centuries ago, he has considered Ulgrotha his new home, and warned the two not to interfere with this decree. Serra and Feroz didn't agree with him and started to help out the peoples of the Homelands to develop, to be better able to repel the Baron. Later, when Eron became the immortal King of the Goblins, the Baron tried to tempt him, to no avail. So, the two worked out a deal: Eron would ensure that the Sengirian Villagers were getting food and necessities that the growing population could not create themselves, and Baron Sengir would take no more hostile actions against the denizens of the Koskun Mountains . Also, with the coming of the Autumn Willow , Sengir sensed a new presence in the Great Wood , hostile to him, and started sending his Royal Hunters through the forest, to find out its secret. Around 3760 AR, the Baron was confronted by a peculiar Serra paladin. Lord Ihsan asked the baron to make a vampire of himself, hoping secretly that in this way he would have had the power to kill Sengir. The Baron, however, saw through the plan of Ihsan, and instead of turning him into a vampire, he made him into a shade and faithful servant. Thanks to Ihsan, the baron learned that his raids of terror were giving the people of Aysen strength and purpose, instead of fear, and that they were united by his hatred of Sengir. Thus, he stopped his obvious attacks, to wait and see if the citizens of Aysen, without a common enemy, would collapse and turn on themself. In a few years, it began with the persecution of the Death Speakers by the Serrans, a schism fueled by the agents of the Baron. After Feroz's death, he saw Serra botch a rescue attempt of an old man in the market of Onella. With his poisonous words, he reprimanded her for having interfered, just as Feroz did; shortly after, Serra left Ulgrotha. Later, he sensed the death of his old enemy, and planted a tree on Feroz's grave, in a sense envying the two lovers their eternal sleep. With his most powerful enemies gone, Baron Sengir remains the true mastermind behind every trouble on the plane. He has spies in Aysen who fuel the rift between the Serrans and the Death Speakers. Some of the students in the Wizards' School have begun to succumb to his offers of dark power. His faithful hunter Veldrane endlessly stalks the wood, searching for the fabled grove of Autumn Willow. The thieves Joven and Chandler sell the artifacts they steal to the highest bidder, unaware that this is none other than the Baron, arming himself for the future. Even Eron is unaware that his trade agreement with Aysen is tenuous and that many of his guards are secret servants of Sengir. The great plan of the Baron proceeds smoothly. He will wait until the population of Aysen is firmly divided, then eliminate Eron once and for all, throwing Koskun Keep into chaos. When thousands of Goblins will begin to starve, they'll go where food is easily available: Aysen. Many will die traversing Autumn Willow 's wood, but enough will live to destroy many of the villages and farms of Aysen. After a few more years of complete misery, the Baron will reappear, turn the weak leaders of the Homelands to his control, and offer them a choice: follow him to a new world where they can do as they wish, or die here in misery. When the plane was visited by Leshrac on the eve of the Great Mending in 4500 AR, the planeswalker saw a great army of vampires, marching at the order of Ihsan 's Shade. The Baron was last seen at the head of this army, walking through the Dwarven Gate . Wherever is on the other side is surely doomed. Even though he was not a planeswalker, Sengir traveled the Multiverse being summoned by a unknown planeswalker. Dominaria Ulgrotha Represented in: Associated cards: Depicted in: Quoted or referred to: Baron Sengir's original description claims that \"though he has dark tendencies, he is not evil - just practical and rather direct\". However almost all posterior media claim he's a villain."}