{"text": "Serra's Realm was an artificial plane created by the planeswalker Serra from pure white mana as a heavenly ideal. Serra made the Realm in the hopes that she could make a haven where suffering could be avoided forever. It was the original home of the famous Serra Angels , and existed in peace and worship of its creator for some time. All of that changed when Urza fled after a failed attack on Phyrexia . He spent five years healing from that attack and learning about the nature of artificial planes, which require constant maintenance from a planeswalker or other powerful being to keep from being consumed by entropy. After Urza left, the Phyrexians attacked. Though they were repulsed, their black mana forever tainted the realm, causing Serra to propose a massive exodus to the realm inhabitants and flee. After Serra left, her head archangel, Radiant , took control of the plane with increasing militancy and religious paranoia. In her quest to expunge all Phyrexian influence, Radiant became an unwitting tool of the Phyrexians and began exterminating loyal Serrans. Urza returned to Serra's Realm with the newly-built Skyship Weatherlight , rescuing thousands of Serran refugees before finally collapsing the plane into the ship's powerstone core, giving it enough power to travel the planes. After the Compleation of the Weatherlight in 4562 AR , the powerstone was used in the Temporal Anchor where it finally imploded. Serra's Sanctum . Art by Ciruelo. Serra's Realm was a plane where the sky was in a perpetual golden dawn. The sunrise came from various angles at once, and it was impossible to tell one's position. Landmasses floated throughout the sky, carrying large meadows with boulders and berry-producing vegetation. These flying lands never collided with each other, each seeming to move along a fixed path. It was also impossible to reach the end of such a landmass on foot, because, like Mercadia, the laws of physics had been altered, and moving in one direction to reach the end of the floating island would result in one's repositioning back where they started. Visions of Serra's Realm. Art by Rob Alexander, Mark Zug , Mark Brill, and Bob Eggleton. There were cities scattered here and there, created and supported by Serra. Serra's Sanctum was a notable landmark of the plane, suspended somewhere in its infinite sky. The Sanctum was the dwelling place of the famed planeswalker herself. It was a massive palace of crystal, marble, and opal, taller than most structures on other planes. Powerful artifacts run through white mana and have white-related functions, such as the Cocoon , which could be found here. The Sanctum focused the realm's white mana, generating an immensely powerful healing light. At the top of the Sanctum was the aviary, where Serra could see the entire plane through many powerful lenses that kept an eye on her world. Only planeswalkers could comprehend all these images simultaneously. Leading down from the aviary through the rest of the Sanctum was a spiral staircase that ended at the base of the building. It was here that the main plaza was presumably located. The plaza contained a water fountain that reached five stories high, carved with skillfully rendered angelic effigies. On the fountain were also the words art, discourse, freedom, and peace. These are the ideals that Serra herself sought after and wished to center her world around. Humans existed in Serra's Realm, though their origins on the plane are uncertain. They mainly lived in Serra's Sanctum, though there were villages that were scattered across the floating meadows. The primary focus of these people's lives was the worship of Serra. Men and women also served as both knights and soldiers in her army. Many worked as artists and musicians, two professions that pleased Serra deeply. Angels were iconic of Serra's Realm. The angels were created by the planeswalker as guardians of her plane and the embodiments of all the virtues which she valued. They joined mortal humans in the veneration of the Lady. Angels were divided into five different orders: Law, Grace, Reason, Duty, and Truth. Each order was made to regulate a certain color of magic. Law and Grace, two of the most famous, were in charge of controlling Red and Black mana and fought in battles with the Phyrexians. Creation of Serra's Realm by Serra . The primary religion in Serra's Realm was the supplication of Serra. All of the beings of the plane adored the Lady and wished to do as she pleased. All were also to love each other, and marriage and childbirth were also encouraged. Children were sent to Lady Serra to be taught and raised, where they would all live communally and learn empathy. Art and music were favored by Serra. Paintings, angelic sculptures, and stained glass windows were found throughout the plane, and songs could be heard everywhere. Women joined the Sisterhood of Serra, an organization of priestesses devoted to none other than the Lady herself. In general, females played a large role in Serran communities, quite often serving as military personnel and holding various offices of authority. Karn Nahiri (non-canon) Serra Urza Jhoira Xantcha Depicted in: Referred to:"}