{"text": "Seton was a Centaur druid from the Krosan forest on Dominaria . A master healer and competent warrior, he was the Krosan centaurs' emissary to the outside world, as well as an accomplished pit fighter. He was also a talented warrior and so was sent to Cabal City by Thriss to investigate the source of the magical disturbances centered there. In his pit fights, he relied primarily on the natural strength and speed of his race to overpower his opponents, although his druidic training meant that he was also a capable green magic user. Whilst he could appear savage and wild in combat, he also had a wise and contemplative side to his personality that earned him the respect of many of his fellow fighters. His philosophy for the pits was that they embodied the system of survival of the fittest and that therefore if he lost, it was simply part of the natural cycle. He first met the barbarian warrior Kamahl in a pit fight, where the two became good friends after they teamed up to defeat a powerful dementia creature and Kamahl saved the centaur's life. When Kamahl left pit-fighting behind to pursue the Mirari , Seton aided him, knowing it was the source of the disturbance he had been sent to investigate. The pair tracked its bearer, Lieutenant Kirtar , to Krosa, where the aven commander was insanely attacking the forest. There, Seton and Kamahl also encountered ambassador Laquatus' bodyguard, Turg , who attacked them. Seton wrestled with the anurid warrior and almost bested him, but Turg intentionally vomited in Seton's face, nearly blinding the centaur with his acidic bile. As a result, Seton had to stay in Krosa to recover while Kamahl continued to track the Mirari. Much later, Seton would cross Kamahl's path again after the barbarian, in a fit of Mirari-induced rage, near-lethally stabbed his sister Jeska . While Kamahl journeyed to the center of Krosa to gain control of himself and get rid of the Mirari, he left his sister in Seton's care, where the centaur used his druidic knowledge to try to heal her. However, when Kamahl returned to the centaur's home he found that Seton had been murdered and Jeska abducted by the Cabal forces that had pursued him led by Braids . Associated cards: Depicted in: Quoted or referred to:"}