{"text": "Sivitri Scarzam was a human Planeswalker who commanded the mighty Scarzam dragons named for her. There used to be some question as to whether she or her dragons were the ones with the power to planeswalk, but that has been cleared up with the release of Dominaria United . Sivitri is a human who has dragon parts on her body (eg horns). Her magic is based on controlling and summoning dragons, especially Scarzam dragons . She can speak and understand the Draconic language and also can telepathically command her mount. She learned and is adept in hydromancy and cold magic. Sivitri is centered in blue and black mana. Sivitri raided southeastern Corondor with her horde of dragons on several occasions. Refugees, mostly farmers, began to band together to battle them, but their weapons were useless. Eventually, a healer found a new species of a poppy created by Sol'Kanar that, when mulched into a potion, became a contact poison that could kill the Scarzam Dragons. Dozens of the creatures were killed before Sivitri, astride the largest Scarzam Dragon, left Dominaria for other planar conquests. Many years later Sol'Kanar ordered the summoning of the Scarzam dragons, hopeful of destroying their entire race. Gydolien Mor and Chondeah obliged, and the entire race was summoned from beyond. Mounted on the last of them was Sivitri, who left Dominaria. In a treacherous act, Gydolien intervened by taking control of Sivitri's dragon, instructing it to leave. The last dragon went back through the portal through which it was summoned, with Sivitri still riding it. Sivitri is a human planeswalker of the lineage of the Scarzam dragons of the Dragon Stronghold . She has traveled the Multiverse, broadening her magical knowledge and collection of artifacts. Her powers include hydromancy, cold magic, and a strong defense against telepathic intrusion. Her eyes can deliver a cold look that freezes her opponent. She uses her long hair as a weapon; it is cold enough to cause frostbite to any it touches. Her hands are clawlike, and she brandishes a poisoned quill in battle. She dwells in a tower on an island in a so-far undisclosed location. She keeps the last living Scarzam dragon close by at all times. \"Even the brave have cause to tremble at the sight of Sivitri Scarzam. Who else has tamed Scarzam’s Dragon?\" Sivitri was born ages before the Brothers' War , but after the fall of the Thran Empire . As a young Corondor girl, Sivitri found solace beneath the surface of the sea. She would walk into the ocean, holding her breath, and she would speak in Draconic as waves would form towering serpentine shapes. Her parents feared what was becoming of her, and those around her thought her an evil witch. One day she attempted to drown herself, but instead sparked to the Dragon Stronghold. In the undersea plane where the Scarzam dragons made their lair, Sivitri learned of her draconic ancestry. She took command of the sorcerous powers that had been welling up over the years. She learned hydromancy and cold magic. Using the cold fire at the center of the stronghold, she forged her armor, a magical chitinous shell that gave her the power to breathe underwater. She then created a saddle from sharkskin for riding the Scarzam dragons and made a bridle from silver, decorated with runes. Paired together, they allowed her to speak and understand Draconic and to telepathically command her mount. She then returned to invade Corondor. The seldom-seen planeswalker has garnered several legends, any of which may or may not be true: Sivitri is said to have obtained a powerful artifact she planned to use to create a tsunami to destroy a city. A group of heroes supposedly snuck into her tower and stole the artifact, sparing the city's destruction. It is said that her dragon once became deathly ill, and was saved by a hero who was given prophetic information at an earlier date on how to heal it. Another legend says that her dragon was once taken to the abyss by a balor and its demonic host and that a group of heroes saved it from being roasted. Dominaria \"Scars of Scarzam!\" is used as an oath in the Whispering Woods . In the short story \"The Dragon War\" (published in the back of the Dakkon Blackblade comic ), Sivitri is described as a \"planes-traveling being\" who \"pierced the veil\" while riding her dragon, but it does not state whether she could planeswalk without it. The same story also states that only a planeswalker could be powerful enough to summon the whole Scarzam brood."}