{"text": "Slobad was a Mirran goblin with an unusual affinity with artifacts and an even stranger way of speaking. He was reanimated into a Phyrexian as of the Second Phyrexian Invasion of Dominaria and Phyrexia: All Will Be One . Slobad's life was never a happy one, not even the day he was born. Unfortunately for the poor goblin, his birth coincided with the zenith of the Eye of Doom , a taboo that meant death for every goblin with the misfortune to be born under its light. However, Slobad's mother did not follow tradition and instead hid the young goblin in the air ducts rather than throwing him into the Great Furnace . It was some time, but eventually, the infant goblin was found by another goblin by the name of Dwugget. Dwugget was the head of the Krark Cult, a group of outcasts, and it was perhaps that reason why he raised Slobad as if he were his own. Just because Slobad had found a place did not mean he felt at home with the cult. Even among outcasts, Slobad felt alone and left as soon as he could. He wandered the face of Mirrodin, surviving by his wits and resourcefulness until he was captured by the Leonin and turned into a servant. Here, he found an odd sort of kinship with their young leader Raksha and he sought to help his friend as best he could. Though Raksha showed affection to the young goblin, there was no question about their relationship. Slobad may have been a favored slave, but he had no freedom at all. After a catastrophic failure of one of his mechanical inventions, Slobad decided it was best to flee before any punishment could be forthcoming, and once again, he was alone. He returned to his nomadic life until finding a long-hidden cavern in the foothills of the Oxidda Mountains. Inside, he found the horrible machines of murder known as levelers . It seemed ideal for a life of solitude and so, he found a place to stay. Life settled into a simple routine of scavenging food and parts and it seemed acceptable if lonely. All of that changed the day the Levelers came back bearing more than they usually would. An elf named Glissa had been captured within the terrible blades of the constructs and with his help, she managed to free herself. Her leg had been badly mangled, and with little choice, Slobad leads her back to Taj-Nar where the leonin could heal her wounds. In the leonin capital, her wound was treated and she befriended Slobad's old master, Raksha. He related to the pair that he too had been attacked in the same instant Glissa had been. An unlikely alliance seemed in order, and with the leonin's help, Glissa and Slobad struck out to learn who their mysterious enemy was. This search led them deep into the Mephidross where he ran across the remains of an ancient dilapidated golem. The construct turned out to be intelligent after Slobad fixed it and introduced himself as Bosh . With the golem's help, the trio managed to penetrate to the heart of the dross, a structure called Ish Sah which was ruled by the necromancer Geth . After his defeat, he traded his life for the information the group had come for.\nThis knowledge led to the next leg of their journey, towards the Quicksilver Sea and the Vedalken city of Lumengrid . The group managed to shield themselves inside of Bosh while the golem traveled on the seafloor to the island fortress. Here, Glissa confronted the mysterious individual orchestrating the attacks, Pontifex , and with help, managed to kill him... only to have the true culprit revealed. The stories that Dwugget had told Slobad as a child, stories that the world was hollow, turned out to be true. The group descended deep into the core of Mirrodin itself to discover the most well-kept secret in all of history. The ancient and mythical being known as Memnarch was responsible for the attacks. He was obsessed with Glissa, and the group fled back to the surface for fear for their lives. The only thing the group could think of that could stand against the tyrant was the equally legendary Kaldra artifacts. Together, they gathered the artifacts and sought to confront their nemesis, but they were betrayed by the avatar when Memnarch gained control of it. Memnarch revealed that Glissa's latent planeswalker's spark was his final goal, but the group escaped when the green sun erupted from the core. Bosh stayed behind while the pair escaped, giving his life to spare his friends. Glissa and Slobad returned to the Tangle to find it a changed place, and were immediately arrested by the Viridian Elves for the murder of Glissa's parents. The pair were vindicated when the levelers attacked at Glissa's trial, and the pair were freed to put together an alliance of their friends, an alliance intent on toppling Memnarch's reign. The pair returned to Ish-Sah, to find Geth no longer the head of the Dross and Glissa fell into a horrible trap, leaving the goblin alone and beset on every side by enemies. Slobad was captured without much fight and Memnarch made plans to utilize the goblin's brilliance. He was tortured horribly until his will was broken, his limbs were amputated and he was hooked into Memnarch's latest machine. He was given one job: turn the very structure of the entire planet into an enormous spark-transfer machine. The only power source strong enough to accomplish the task was the souls of all those above. His mind was connected to a multitude of tiny memnite s that would act as his hands while he constructed the device. He spent the next five years realizing Memnarch's twisted vision. Sadly, he and Glissa were reunited just in time for Memnarch's plans to come to fruition. In fury, Glissa flung herself at the mad golem, knocking both of them into the core. Much to Slobad's surprise, her spark was accidentally transferred to his battered form, which was restored to perfection for the first time in years. He found himself with the godlike powers that Memnarch had sacrificed so many for, but to his even greater shock, he came face to face with the planeswalker who had created Mirrodin itself: Karn . Karn offered to make Slobad his apprentice, but without Glissa, he saw no point in going on. Instead, the goblin gave up the spark to resurrect all the people killed on Mirrodin and send them home. In the end, Karn left Glissa, Slobad, and Geth as the new guardians of Argentum (Mirrodin) and the Mirari . Unfortunately, it seems as if Slobad's life was cursed. He was thought to be tragically killed shortly after he and Glissa returned to the surface, brought low by hordes of panicked goblins whose elders had just vanished with no explanation. His broken body sank into the plane's core — where Phyrexia waited. Holding onto the hope that he would see his friend Glissa again, Slobad reluctantly accepted as the Phyrexian oil reshaped his body. Finally mended, he emerged with the understanding that Glissa, too, had the honor of joining Phyrexia. Still influenced by the memories of his previous life, Slobad modified his Phyrexian body to resemble his late friend, the golem Bosh . His small, goblin form was embedded in a massive construct of cables and sheaves of metal plating, one shoulder bearing an epaulet adorned with a triptych of shrieking goblin heads. His limbs had been shorn off, where they'd been amputated at the joint and soldered to the exoskeleton of his golem-like Phyrexian body. Now a monstrously large goblin, his limbs swollen with black steel, Slobad toils for the compleation of the Multiverse, convinced that Phyrexia has reunited him with his friends. Residing in the Salvage Complex of the Furnace Layer , he managed waste disposal. Urabrask sent obsolete Phyrexians to him for repurposing. New Phyrexia Karn Depicted in: Quoted or referred to:"}