{"text": "Soltari is a white creature type used for cards that depict a Spirit -like race of beings trapped in the Shadows of Rath . All have the keyword ability Shadow . The cards as they appeared in the Tempest block didn't have the subtype Soltari. It was later realised that a non- human race should have its own subtype, which resulted in Soltari Priest in its Time Spiral/Timeshifted form. The other cards were updated in the Grand Creature Type Update . The Soltari originally lived on Dominaria , likely with a different outward appearance. During the time of their planeshift abduction, the Soltari were at war with the Dauthi . The Thalakos were caught in the conflict, despite their neutrality. All three races were trapped in the maelstrom of energy that surrounded Rath , and were stuck within the \"Shadows,\" the extraplanar space between Rath and Dominaria. They were left in an incorporeal state, unable to communicate with people on either plane, yet able to see into both the Dominarian reality and that of Rath. This predicament led the Dauthi and Thalakos to lose their sanity. The Soltari maintained a stable mental condition through following their religion which offered them peace and solidarity. This they achieved with strong oral traditions and a priesthood that propagated an unerring belief in a way back to the real world. This belief gave a few Soltari the power to step back into the real world, if only for a short time. Typically, these Soltari became esteemed, pivotal in attempting to contact other races who might be able to help them escape the maze of shadows. After arriving in Rath, Weatherlight ‘s planeshifting engine was damaged in battle with the Predator . The wizard adept Ertai therefore volunteered to keep the standing Erratic Portal they found open as a planar escape route. While trying to open the planar portal , Ertai was contacted by the Soltari Emissary Lyna , who offered to aid his rituals in exchange for letting the Soltari use the portal as well. Ertai agreed and they successfully opened the portal. However, the Weatherlight was being hotly pursued by Predator as it fled and so was forced to leave Ertai behind. The Weatherlight and Soltari flew into the portal. It was then revealed that the planeswalker Urza waited on the other side of the portal and was in league with Lyna ( Mind Over Matter ), having presumably met her when he first discovered Rath. Urza slammed down the portal, crippling Volrath 's flagship in the process. Lyna asked Urza what they were going to do next, and Urza simply said that they would wait. Soltari Guerrillas is the only multicolored Soltari, adding red to the mana cost ."}