{"text": "Sorin Markov is a vampire planeswalker and a master of sangromancy , a dark corner of black mana specialization. Sorin is a pale-skinned vampire with white hair and eyes with black sclera and gold irises. With his blood magic, he can drain the lifeforce of other beings, render several creatures (including Eldrazi brood) to ash with a wave of his hand, place curses on enemies, possess the minds of others, fashion blood into weapons, and has even created an angelic being powerful enough to maintain the balance of his entire home plane. He is naturally capable of flight . Being a vampire Sorin has keen senses and his walk is silent. He learned enough of Lithomancy from Nahiri to be able to craft The Helvault , an extremely powerful prison capable of containing the ancient planeswalker herself, as well as Avacyn, and thousands of demons. He is described as having a predatory, yet enchanting characteristic to him, apparently appearing almost above other vampires in regards to his appearance and mannerisms. Sorin Markov is one of the oldest living planeswalkers. He is more than 7000 years old. Unlike Ugin and Nicol Bolas , he has dedicated his existence to following his whims, and this easy life of pleasure has brought him detachment and easy confidence. Having seen hundreds of planes over thousands of years, he has become a sort of bon vivant, seeking novelty and new diversions. But despite his fundamentally hedonistic nature, Sorin does feel the pull of more lasting concerns and, over his long life, this tendency has resulted in an arcane schedule of engagements and forays to far-flung planes. As a result, Sorin is a busy man, planeswalking frequently to pursue concerns known only to him. Sorin always seems to have business elsewhere. It has been shown, however, that despite the countless number of planes he has visited, he still treasures his memories of his home plane, Innistrad, and desires to protect it from inside and outside threats. Sorin is one of only a few surviving original planeswalkers, which means he is more powerful than most other planeswalkers. Sorin is primarily black -aligned, but is secondary white . Millennia ago, Edgar Markov (Sorin's grandfather) performed a dark ritual creating the first Innistrad vampires . Thousands of years ago, Edgar Markov , Sorin’s grandfather, was an aging alchemist noble who had been searching for a way to become immortal. Famine in the land that would become Stensia forced Edgar's hands and led him into dark experiments, areas that he eagerly explored. Making a deal with the demon Shilgengar for the secrets of sangromancy , Edgar created a blood ritual that granted agelessness and the ability to subsist on blood. Edgar and the rest of Sorin’s family held Sorin still and forced him to drink the blood of an Archangel, the trauma of the transformation and the situation caused Sorin's planeswalker spark to ignite. Around one thousand years after his ascension in the long distant past, Sorin's attentions were drawn to the Eldrazi , aether-born monstrosities that consumed one plane after another. Sorin decided to ally with two other planeswalkers and trap these abominations. Nahiri , a Kor lithomancer and native of Zendikar, Sorin would use his life-leeching magic; and Ugin , an ageless spirit dragon originally from the plane of Dominaria, would use his \"spirit fire\" colorless magics. Using a special hedron matrix and the plane of Zendikar the Eldrazi were forced into physical form on Zendikar where the three planeswalkers imprisoned them. Unfortunately, this brought great strife to the plane and its inhabitants and ultimately doomed them, but saved the multiverse. The three agreed that if the results of their ritual were ever disturbed, all three would return to Zendikar, and they departed.\nSome centuries later the Eldrazi managed to free themselves from their prison ethereally but not physically. Unable to depart, they started to consume Zendikar from within. Sorin was called to the plane by Nahiri to assist, but he did not receive the call to assist her, leading to a conflict between the planeswalkers who were once friends. Sorin in his ancestral home, tending his sword Over the centuries, as vampires spread further into human lands, Sorin spent more and more time away from his homeworld, sometimes disappearing for years at a time. Vampires became disdainful of the race from which they had spawned, hunting mortal humans more and more boldly, and Sorin became distant from his lineage. From his world-hopping perspective, he could see the changes happening within his homeworld. As the vampires gained more and more power, the humans were being driven further and further back, suffering under the boots of his grandfather's legacy, and it would only be a matter of time before the vampires wiped out their former kin. When confronting his grandfather with this newfound knowledge, Edgar brushed it aside, saying they had eternity, or close to it, to find a solution. For humanity to survive and to keep vampires from cannibalizing each other once humanity perished, Sorin committed something that forever marked him as a traitor to his race. Borrowing from long-held beliefs about the moon and the afterlife, Sorin forged a warrior who could hold back the vampires and other threats that threatened the extinction of humanity on Innistrad. He named this creation Avacyn and tasked the angel with protecting the plane in his absence. Through her, the magic of faith would create true power to fend off the darkness. She was half of the protective measure he created to protect Innistrad. The other half was the Helvault . So, the church was born from Sorin's act, and while some of the vampires understood, most reviled him as a traitor. Unknown to Sorin, the Eldrazi stirred on Zendikar, but Nahiri had to deal with the situation alone. When she later came to Innistrad, Sorin explained that her signal for help had been likely absorbed by The Helvault, but displayed no remorse for his oversight. When Nahiri confronted him with the gravity of his mistake, Sorin became offended and angrily reminded her of who raised her as a planeswalker and advised her to pester Ugin, instead. Nahiri saw this as a betrayal of their bond and chose to physically threaten Sorin. This resulted in Avacyn 's intervention, who felt the threat that Nahiri posed to Innistrad. The two clashed until Sorin called the battle off and banished Nahiri into the Helvault. During one of his rare sojourns on Innistrad, Sorin ran across the interplanar thief Dack Fayden , who had caused far too much of a stir in his short time on the plane, having raised the ire of the Falkenrath line to a frenzy. In exchange for the Ancient Fang , Sorin let Dack and his friends live. Sorin destroyed the notes the walker Sifa Grent had left behind in Falkenrath Keep and told Dack where she hailed from hoping that his problems would take care of each other. He told him of a world even darker than Innistrad; a place called Grixis . “I have seen entire civilizations rise and fall. You, mortals, are but dust to me.” Millennia after the initial imprisonment of the Eldrazi, the Eldrazi grew restless once more, and Sorin returned to Zendikar as per his agreement with the other two planeswalkers. However, his fellow Planeswalkers were nowhere to be seen. Unbeknownst to him, Ugin was resting in a Hedron cocoon, after being nearly killed by Nicol Bolas , saved by a time-traveling Sarkhan Vol (Ugin died in the original timeline). Bolas was eager to see who would answer the call of Ugin after the Eldrazi Brood were freed by Sarkhan Vol , Jace Beleren , and Chandra Nalaar . Sorin was forced into action and allied himself with Nissa Revane , an elven planeswalker shortly after arriving on Zendikar. Almost immediately he was beset by the Eldrazi Brood and after dismissing them with a simple spell, he liberated the vampiric slave Anowon and demanded that the two take him to the Eye of Ugin . Sorin and his companions traveled to the nearby Graypelt Refuge to meet with a friend of Nissa's, the merfolk named Khalled, and gain supplies for their long journey to Akoum. Khalled gave them what support he could, including a piece of the puzzle tower Tal Terig so that they could find their way. The trio descended into the Makindi Trench, and after avoiding The Roil several times, encountered an enormous band of Kor refugees. Shortly thereafter, they encountered a Kor of another kind. A babbling Kor woman traveling with a large group of goblins. Sorin and company shared their campfire with the woman, who would only speak in bursts of ancient languages that fascinated both Sorin and Anowon. The Goblins told them that the woman was named Smara and that she was a \"witch vessel\" for a spirit trapped in the crystal she was carrying. They were also on their way to the Eye of Ugin, and Sorin suggested they travel together. Nissa and Sorin on Zendikar Eventually, the mismatched group came to the Piston mountains and Zulaport beyond that. The trio decided to stay the night in Zulaport and find some way to cross the ocean in the morning, but a vampiric death attributed to their group led to them fleeing to the sea. Nissa stole a boat and summoned a massive behemoth to swim the ocean and pull the boat behind it. The party soon regretted their hasty departure, as whatever food was on the boat was soon exhausted and the goblins traveling with them began to vanish one by one. Nissa could not sleep without allowing the behemoth to be dismissed and with no food or sleep, she was forced to repeat her hard-learned Joraga fasting mantras to survive. During this time, Sorin finally told Nissa the nature of their mission as well as admitting to being a walker much like her. Sorin told her that the great gods of the past, and the progenitors of the brood, the Eldrazi Titans were bound beneath Akoum long ago, and it was his mission to make sure they stay that way. The next morning, they approached the beaches of their destination. It was a hazardous landing as the companions were to learn. The bays of Akoum were littered with shipwrecks and crystal reefs, but the greatest threat came from the Moon Kraken that ruled those waters. Brinelin demanded tribute from their boat, and Sorin casually killed one of the remaining goblins to satisfy the great creature. That tribute was found lacking, and Sorin had to reveal more of his true nature to the creature. Brinelin remembered Sorin and was somewhat terrified to find him returned after so long, but would not let them pass. Since Sorin's intimidation had failed, Nissa gambled that her diplomacy might work. She spoke of Sutina, who had been friends with the kraken, and told Brinelin of her death. Greatly saddened by the news of his friend's death and discouraged by the return of the brood, Brinelin finally acquiesced to lead them safely through the crystal reefs. The party soon approached Tal Terig, which was surrounded by brood, and found themselves captured by elves Nissa had never seen. They were the keepers of Ora Ondor and planned to sacrifice the group so that their sacred Kolya fruits would grow. In their madness, they had underestimated the brood, and Ora Ondor came under siege by the brood. Nissa and what remained of their party, now greatly diminished to a single goblin who traveled with Smara and the trio, escaped during the confusion, and as they fled, Ora Ondor fell. The goblin, whose name was Mudheel agreed to lead them all to the Eye, for his knowledge of Akoum was better than that of Anowon, but without supplies, the group soon fell into dire straits. They were saved, after finally collapsing in the wastelands, by a water scout who altruistically shared his spoils with the group. Anowon killed the man with Sorin's permission to satiate his hunger which left Nissa aghast. The small band became aware that they were being followed after this incident, and they were finally ambushed by an army of Nulls under the direction of two vampires later that night. Nissa fell during the combat and awoke as a prisoner of the vampires. They told her that they were hunting the Mortifier, who Nissa mistakenly believed to be Anowon. They carried her for several days, all the while leaving Nissa wondering why they had left her alive before her allies rescued her. When she tried to approach Anowon about what she had learned, he told her that she was mistaken and the true extent of Sorin's nature came to light. Once the group arrived at the Eye of Ugin, Sorin's plans abruptly changed from what Nissa had promised. Instead of helping Sorin reinforce the spell containing the Eldrazi, she shattered the main Hedron and released the enchantment imprisoning the titans. Nissa thought the titans would flee, that they would leave Zendikar far behind them. She was wrong, and Sorin washed his hands of the foolish elf and the entire plane, choosing to go about his own business once more since Nissa wouldn't heed his instructions. Sorin's Agility Sorin returned to the dark world of Innistrad after the debacle on Zendikar. What he found upon his return shocked him. While away, his guardian, his hopes made flesh, had vanished. Now, the world he sought to protect so long ago has turned on itself, tearing apart the institutions Sorin himself had helped to establish. With only grim determination, Sorin began searching for his lost angel, slaying any who would stand in the way of his answers. He found the capital of Gavony ransacked and no answers for his trouble. His search suddenly stalled when he ran across the anarchistic Tibalt and was forced to deal with the young planeswalker. Tibalt opposed every authority that held the world together, and despite the woes befalling his world, Sorin knew Tibalt posed a significant threat if left unchecked. By the time the upstart had been dealt with, the problem of his missing angel had seemed to solve itself, leaving Sorin no further obligations on the plane. Sorin's interests now turn to a greater threat: that of the recently released Eldrazi. Sorin awakens Ugin from the cocoon of hedron Sorin journeyed to the plane of Tarkir , guided by visions of a dark oracle. He sought to solve the mystery of what became of Ugin and why the dragon did not appear on Zendikar when the time came. With the help of an enthralled Temur warrior, Sorin went into Ugin's Domain. He learned that not only were dragons extinct on Tarkir but that Ugin was dead and his bones were covered by ancient magic. Unbeknownst to Sorin, Ugin had died long ago at the hands of Nicol Bolas . Sorin journeyed to the plane of Tarkir , guided by visions of a dark oracle. He sought to solve the mystery of what became of Ugin and why the dragon did not appear on Zendikar when the time came. With the help of an enthralled Atarka warrior, Sorin traveled to Ugin's hedron cocoon . Sorin awakened Ugin from his slumber and informed him of the freed Eldrazi. Ugin thanked Sorin for releasing him, and instructed Sorin to find Nahiri, warning the vampire that he did \"not wish to see your face without hers.\" A furious Sorin then left without comment musing that things were easier when he only had his world to worry about. After failing to help Avacyn, Sorin was left with no choice but to unmake his beloved creation Upon his return, Sorin found Markov Manor in ruins, twisted into impossible shapes, its inhabitants embedded in the masonry. Nahiri had left this declaration in stone as a warning of her vengeance. Realizing his past had come back to haunt him, he hoped to gather the aid of the other vampires to confront the threat to Innistrad. A difficult task, because he was shunned by his kind. His search brought him to the remote estate of the powerful Olivia Voldaren , to entreat her aid in calling the bloodline. To secure the help of the other vampires in battling Nahiri and reclaiming Markov Manor, Sorin reluctantly agreed to destroy Avacyn. He was just in time to save Jace Beleren and Tamiyo from being overcome by Avacyn in Thraben Cathedral . Though, when he saw Avacyn was intent on their destruction, he politely offered to let her kill them before they had their talk. Upon speaking with his creation, he saw the depths of her madness and how Nahiri had turned his most precious creation against him. And despite the deal Sorin had made with Olivia Voldaren, he initially tried to reason with his angel, to take her down to the cathedral's cellar, where he could cleanse her mind of madness. Avacyn, in a moment of lucidity, blamed him for what happened, for having her made weak and corruptible so that she could be turned against the innocent. She condemned him as Innistrad's greatest evil, believing that he, her creator, was responsible for everything that she could do, and therefore was responsible for her madness. They fought a battle that nearly tore the cathedral apart. In the end, Sorin overpowered Avacyn, draining her blood and slamming her body through the chapel floor, all the way down to the cellar. There, he once again pleaded with her, offering to make her anew and cleanse her mind. But whether due to her madness or a personal revelation about her nature, Avacyn refused, stating that \"If I am not the daughter you want...then we must battle again, and again, forever. For I will never yield. I am no monster's instrument. I will not be altered by the likes of you.\" And so, one thousand years after creating Avacyn to maintain the balance between humans and the supernatural, Sorin was forced to unmake his corrupted guardian in the same spot where she was born. Head bowed with anguished regret, he looked away as he dissipated his progeny into an ashen cloud. With Avacyn's destruction, the last of Sorin's magical protections woven over Innistrad was broken. With Avacyn gone, Jace tried to speak with Sorin about why he had destroyed Avacyn. But as Jace spoke, Sorin suddenly realized what Nahiri had been doing and that he had played right into her plan. Promptly, Emrakul arrived on Innistrad. Sorin and Olivia assembled a vampire army and went to war against Nahiri, while Liliana Vess tried to save the populace with a zombie army. Sorin and Nahiri battled in Markov Manor, where he was bested by the Lithomancer and encased in stone. Nahiri planeswalked away, leaving Sorin to watch Emrakul devastate Innistrad. Olivia Voldaren then taunted Sorin by proclaiming herself the new lord of Innistrad. She relieved him of his sword, leaving him to his fate. Sorin vs Nahiri during War of the Spark Free from his stone prison (it is said that he “carved” or \"chewed\" his way out ), Sorin was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . When he found out that Nahiri was on the plane as well, he immediately went after her, as not even a threat to the entire Multiverse could persuade them to put aside their feud. Ignoring the battle that raged around them, the two planeswalkers fought each other in single combat. However, they later came to a temporary truce, joining forces against the Eternals of Bolas' Dreadhorde . They were among the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. It can be assumed that after the war they resumed their feud. Returning to Innistrad , Sorin sequestered himself in the ruins of Markov Manor, grieving for the loss of Avacyn . Teferi , Arlinn , Kaya , Chandra and the Cathar Adeline found him brooding in the throne room of his partially destroyed home. He seemed to be suffering from depression and nihilism lamenting that everything he had done to protect Innistrad had been for naught as all of his safeguards had fallen. He was annoyed by their intrusion and refused to relinquish the Moonsilver Key simply out of spite. He declared, with anger, that if his family wished to fall into depravity and hedonism of the Eternal Night after all his efforts to save both them and Innistrad, then he would wash his hands of them and leave them to their own devices as he was now too tired to try to stop them. Arlinn tried to convince him of the good he had done for their world, even feeling pity for the man, and attempted to convince him to see the entire plane as his family, not just House Markov, but she enraged him upon mentioning Avacyn . In his fury, he attacked them, but was stopped by Sigarda , who was called by Arlinn's faith. The angel called out Sorin for how far he had fallen and how he now spends his time sulking instead of focusing on more important matters. Sigarda engaged in a battle with him to buy time for Arlinn and her team to get the Moonsilver Key and escape Markov Manor. After the falling of the Eternal Night , the Gatewatch once again approached Sorin for help. After his grandfather agreed to marry Olivia Voldaren , he realized that Innistrad was once again doomed to be bled dry in a couple of years. Participating in the wedding. Sorin teamed up with the Gatewatch to “crash” the wedding, but when guards stopped the rest of the group from entering the Voldaren estate due to the rest of the party lacking an invitation, he was forced to enter on his own. He made his way through the estate with a group of guards behind him, being mocked and laughed at as he did so until he finally reached Olivia. Olivia greeted him as she had his grandfather's coffin brought in, and hastily began to awaken him with her blood. Sorin, enraged by this, realized that he did not wish for his grandfather to be hurt, and attempted to stop her, but ended up being stopped when he was overwhelmed by guards armed with holy chains that they wrapped around his throat and dragged him away with. When his grandfather emerged from the coffin, Sorin attempted to warn his grandfather that he was being controlled, but is ignored and instead dismissed by his charmed grandfather for “ruining the festivities”. Sorin watched in horror as he is released, and one by one, his relatives came up to and greet him, kissing him on the cheeks, although they did not speak to him, as “talking with Sorin always ruined the mood in Markov Manor.” During the exchange of vows between Olivia and Edgar, Sorin attacked Olivia. At the same moment, Katilda 's spirit manifested by coming out of the Key. Katilda used her powers to free the angel Sigarda from her prison. Being freed, Sigarda exploded her angelic aura in a fury that caused the surrounding stained glass to shatter, hurting or killing many wedding guests. Olivia and Edgar were not severely injured. To escape Sigarda’s ensuing wrath, Edgar fled into the manor’s sanguitorium. He was confronted by Sorin, and the two came to blows as they hurled insults and viciously attacked one another. During their struggle, Edgar expressed disappointment in Sorin’s naivety and wasted potential. Sorin struggled to understand his grandfather’s careless views and experienced flashbacks to the time of their family’s descent into vampirism. As if continuing his fall from grace, Sorin came back to his senses to find Edgar standing above him and looking down in disgust. Sorin had fallen into one of the sanguitorium blood pits and continued to reflect upon the past as he slowly sank into its depths. He eventually regained focus, drinking in the blood that engulfed him which healed his wounds. Emerging with renewed power, Sorin picked up a greatsword as he set out to put an end to his grandfather’s foolish endeavors. Sorin found Edgar in the main ballroom in the process of attacking Teferi but intervened and quickly defeated him. Rather than killing Edgar, Sorin showed mercy and ordered him to leave. In the aftermath, Sorin seemed to acknowledge the connection between him and the other planeswalkers and their inherent desire to travel and explore. After the Second Phyrexian Invasion of Dominaria , Sorin and Arlinn Kord worked together to prepare Innistrad's defenses against the encroaching Phyrexian Multiverse threat. He also informed Geralf Cecani and Ludevic of Ulm to the nature of the invading force. Sorin narrates the trailer for Dark Ascension . Ironically, ‘Sorin’ is a Romanian masculine name that originates from the noun soare, which means “Sun”. This could be an ironic joke due to his vampiric nature, a representation of his status as Innistrad’s protector against the creatures of the night and as an “enemy” to other vampires, bring attention to the fact he was turned against his will and does not wish to be a vampire, establish his disconnect from other vampires and their ideals, or just be a coincidence. In the video game Magic: The Gathering Arena , Sorin is voiced by Crispin Freeman . The Parasite Blade The Parasite Blade — A two-handed sword, enchanted to reflect Sorin's vampiric nature and his magical powers. It is a thirsty sword that feeds off the mana of any creature it cuts. A single cut can turn a very large creature into ash in a matter of seconds. This sword was taken from him by Olivia Voldaren after he was encased in stone by Nahiri. He was depicted with a similar-looking sword in War of the Spark , although it may not be the same one since it's unclear when he would've had time to retrieve it from Voldaren. The Ancient Fang . The Moonsilver Key given to him by Dennick Betzold 's great-grandfather. The key was later retrieved by Arlinn Kord and The Gatewatch . Alara (has at least knowledge of Grixis) Innistrad Ravnica Tarkir Unknown plane destroyed by Eldrazi Zendikar Associated cards: Depicted in: Quoted or referred to: Sorin Markov . Planeswalker Biography . Wizards of the Coast. Doug Beyer (March 29, 2010). \" The Eldrazi Arisen \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (March 1, 2010). \" And Carnage Shall Follow \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (November 02, 2011). \" A Planeswalker's Guide to Innistrad: Stensia and Vampires \". magicthegathering.com . Wizards of the Coast. Doug Beyer (January 11, 2012). \" Sorin's Homecoming \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (January 11, 2012). \" The World of Dark Ascension \". magicthegathering.com . Wizards of the Coast. Luis Scott-Vargas (March 17, 2016). \" Sorin, Grim Nemesis \". magicthegathering.com . Wizards of the Coast."}