{"text": "Sparrow Hawk was a human from North Aerona on Dominaria . He was the younger brother of Gull and Greensleeves . Sparrow Hawk lived peacefully with his brother and sister and his younger brother in the village of White Ridge , on the border of the Whispering Woods . Greensleeves was perceived to be dim-witted because she couldn't talk, but only chattered like an animal. One day a falling star was seen in the sky, which was reputed to be a bad omen. This was proven true when White Ridge was destroyed during a wizards ' duel and Sparrow Hawk supposedly was killed. Gull and Greensleeves, who turned out to be a planeswalker , formed an army and liberated almost all of North Aerona . Eleven wizards under the leadership of Towser and Karli have regrouped and protected themselves from Greensleeves's magic. Aided by a huge Keldon warlord with a personal grudge against Gull, they attack the army from three different directions. Gull confronted the Keldon warlord and was almost killed before Greensleeves could teleport him away. After traveling to Lat-Nam to discover the secret of the Stone Brain , Gull and Greensleeves were attacked once again by Towser's wizards. After a long battle, the army retreated into a tunnel, where Gull had a  dream about his dead family. However, among them, he didn't see Sparrow Hawk, their long-lost brother. And thus, he had a revelation of the warlord's identity. Gull revealed to the Keldon that the latter was, in truth, Sparrow Hawk, who had been kidnapped and enchanted by Towser to be a war machine, and the two brothers reconciled. However, the wizard Haakon unleashed a fireball against the two. This caused Greensleeves to go mad with anger and sorrow, making the \"final sacrifice\" of her ideal that every life was sacred. She became a godlike being and lost herself, seeing her friends and family as mere ants compared to her. Before she could unleash her overwhelming power and destroy the isle, she was brought to her senses by her lover Kwam and saw that her brothers had survived the fireball, thanks to the enchanted might of Sparrow Hawk. Greensleeves decides to pour all of her mana into the isle of Lat-Nam, curing the land of the poison and transforming the desert into a verdant forest, thus sacrificing her planeswalker powers. In the aftermath of the Battle of Lat-Nam , Greensleeves was declared High Wizard of the Domains by her followers. Thereafter, she and her brothers disappeared from history."}