{"text": "Sumifa was the capital of the ancient nation Almaaz on Terisiare , Dominaria . It was ruled by a Pasha. A city of the same name can currently be found on the Terisian Isles . During the Brothers' War the songmages of Sumifa joined the war on the side of Mishra , to avoid the ruination of their homeland. The mystical language chanted by the songmages was reputed to be able, among other feats, to calm and even control savage beasts. The songmages refused to answer the call of the Third Path . However, Mishra's counselor, Samor the Collector, created a secret Circle of mages himself. The purpose of the Circle was to shield Sumifa and Almaaz from the whims of Mishra, trying to protect the land from the worst effect of the Brothers' War, until the circle would be strong enough to put an end to the conflict. However Porros the Raptor, the Sumifan royal heir, saw in the position of Samor a usurper of the sort, and tried to wrestle control of the Circle from him to unleash a powerful cockatrice against the brothers and take back the kingdom of Almaaz from Mishra's influence by force. In the second half of the Brothers' War, after the confrontation between Samor and Porros, the latter destroyed the city, burying it under tons of desert sand. The population took cover in the near Nessian caves. In the following years, however, Almaaz spiraled into civil war , presumably between the member of the Circle and the Ninnites, the followers of the Raptor. Around 1300 AR, the city was rebuilt next to its old site as \"New\" Sumifa. The existence of the old city, however, was slowly forgotten, until around 3000 AR, when an excavation site would bring to light the ruins of ancient Sumifa. Patron God of Sumifa was Caelus Nin , the God of Time . Simply called Sumifa, the \"new,\" shining city of Sumifa lays in a wide, flat valley between the eastern desert near the Fallajian territories and the western erg, which merges with the scrubland controlled by the Wyrvil orc kingdom in the west. The Nantas River, a slow-moving ribbon of silt-laden water, turns the valley green during the winter months, but it dries up during the summer. A golden bridge brings one to Lion Gate, the main entrance to Sumifa. Like its predecessor, only on a far larger scale, the huge fortress town is laid out in irregular concentric circles, each one with a gate of its own. The gates are staggered inside the city, no two aligned, like in a high, stout maze. According to the records following the Brothers' War, these walls had preserved the city from a siege by raiders and the assaults of thirst-crazed military tribes. However, unlike the old city, modern-day Sumifa also uses its ten-foot-thick, twenty-foot-tall basalt walls to divide one caste from the other. The walls stand between the poor, living in the Barca, and the merchant, living in the Mercanto; the Inner Ring stands between them and the Citadel, where live the Fascini, Sumifa's royals, and their courtiers. Quoted or referred to:"}