{"text": "The Sun Empire is a prosperous empire on the continent of Ixalan , which is located on the plane of the same name . The empire consists of several cities and a capital, Pachatupa , and a central power structure. While the other two large cities are nominally aligned to the capital, that hold is tenuous at best. The emperor resides in the Tocatli palace. The human warriors of the empire command and ride dinosaurs , and they are protected by the magic of their sun priests. Pachatupa and the other cities are built to accommodate dinosaur riders, with high arches to allow their knights to pass through unobstructed. Map of Ixalan with the Sun Empire The people of the Sun Empire take great pride in their traditions and heritage. The title of warrior-poet is bestowed to only one person in a generation. They kept the stories and weaved events into words. To earn that title, one must demonstrate excellence in service to the kingdom. The Canchatan , the temple soldiers of Pachatupa, are specially chosen and blessed by the priests of two of the Temple of the Birthing Sun and the Temple of the Consuming Sun. Though they are technically two military forces, they have a single commander. meanwhile, the Emperor's Guard is an elite military force housed in the palace of Tocatli, which answers directly to the emperor. Its soldiers are divided into seven squads, each with its own commander (called an intical ). Sun empire warriors carry māccuahuimeh . Dinosaurs are important to the Sun Empire's sense of national identity. The empire's people use dinosaur feathers as decorations and as inspiration for design motifs in everything from jewelry to architecture. They believe that the Immortal Sun first gave their priests the ability to call and command the dinosaurs, so maintaining this command is a way of clinging to their ancient heritage. These creatures are not domesticated. Whenever a dinosaur moves through a Sun Empire city, it is under someone's direct control—and there's always the risk of it breaking free. This is part of the Sun Empire's worldview: nature (embodied in the dinosaurs) is a tool to be wielded, bent to human will, but it is a constant test of will and strength. Nature can't be tamed, but when humans live alongside nature they are made stronger. The Sun Empire worships the sun , which they believe to display three aspects. Temples to various aspects of the sun exist, but even places where sunlight touches the ground are considered sacred . The people of the Sun Empire are said to have been formed from the clay by the loving hands of Kinjalli , the Wakening Sun. In reality, they descend from the ancient Oltec civilization in Ixalan's Core . The Sun Empire was first founded from Orazca by Chacanto Intli , who united the various city-states into a central empire. Following a devastating war with the River Heralds under Apatzec Intli I , who used the power of the Immortal Sun without restraint, their civilization was reduced to a few coastal cities, with Orazca being lost to them. Whereas the River Heralds - who lived there long before the humans - had once controlled the continent, under the leadership of its new emperor Apatzec Intli III , the Sun Empire had cemented its grip on the land. The empire still confronts the Heralds on its borders. Apatzec was responsible not only for the new assertion of control but also for the current mood of expansionism that had gripped the empire following his mother's death several years before. The Sun Empire was besieged by pirate raids by the Brazen Coalition and the advance of the Legion of Dusk . Caught between the invaders from the sea and the wall of the jungle behind them, the Sun Empire rose with the ferocity of a dinosaur and the righteous light of the radiant sun to fight off its enemies. With Orazca retaken, the Sun Empire pushed the Legion of Dusk back to the sea, capturing and reverse engineering their fleet in preparation for an invasion of Torrezon. Forests were felled to raise a new fleet, known as the Dawn Fleet. Hundreds of ships were built, and nearly ten thousand soldiers and sailors crewed them. The ships were launched to Torrezon, and their last known location was the midway point between the two empires. However, when New Phyrexia's Invasion of the Multiverse started, the Sun Empire was forced to join forces with the Legion of Dusk to defend the plane. Huatli led a force of roughly one hundred auxiliaries, including her lancers, survivors from various regiments, and newly released prisoners, along with fifty dinosaurs, to call the elder dinosaurs to Orazca and break the siege of Pachatupa. The Sun Empire is loosely based on the Aztec culture, with slight influences from the Inca . Referred to:"}