{"text": "Tacenda Verlasen is a songmage and possible planeswalker from Innistrad . Tacenda has long brown hair. She carries a viol around, which was a gift from her parents at her fourteenth birthday. It, and any other musical instrument she uses, resonates with Tacenda's Warding Song. The Warding Song is only effective against monsters , never against humans. Tacenda and her twin sister Willia were born in the Approaches of Kessig , as daughters of a pair of clothing makers. They were each born with a curse: Tacenda would go blind with the rising of the sun, while Willia experienced the same when it became night. There was never a time that both could see. The townsfolk whispered that this was the curse of the Bog . Tacenda discovered she loved to sing, and that her songs could call magic of warding and protection against the monsters in the woods. Willia found a similar power within her while she fought with a sword, becoming a fearsome warrior. Because of their protection, their hometown of Verlasen became a safe haven and thrived because of it. Just after the girls turned fifteen, their parents were attacked in the woods and killed. Not long after, Willia was allegedly killed by the Lord of the Manor . Then, geists under the control of someone who sounded like the Lord of the Manor attacked the village, draining souls from the villagers. Tacenda's Song of Protection failed to ward the geists off, leaving her unable to save her village. Tacenda decided to take revenge on who she believed to be the killer, the Lord of the Manor. When her eyesight returned at dusk, she struck out on her own and attempted to kill him with a rusty pick. Davriel brushed off the attack, but Tacenda piqued his interest, and he decided to assist her in figuring out what happened to Verlasen. Researching the church of the Nameless Angel , Tacenda and Davriel found out that the people inside had been able to resist the attacks by the Whisperers, until a betrayer had let the geists in. As the Whisperers were unaffected by Tacenda's song, but were stopped by the priests, Davriel reasoned that they were from the Bog. Additionally, he reasoned that the spirits that Tacenda had heard whispering were likely people from her own village. After a visit to the Priory and its prioress , it was determined that she had been misled, as well. During the investigation, Davriel began to suspect that Tacenda was more than she seemed. When he tried to steal her song magic, she was able to resist him. He questioned her if there was an entity, similar to his own, that talked to her. She denied, but Davriel's Entity confirmed that she carried part of the Bog Entity . Not fully alive, it couldn't speak to her, except in the crudest of ways. It also confirmed that the majority of its power was supposed to be hidden in the Bog itself. However, investigating the Bog they found it to be empty, and they were besieged by a host of Whisperers. Fleeing back to the Priory, they planned to use the Seelenstone as their protection. At the Priory they found that the Seelenstone had been a mayor player in the conflict. And its major actor was none other than Tacenda's, thought to be deceased, sister Willia! As a new acolyte at the Priory, Willia had been guarding the Seelenstone during daytime. It began to speak to Willia and told her of power she possessed and that she could use it to stop the darkness. She just had to make it whole, by finding the other pieces scattered through the people of the Approaches. Each one with a little sliver of power. The first pieces Willia reclaimed were the souls of her parents. When she found that they were carrying offerings to the Bog — what she thought was a false god — they fell into an argument. She didn't mean to kill them. But the power from the stone, combined with her own, made it happen and turned them into Whisperers. She returned to the Priory to confess, but lost her faith when she found out that the people of the Priory had murdered the Nameless Angel. She instead began gathering the power of the Bog and, enthralled by its promises, started to pull the souls out of the people of Verlasen and betraying the occupants of the church. By this time, she was ready to kill her sister to make the Bog Entity whole. The Seelenstone was of no consequence anymore, and she broke it to release its souls for the benefit of the Bog Entity. Fleeing for her sister, Tacenda found the body of the Nameless Angel, killed after it had been struck by Emrakul 's madness. Somehow, its soul was still around and it encouraged Tacenda to use a new song. With this joyful, warm song Tacenda managed to defeat the Whisperers and absorb their souls. With help of Davriel, she also overcame and killed Willia. Willia's body released its part of the Worldsoul, and the Bog Entity was made whole inside Tacenda. Power permeated her. Perspective slammed into her like the weight of a mountain. She saw... worlds. Hundreds upon hundreds of them. So many people . She knew, instantly, the generations who had lived in the Approaches. Memories of the ages, the essence of all those who had come before. She gasped beneath the weight of it, becoming one person with ten thousand souls. And then...she let some go. The Entity didn't like it, but she was its master. She would not keep the souls of those who could still live. Every person whose body still lived, waiting for the spirit to return. She now was a child of two worlds, two gods, two ideals. As she considered it, something deep within her exploded , awakening at the power. Then — complete for the first time in her life — Tacenda vanished. According to Brandon Sanderson , it is not confirmed that Tacenda planeswalked at the end of Children of the Nameless . It is equally unclear whether she (or Davriel) had sparks of their own. It is possible that their planewalking powers are granted by the Entities . Tacenda is primarily red but secondarily green and white ."}