{"text": "Tahngarth was a proud minotaur warrior from Talruum and the first mate aboard the skyship Weatherlight . Tahngarth was a towering mass of strength and vanity. Gruff and impatient, he was formidable in combat - powerful and extremely fast given his massive size. Tahngarth was born to the clan of Three Beads in the halls of Talruum Mountain, close to the torches dedicated to the goddess of learning, Kindeya, and the god of judgment, Torahn. His mother tried to instill in him a need to turn to learn, but he was of his clan and turned instead to judgment. Little else is known of his family except that he lost his mother when revolution swept through Talruum while he was still young. This event just further kindled his need to see justice done, a cause his mother died for. All of the minotaurs of Talruum expected great things of Tahngarth as a child, who was considered beautiful and therefore likely to be a great warrior when his time came. When Tahngarth was an adolescent, Sisay , captain of the skyship Weatherlight , crash-landed with her ship and crew in the Talruum Mountains. In order to avoid having her people killed by the minotaurs for trespassing, Sisay challenged the leader of Tahngarth's group. Feeling she had the heart of a minotaur, Tahngarth offered to fight as Sisay's champion, and proved himself by defeating Ghentoth. He joined her crew and  quickly proved himself. After Meida was killed in a fight in the Adarkar Wastes , he took her place as Sisay's first mate. Sisay's goal in life was to collect the items of the Legacy , which would merge into a powerful weapon that could kill the Lord of the Wastes, who was responsible for the death of her parents. Unbeknownst to her, the mythical figure was actually Yawgmoth and she was a member of Urza 's Bloodline project , designed to create defenders for Dominaria who could fight Yawgmoth's Phyrexian minions when the Phyrexian Invasion began. Tahngarth became friends with most of the ship's crew, although he could not get along very well with some of them. He especially detested the goblin Squee , whose cowardice and impulsiveness was an abomination in the eyes of the brave and disciplined minotaur. He also had some trouble accepting Gerrard Capashen , especially when the man quit the Weatherlight crew after the death of his friend Rofellos , which Tahngarth felt made him a traitor to the crew. Karn and Tahngarth being held captive by Volrath the Stronghold on Rath. When Sisay was abducted and taken to Rath by minions of the Lord of the Wastes, Tahngarth convinced Gerrard to rejoin the crew to help his friends, though he loathed doing so. While Gerrard served as the ship's temporary commander he and Tahngarth came to an understanding and began to respect one another for their combat prowess. When they planeshifted to Rath, the Weatherlight came under attack by the flying ship Predator . During this battle, the silver golem Karn and the collected treasury of The Legacy were taken by the attackers and Tahngarth jumped to the other ship to save his friend. Unfortunately, he was overpowered by Greven il -Vec and captured as well. When Gerrard and the rest of the crew came to rescue their friends, they discovered that Tahngarth had suffered horribly under Volrath 's hands. Tahngarth had been mutated by the Phyrexians, who had planned for him to be the replacement for the traitorous Vhati il -Dal aboard the Predator . They placed him under a scorching beam of light that induced the mutation, but Tahngarth was freed before their mutation and brainwashing were complete. He helped Gerrard free Sisay and the crew escaped to Mercadia . The Weatherlight crash-landed on Mercadia after departing Rath. They had little time to rest though, as soon the ship came under attack from the Cho-Arrim . Stuck off of the ship, Tahngarth fought as hard as he could, but he could not prevent the rebels from stealing the ship. With few ideas, Gerrard planned to go to Mercadia City to hopefully learn more about what they could do to retrieve and repair the ship, but their planning was cut abruptly short. Tahngarth and many other members of the crew were arrested and taken to Mount Mercadia and the city atop it. There, Gerrard concocted a plan to escape, only to have it succeed beyond his wildest dreams. The Weatherlight crew, particularly Gerrard and Tahngarth, began training a force to help recapture the stolen ship. Hanna, with Orim gone, had to act as the counselor aboard the ship, and a long-overdue talk had to be addressed. She approached Tahngarth about his mutation, and he admitted that he felt himself a monster now. Strong, yet twisted, he felt this was a punishment from the gods for his vanity. No matter what any of the crew tried to convince him of, he thought himself monstrous. Finally, the troops were ready to march on the Rushwood . Unfortunately, the Cho-Arrim were not what the crew had expected, and they found Orim alive and flourishing. They attempted to stop the troops they had trained themselves and ended up under arrest once more. Luckily Hanna and Squee had remained in Mercadia City, and with their assistance, the crew escaped along with the Cho-Arrim prisoners, returning once again to Rushwood. Here, they learned of the myths of Ramos and why the Cho-Arrim had taken the Weatherlight to begin with, believing it to be Ramos come again. Hanna believed that the legendary Bones of Ramos as well as the Power Matrix to actually be a part of The Legacy. Along with Gerrard, Squee, and Sisay, Tahngarth went to gather the bones of Ramos. The Weatherlight crew soon found themselves under arrest in Mercadia City once again, and Hanna was given the order to integrate the parts into the Weatherlight lest something terrible befalls the rest of the crew. Volrath , who had been disguised as a member of the crew, had orchestrated almost everything that the crew had been through in an attempt to arrive at this very moment. The crew proved too versatile though, and they escaped aboard the newly empowered Weatherlight exchanging fire with the Recreant , Volrath's personal ship. The ship managed to leave Mercadia when Ramos himself came to their aid and slowed the Recreant , triggering as a result, a revolution that swept the streets of Mercadia city. Shortly after returning to Dominaria the Phyrexian Invasion began. Tahngarth fought in many battles during the initial stages of the war, but when the Rathi Overlay began, he had to face a challenge he found harder than fighting any Phyrexian: confronting his minotaur brethren with his mutated self. In desperate need of more soldiers, the Weatherlight traveled to Talruum to rally the formidable minotaur warriors there, only to find that the planeswalker Teferi had phased Zhalfir out of the time stream . The crew then turned to the Hurloon , where they found that the Phyrexians had ravaged the land and were planning to put every last surviving minotaur through the same process that Tahngarth had undergone. Finally, Tahngarth felt that he could redeem himself, if just a little, and was the most fierce in their defense. The Weatherlight destroyed their mutation plants, saving most of the Hurloon Minotaurs, though several had already been warped as Tahngarth had been. In the aftermath of the battle, the Hurloon survivors all bowed down before Tahngarth and accepted him as their champion, regardless of his mutations. Many even rubbed ash across their bodies in his honor, his skin having been blanched by the rays, a trait that he had found particularly disgraceful. For the remainder of the invasion, Tahngarth stayed on the Weatherlight , ever vigilant. He took revenge upon Greven il-Vec in a rematch between Weatherlight and Predator by cleaving the commander's head in two, and aided in rescuing Gerrard from the center of the Stronghold. Even when Yawgmoth himself came to Dominaria and attacked the ship with gigantic tentacles the minotaur refused to give up and kept fighting, using the soul-cleaving halberd blade Gerrard had taken from Yawgmoth's inner sanctum to hack at the tentacles. This brave defiance bought Gerrard, Urza, and Karn enough time to complete the Legacy and destroy Yawgmoth. After the invasion Tahngarth, Sisay and Squee were left without a ship, for the Weatherlight had been absorbed when the Legacy was completed. However, the thankful people of Dominaria granted them a new ship, which Sisay named Victory , and the three of them headed off for more adventures. Though not a planeswalker, Tahngarth traveled through the Multiverse as a crewmember of the Skyship Weatherlight . Dominaria Mercadia Rath During Weatherlight design and development, Jennifer Clarke-Wilkes was put in charge of establishing Tahngarth's mannerisms and style of speech. Associated cards: Depicted in: Quoted or referred to:"}