{"text": "Tarkir is the plane where the Khans of Tarkir block takes place. It is inspired by the history and cultures of eastern and central Asia. Tarkir is a wartorn world ruled by five clans, each with its own dragonlord. A dragon tempest spawning Kolaghan 's brood. Tarkir has a unique, \"dracometeorological\" ecosystem. Dragons are born from Ugin 's elemental storms, known as dragon tempests, which spawned different broods of dragons in accordance to terrain, each with their own motives and breath weapons. Ugin is a part of Tarkir's ecology: a living being that's in the unique position of being built into the natural world. The dragon tempests are an interaction of Ugin's living essence and the world of Tarkir. It is unknown if the tempests continue on Tarkir while Ugin is on other planes, leaving a question as to whether they have been active since Ugin took over Nicol Bolas 's imprisonment in 4560 AR . Ugin first arrived on Tarkir between ~-25,000 and ~-17,000 AR . Sometime after, the dragon tempests began, spawning Tarkir's dragons. In 4559 AR of the original timeline, dragons were extinct, leading to Sarkhan Vol 's fascination with them as a planeswalker. They had been hunted to extinction long before Sarkhan's time. 1280 years earlier, the clans were locked in a war against the dragons for their survival. When Ugin's twin brother, Nicol Bolas , confronted and killed him, the elemental storms that gave birth to the dragons ceased and no new dragons were born, changing the tide of the war. Ultimately, the warriors of the clans were able to destroy them all. In the centuries that followed, the five warrior clans claimed dominion over Tarkir, and are fighting over every scrap of territory. While some khans are content to rule their homelands, some wish to rule all of Tarkir. The clans have co-opted ancient draconic magic to disguise their strength and best their foes. A remnant of Ugin's spirit was able to transport Sarkhan back in time to prevent the dragon's death during the duel with his brother. When Sarkhan traveled back in time, he saved Ugin after his battle with Bolas. Ugin was preserved in a hedron cocoon as he regained his strength. During this time, the dragon tempests grew in intensity, with the dragons growing more numerous and powerful and eventually overtaking the clans in an event known as the \" Khanfall \". In the aftermath, the word \"Khan\" was abolished among all Clans and five dragonlords and their broods rose to dominate the humanoid races, forming new clans over the remains of the old, though knowledge of the clans still exists in the new timeline. These new clans continued to clash with each other over territorial disputes. Tarkir was a target in New Phyrexia's Invasion of the Multiverse . While Sarkhan espoused the dragons' might against the Phyrexians, many dragons were compleated , such as at least one of Kolaghan's brood, and many of Silumgar's brood. Surrak and Goreclaw , Zurgo and Ojutai , and Atarka shamans loosely banded together to defend the plane. Regions differ from arid desert plains to humid tropical jungles to frigid snow-covered tundra. According to Sarkhan, Tarkir has no oceans or seas. Dragonbones littered the landscape. The Salt Road , a large road that stretches through many of the clans' territories. The Shifting Wastes are the deserts controlled by the Abzan Houses . In the alternate timeline, they are Dromoka 's domain. Arashin , a city built upon a rocky hill that serves as the clan's symbolic and administrative center. The trade routes that wind through the Shifting Wastes all pass through it. Arashin is the home of the sacred First Tree and the khan. In the alternate timeline, Arashin is replaced by the Great Aerie , a gigantic structure that extends and fortifies the natural defensive position of the hill. The fortress is nearly invulnerable to ground assault, and the sky is heavily patrolled by dragons and aven. Dromoka makes her roost in the Great Aerie. Mer-Ek , the colossal fortress that protects Arashin. In the alternate timeline, it is incorporated into the Great Aerie. the Lookout Roost , a watchtower far in the desert that guards the border with the Sultai. It rises four hundred feet into the air, is built of a reddish stone, and peopled by Vulture- aven that have been given the Roost to watch over. In the alternate timeline, the Aerie of the Unfettered is the only settlement in Dromoka lands that is home only to dragons. The Unfettered owe no fealty to anyone and have no humanoids under their protection Khava , a settlement two days away from Arashin. The Jeskai Way and the Ojutai control the waterways of Tarkir. Part of the population is settled in one of the four main strongholds or one of the many villages along the rivers and lakes, all located far away from the lands of the Abzan. Sage-Eye Stronghold is the prime stronghold. It is built into the side of a mountain at the edge of a bay ringed by mountains. In the alternate timeline, this is Dragon's Eye , the secondary sanctuary and roost of the dragonlord Ojutai Dirgur Stronghold , built on an island amid a vast lake. It is surrounded by a floating village with a network of wooden bridges. It is not the most secure stronghold, but it is the closest to both the Salt Road and the lands of the other clans. Cori Mountain Stronghold , constructed inside an ancient flooded caldera. An immense and well-preserved dragon skeleton surrounds the stronghold like a perimeter fence. In the alternate timeline Cori Mountain Sanctuary is the primary roost and intellectual retreat of Ojutai. Riverwheel Stronghold , a white-walled fortress built into the side of a cliff. A huge waterfall flows through it. In the alternate timeline this is known as Icefall . The waterfall is frozen, perhaps by the magical intervention of cold-loving Ojutai dragons. Purugir , the clan's largest trading post, is located in a canyon along the Salt Road. Highspire Stronghold , a minor stronghold on the border. The Trail of Dead Emperors , a route through the mountains marked by towering white standing stones. The Dead Reckoning , a route through a treacherous swampy region with a reputation for fatalities. The Sultai Brood and the Silumgar reside in large city temples, necropoleis, and pleasure palaces hidden in a massive river delta with vast, lush tropical jungles and swamps. These Sultai lands share a border with the lands of the Abzan. The Sagu Jungle is the ancestral home of the naga . Many enormous beasts dwell there. Kheru , the central place of worship for the Sultai. In the new timeline, it is the center for arcane and scholarly research among the Silumgar. The Kheru Temple , from where Sidisi rules. The Qarsi Palace , a sprawling, luxurious jungle paradise set on the waterways. The Crocodile Pits . Those who earn the displeasure of the Sultai wind up as afternoon snacks in the crocodile pits. The Gudul , a series of islands that dot the delta. The Gurmag Swamps , a belt of treacherous swampland that encircles part of the Sultai / Silumgar domain. Ukud Necropolis , an impressive building containing the tombs of the Sultai ancestors. Home of the Rakshasa . In the alternate timeline, it serves as the resting place for the bones of Silumgar's high-ranking dragons, which he has forbidden from being raised. It also serves as a vault for his treasures. the Marang River , sourced by the snowmelt of the Mardu Mountains. The Marang River Fortress , which is near a small, steep pass where the river comes out of the mountains. In the alternate timeline, this is the seat of Silumgar's power. Molderfang Falls , a sacred site where the ancient dragon Silumgar was felled and crashed into the river. The steppes and plateaus of Tarkir are home to the semi-nomadic Mardu Horde and the Kolaghan . Wingthrone , the Mardu fortress where Kolaghan died in ancient times, smashed against a cliffside. Non-existent in the alternate timeline. Goldengrave , a grassy expanse where many Mardu battles have been fought. The Scour , a deep chasm passes through the Qal Sisma mountains in Temur territory, that continues like a scar into Mardu lands. Eroded by constant winds spiked with fine black grit. Screamreach , a system of chilly bogs and swamplands. In the new timeline, this is the favored domain of Kolaghan. Sandsteppe Gate , the connection between the lowlands and the rolling hilly meadows. The Qal Sisma mountains are inhospitable, but it's the region where the nomadic Temur Frontier and the Atarka spend much of the year hunting. The Melting Wilds . In the alternate timeline, the arrival of Atarka, and the storms that birthed her brood, were accompanied by widespread melting of the icy reaches in the Qal Sisma Mountains. Many of the mountaintop glaciers are now gone, and sudden floods caused by rapid ice melt are frequent. Karakyk Valley , a glacier-carved valley that functions as their permanent winter residence for the coldest two months of the year. Ayagor, the Dragon's Bowl . The cirque of Karakyk does not exist in the alternate timeline. Instead, the spot where Atarka first settled has become a central gathering place. Ayagor is a shallow, high valley whose ice has melted completely. The Staircase of Bones , a rounded hilltop that functions as the meeting place for the various family hunting groups. Qadat, the Fire Rim , home of the Efreeti. In the new timeline, it was conquered by Atarka. The Dragon's Throat :  a high, winding valley deep within the mountains. Winds blowing through this valley create a continuous wail that is known as the Voice of Dragons. The shamans come here to whisper to very powerful spirits . Ugin's Nexus : a point, deep within the ravine where Ugin 's bones rest. There, reality is always shifting and twisting. In the alternate timeline this is the Crucible of the Spirit Dragon . The Eternal Ice or Eternal Peak , a holy mountain where hunters dare not hunt and only whisperers walk when they are lured there by the voices of the ancestors. Tarkir is a plane of five warring clans, each worshipping one aspect of the dragons: Atarka clan dragon. Humans : The primary humanoid race that is found in all five Clans. Dragons : Born from the dragon tempests that are tied to the spirit dragon Ugin . While his death resulted in their extinction in the old timeline, in the new timeline, Ugin's salvation led them to ascend past the other races of Tarkir, becoming the rulers of the plane. More information is below. Aven : Tarkir Aven come in the shape of different birds, including vultures, ravens, rails, and falcons. They are found in all clans except for the Mardu in the old timeline and appear mostly in the Ojutai and Dromoka Clans in the new timeline. Ainok : Canine humanoids that survive in the harsh environments of the plane. Affiliated with the Temur and Abzan in the old timeline and chiefly with the Dromoka in the new timeline. Djinn : Inhabitants of Tarkir's high peaks, affiliated with Jeskai and the Ojutai. Demon : Summoned by the Sultai and the Silumgar Clans through deals with the Rakshasa. Efreet : Inhabitants of Qadat, the Efreet are aligned with the Jeskai Way in the old timeline and the Atarka in the new timeline. Kirin : Messengers that appear in fateful moments. Goblins : Pack creatures aligned with the Temur and Mardu in the old timeline and the Kolaghan and Atarka in the new timeline. Loxodons : Mammoth-like humanoids primarily native to the Qal Sisma Mountains. Naga : Created from humans through ancient deals with the Rakshasa, the Naga aligned with the Sultai and Silumgar Clans. Orcs : Savage humanoids which are found primarily among the Mardu, Temur, and Abzan Clans in the old timeline and Kolaghan in the new. Ogres : Feral humanoids aligned with the Mardu and Temur in the old timeline and the Atarka in the new timeline. Phoenixes : Firebirds aligned with the Temur Rakshasa : Cat-like demons, the Rakshasa are masters of dark pacts. Vampires : Bloodsuckers aligned with the Sultai. Yetis : Mountain-dwelling humanoid beasts. Zombies : Called sibsig , they serve the Sultai and the Silumgar as an army. Five types of dragons, each led by a prominent and eponymous figure, existed: Dromoka's Brood , named after their female champion , were revered by the Abzan Houses for their endurance. They were robust, ankylosaur-like beasts well protected by scaly armor, and breathed beams of light. They were drawn to Tarkir's hot and sunlit deserts. They attacked the Abzan over their \"necromantic\" ways, seeing their summoning of the spirits of the ancestors as an affront to nature and life, and thus massacred them until their khan, Daghatar , was brought before Dromoka's presence in the new timeline, years after Ugin's injury. Learning why she acted as she did, he ordered the end of the Abzan kin-tree traditions, installing instead a pact with the dragons. Ojutai's Brood , named after their male champion , were admired by the Jeskai Way . They were lithe, feathered winged creatures drawn to Tarkir's cold peaks, and with an icy breath. They were cunning and treacherous, forcing the Jeskai into a battle of wits for their survival. Though Ojutai's motivation to kill the Jeskai was never made entirely clear, he and his brood established themselves as exceptionally dogmatic individuals after taking over the Jeskai, when they attacked the meeting of the khans. Accepting Shu Yun 's terms of surrender, Ojutai ordered the execution of every ghostfire Jeskai warrior. Finally, as the new leader, he demanded that the records of the Jeskai were edited to rewrite history in his favor, declaring himself ruler and the Jeskai abolished. In the new timeline, Ojutai seems to have mellowed out and is much kinder and closer to the humanoids of his Clan. Even when Narset discovered the secret of his rewriting Tarkir's history the dragonlord simply smiled and encouraged her to seek further knowledge and enlightenment. Silumgar's Brood , named after their male champion , were inspirational to the Sultai Brood . They were snake-headed creatures with a corrosive, venomous breath, associated with the misty jungles and swamps, stealing treasure and spreading death everywhere. In the new timeline, the Sultai khan offended the Rakshasa and the Nagas , prompting them to abandon the clan, and forcing them thus to make a pact with Silumgar and his brood. Tasigur betrayed the other khans by revealing to Silumgar the location of their meeting, under the promise of a special place of power under Silumgar's regime. His 'reward' was to become a pet for Silumgar to display his dominance over. Kolaghan's Brood , named after their female champion , were imitated by the Mardu Horde . They were slim creatures with four feathered wings and an assortment of frills and spines, capable of conjuring lightning. Taking dominion over the hills and steppes, they fought viciously against the Mardu. In the new timeline, Kolaghan and her brood initially established themselves as the sole non-tyrannical dragons, not interested in enslaving the Mardu. In time, however, the dragonlord became a fearsome leader, using violence, cruelty, and her trademark unpredictability to keep the clan in line. Unlike the Mardu, the Kolaghan follow no code of honor. Their ambitions are to raze the other Clans down and bring ruin wherever they go. The Kolaghan pine for freedom, from civilization, from limits, from any form of honor or law. Atarka's Brood , named after their female champion , were honored by the Temur Frontier . They were robust, bestial dragons with antlers and horns and fur, breathing green flames. Preferring the cold slopes, they were driven by hunger alone. In the new timeline, Atarka's barely sapient mentality proved to be the salvation of the Temur, as Yasova satiated her hunger by feeding her mammoth carcasses, distracting the dragons from attacking her clan. In exchange for feeding Atarka, the humanoids are tolerated by Atarka's Brood as long as they stay useful to her. Following the rise of the broodlords and the passage of time, the dragons matured to new levels of power, gaining the additional title of Elder . While these five dragons are no doubt the most powerful on Tarkir, the term is used separately from the Elder Dragons that once waged war across the multiverse, making them a distinct breed of dragon rather than dragons of the same caliber as those ancient creatures. Draconic Khan (Tarkir Common) Ugin 's runic language Tarkir is influenced by the history and cultures of Asia. The Abzan were based on the Persian Empire in modern-day Iran, the Jeskai on Shaolin Monks of China, the Sultai on the Khmer Empire of Cambodia, the Mardu on the Mongols and Japanese, and the Temur on Siberian shamanists. Djinns and Efreets are from Arabic mythology, Rakshasa are from Hindu mythology, Nagas are from Buddhist and Hindu mythology and the Kirin are from East Asian mythology. The presence of orcs follows Tolkien's depiction of them, which brings with it the contested racial caricatures of Mongol tribes. Tarkir was built from the plane Mongseng from Planechase 2012 . After the decision was made to use Mongseng as the setting for a full block, unspecified considerations led to the renaming of the plane. Associated cards: Referred to: Magic Creative Team (September 3, 2014). \" Planeswalker's Guide to Khans of Tarkir, Part 1 \". magicthegathering.com . Wizards of the Coast. Magic Creative Team (September 10, 2014). \" Planeswalker's Guide to Khans of Tarkir, Part 2 \". magicthegathering.com . Wizards of the Coast. Wizards of the Coast (September 3, 2014). \" Khans of Tarkir Worldbuilding Panel at PAX \". magicthegathering.com . Wizards of the Coast. The Magic Creative Team (January 7, 2015). \" Planeswalker's Guide to Fate Reforged \". magicthegathering.com . Wizards of the Coast. The Magic Creative Team (March 11, 2015). \" Planeswalker's Guide to Dragons of Tarkir, Part 1 \". magicthegathering.com . Wizards of the Coast. The Magic Creative Team (March 18, 2015). \" Planeswalker's Guide to Dragons of Tarkir, Part 2 \". magicthegathering.com . Wizards of the Coast."}