{"text": "Tatsunari is a human ninja member of the Mukotai Reckoners in Kamigawa .  He is famous for riding a massive frog called Keimi . If the Mukotai Reckoners were considered outsiders, Tatsunari was the outsider to the outsiders. Smaller and weaker than most of his peers, he stuck to petty crimes like shoplifting and vandalism. Then one day he tried to steal a monk 's coin purse, and he was caught by the kami the monk was channeling. At that moment, he knew if he, too, could have a kami, he would be the strongest member in the Mukotai, and no one would look down on him ever again. But kami magic is not freely given. The spirits all saw through Tatsunari's selfish motivations. Tatsunari hated kami for shunning him. He befriended a spy from the Order of Jukai and learned their codes in order to infiltrate a village, poison their monks, and threaten the bonded samurai Chishiro in an unsuccessful attempt to force the kami Kaima to bond with him. After the crazed kami rampaged through the village and chased him off, Tatsunari returned to Towashi and joined the Mokutai Reckoners gang. The frustrated ninja took matters into his own hands and fished a a corpse-swallower toad out of the Towashi Undercity canal. He spent years caring for it, and it grew and grew until it was as large as a horse. Tatsunari hopped on its back and became the Toad Rider , terrorizer of innocent people all over Towashi, but he had a special grudge against Boseiju and the kami. When he found a sword hilt belonging to the Order of Jukai in a secondhand parts store, he immediately bought it and had it forged into a new weapon just for him. Searching for kami to enact his revenge on, he sent a scout to the neighborhood of Far Corner at the edge of the Jukai forest. After the scout was killed by a kami, he led the gang into the neighborhood astride his toad. Recognizing Tatsunari, the samurai Chishiro killed Keimi and drove Tatsunari out of the neighborhood. Claiming Tasunari's sword, the kami bonded to it revealed itself to be Kaima. The samurai and the kami could start healing and renew their relation. Tatsunari is inspired by the Japanese folkloric character Jiraiya . Associated cards:"}