{"text": "Taysir of Rabiah was the most powerful of the prerevisionist planeswalkers , and where he stands compared to Urza is debatable. His life was long and complicated, going from victim to hero to villain and hero again. His storied life was unique even before his planeswalker's spark flared—during the Thousandfold Refraction of Rabiah , he was copied five times, once for each color, instead of a thousand times, one for each version of Rabiah. According to the Lore of the Ancients , the One Made of Five would become the most powerful sorcerer ever known if all five of his selves were joined within one body. Taysir the White (Dervish) Taysir the Blue (Baby) Taysir the Black (Apprentice) Taysir the Red (Nomad) Taysir the Green (Herder) The red Taysir became a nomad, the green one a herder. The blue Taysir remained a baby and was hidden by El-Hajjâj to prevent his daughter, the evil Sorceress Queen Nailah from abusing the power of the Taysirs. The white Taysir became a dervish and took Raghib as his servant, not knowing that Raghib had been Nailah's lover until he had outlived his usefulness to her and she had cursed him with leprosy. Nailah seduced the black version of Taysir and had him kill and absorb the green one, for it had been prophesied that if the five were reunited they would become the most powerful planeswalker in existence. But then the black/green Taysir rebelled and managed to warn the nomad Taysir, whom he also gave the Ring of Ma'rûf , an artifact that could be used to track down the other Taysirs. The nomad merged with the dervish, and they later with the baby. The Nomad Taysir eventually came back for the others, defeated Nailah, and merged with his last living counterpart, becoming the most powerful wizard in the known multiverse . (He retained this designation until revisionist continuity classified Urza as the most powerful.) After Taysir became a planeswalker, Nailah tried to seduce him via the black part in him, but he hit her with an energy blast, and planeswalked away. Nailah was furious that she could not harness the powers of Taysir and created a barrier around the Rabiahs, preventing him from ever returning. Taysir Revealed Taysir happened upon Dominaria just before the Shard formed, trapping him in the twelve-plane nexus. But he was not alone—on the Dominarian continent Corondor , he met and fell in love with a fellow planeswalker Kristina of the Woods . They explored the twelve planes, helping troubled peoples where they could. One day, they were drawn, like many other planeswalkers in the Shard, to the Summit of the Null Moon by the planeswalker Faralyn , to discuss the Shard and how to break it. Faralyn, Tevesh Szat and Leshrac however had their plans for the Summit: they made sure battle would break out among the present 'walkers, hoping that one of them would be killed so they could use the energy released with that death to puncture the Shard for themselves. Taysir and Kristina survived, but Faralyn's spellsquire Ravidel did not, and neither did his friend Chromium Rhuell . Taysir and his lover combined their magic to bring Ravidel back to life, but the man was furious that they helped him, not Rhuell. A short time later Taysir and Kristina aided Freyalise in a plan she and Kristina had thought up during the Summit: the casting of the World Spell . This ended the Ice Age of Dominaria and ended the time of the Shard. Taysir and Kristina were finally free to move about the multiverse. Taysir wished for Kristina to help him return to Rabiah, which was within her power—but they would then both be trapped there forever, which she could not live with, now that the entire multiverse was open to her. The two parted ways, and the embittered Taysir took on Ravidel as an apprentice. Ravidel pushed his teacher to return home using the same means Faralyn had used to escape the Shard—by sacrificing another planeswalker. Taysir eventually relented, deciding to hunt down and execute the evil Leshrac and Tevesh Szat. Szat could not be found, and while Leshrac was defeated, Taysir couldn't bring himself to kill him. In the end, he imprisoned Leshrac deep in hellish Phyrexia instead, depriving Taysir of the energy he needed to return home. Ravidel, who had hoped to get rid of Leshrac, who had killed him, and Szat, who had killed Rhuell, started their plans to get vengeance and often left Taysir's side for long stretches at a time. Kristina, meanwhile, had fallen in love with the minotaur planeswalker, Sandruu . Ravidel, who secretly also hated Taysir and Kristina for failing to save Rhuell, discovered the relationship and told Taysir, who was still carrying a torch for Kristina. Taysir attacked Sandruu and pursued him when he fled to his homeworld, Ulgrotha . There, he defeated Sandruu and banished him to a remote plane that would take him a millennium to find his way back from. This enraged Feroz , the planeswalker guardian of Ulgrotha and a friend of Sandruu's, who fought Taysir and killed him by splitting his skull with a broadsword. But Taysir's essence was not completely gone. Over two centuries, the Anaba Ancestors and spirit-crafters tempered Taysir's fury and redeemed his spirit. He managed to resume physical form, now that of a withered old man as a sign of his repentance. On Ulgrotha he found a young native planeswalker, Daria , and took her as his apprentice and as his foster daughter. Once Daria was strong enough to take care of herself for short periods, he began looking around the multiverse now and then, still remembering his love for Kristina and vowing to punish Tevesh Szat. He, like many others, was drawn to Dominaria by the Mox Beacon and played a role in the Planeswalkers' War on Corondor. However, we do not know what this role was, as the Planeswalkers' War comic was never released. At some point before his death in Phyrexia, Taysir translated and wrote a commentary on Kayla bin-Kroog's history of the Brothers' War . When the Phyrexian Invasion began, Taysir and Daria were living in a cottage near the lands of the Anaba mountains. Taysir was one of the Nine Titans recruited by Urza to participate in the attack on Phyrexia. Since Teferi opted out at the last minute, Daria took his place. This team of planeswalkers included other people from his past, like Kristina, Freyalise, and, of all people, Tevesh Szat . Urza insisted on Szat's participation over everyone else's objections in the group. The objections were not unfounded—Szat killed Kristina by \"accident\" early in the assault, then hunted down and deliberately killed Daria later on. Urza knew Szat would betray them, however, and allowed him to do so that he would have the moral ground necessary to kill him to charge one of his weapons. Taysir, grieving, grew mutinous; when Urza's sympathy with Phyrexia made him switch allegiances, Taysir attacked him, but Urza activated the kill rubric in Taysir's Titan Engine , killing him. Later, another member of the Titans, Lord Windgrace , performed the ritual of Dalfir on him, which involves taking the heart out of a corpse to prevent necromancers from abusing it. When last seen Windgrace had placed Taysir's heart inside his chest. Dominaria Phyrexia Rabiah Ulgrotha Quoted or referred to:"}