{"text": "Tazri is the general of the allied forces on Zendikar , and was a trusted advisor to Commander Gideon Jura . Tazri was instrumental in the recapture of Sea Gate from the Eldrazi titan Ulamog 's brood. She took over as Commander of Sea Gate when Gideon left the plane after the defeat of the Eldrazi. Tazri wears a glowing halo around her neck. As a successful, nearly twenty years old caravan captain on the Tazeem roads, Tazri once came upon an angel who was severely wounded in a battle with vampires . She killed the angel as an act of mercy and took the angel's halo as a way to remember her. Although the angel had asked for it herself, the killing caused Tazri to be cursed. Over the next four years, she fell on bad times and was forced to find a low-status job at the Sea Gate militia. She immediately caught the interest of militia captain Vorik , who saw her potential as a leader, despite her decline in fame over the years. Fifteen years later, after the initial release of the three monstrous Eldrazi titans, the city of Sea Gate on the continent of Tazeem was established as the primary bastion for the allied forces of Zendikar. However, it was soon overtaken by the Eldrazi. At this point, Tazri was the primary advisor to Commander Vorik, the trusted military leader from the city. She first met Gideon Jura in a refugee camp outside the city, after a battle with Ulamog's spawn. The animosity between the pair quickly blossomed, after the commander began to value Gideon's advice over Tazri's while establishing a new camp at a floating hedron known as Sky Rock. However, Vorik's injuries after the battle soon proved lethal, and, contrary to Tazri's wishes, he named Gideon as his replacement. The coldness between now-Commander Gideon and his general only increased after this, yet she eventually realized that Gideon was, in fact, there to help her and retake Zendikar. Tazri joined Gideon, the vampire Drana , and the kor Munda in an attempt to retake Sea Gate. After a failure during the battle, resulting in the deaths of many Zendikari, Tazri's disdain for the planeswalker only continued to grow, and her anger intensified as she believed he was leading her people to certain death. Despite her worries, Sea Gate was reclaimed after intensive training; however, the merfolk Jori En soon arrived with bad news: the Eldrazi titan Ulamog himself was approaching Sea Gate. At this time, Tazri was meeting with Gideon and his other advisors, and first met the planeswalkers Nissa Revane and Kiora . After hearing of Ulamog's approach, Tazri pushed to evacuate the city, believing anything else would be suicide. However, Gideon, Drana, and Kiora all formulated a plan to battle with the titan, and the planeswalker Jace Beleren soon returned from the Eye of Ugin , saying Ulamog could be trapped using an aligned hedron network. Tazri, Beacon of Unity. Despite her concerns, Tazri begrudgingly went along with the plan, and Ulamog was trapped. After this, though, the demon planeswalker Ob Nixilis appeared and disrupted the network, leaving Ulamog to ravage the city and waking Kozilek as well. In quick succession, the planeswalkers dedicated to stopping the Eldrazi were either defeated or had gone missing. Beset by the distortions of Kozilek, Tazri was saved by the protection of her halo. She regrouped with the roilmage Noyan Dar , the vampire queen Drana , and the Kor squad leader Munda and, inspired by the angel she had killed so long ago, took command. Her group was able to point the way to Ob Nixilis and his planeswalker captives when Chandra Nalaar arrived. Tazri partook in many battles against the Eldrazi and ultimately withstood their assault thanks to the power of the halo and the soothing, forgiving angelic power within. She survived the last confrontation with Ulamog and Kozilek, in which the Titans were defeated by the Gatewatch and their allies. Afterwards, she would be leading the rebuilding of Zendikar's civilization. In the wake of the Eldrazi's fall, a plan was needed to rebuild Sea Gate . Unfortunately, the Sea Gate Reconstruction Project found itself with a few plans too many. Each of the five expeditionary houses presented its vision for a wonderful new city. Fed up with the houses' infighting, Tazri drafted a plan of her own. Surprisingly, Tazri was as good of a city planner as she was a military leader. Her proposal outshone any offered by the expeditionary houses, and she quickly got a large portion of the populace on board. The angel Linvala immediately stood behind her proposal, and the word of an angel swayed even the stingiest expeditionary house. Within a year, the city was restored. When Zendikar became a target in New Phyrexia's Invasion of the Multiverse , Tazri had to lead the defense of Sea Gate once again. She received a halo-blessed vision of the return of Nahiri that would mean a turning point in the battle and sent Akiri , Linvala , Kaza , and Orah to investigate. After the defeat at Sea Gate, Tazri joined the others to attack Nahiri in the heart of the transformed Emeri Skyclave . Though Nahiri at first gained the upper hand with ease, the fight turned as the angels of New Capenna entered the Multiverse and gave angels everywhere access to Halo . With Linvala's newfound strength, and Tazri's halo, the party managed to break Nahiri loose from the reformed Hedron network and knock her from her feet. As they escaped, they witnessed the Skyclave breaking and crashing to the ground with Nahiri still inside. Depicted in: Quoted or referred to:"}