{"text": "Teferi Akosa (teh-FAIR-ee) is a Jamuraan who studied at the Tolarian Academy and a planeswalker who lost his spark, later regained it, and lost it as part of the consequences of New Phyrexia's Invasion of the Multiverse . He is considered the Father of Zhalfir , although his later phasing of the kingdom earned him the nickname Destroyer of Zhalfir . Teferi is a six-foot-tall dark-skinned man with black and gray hair and dark brown eyes. He is a philosopher and scientist. He eschews violence and will attempt to deal with opposition via the control of its allies and the eventual removal of its power base. He is a chronarch, a wizard who can manipulate the flow of time . He has limited knowledge in scrying and mental spells for reading memories. Teferi is primarily blue -aligned, but secondary in white mana. As he planeswalks, he disappears in a blue whirlwind. Young student at the Tolarian Academy Although the young Teferi was a prankster and at times a bully, he had considerable magical potential and was thus brought to Tolaria , where the planeswalker Urza had founded an academy to train the mages of Dominaria and prepare the plane for an attack from Phyrexia . It was at the academy that Teferi first met Jhoira, Karn, and Barrin. Although they would become his best friends later on in time, he got off on the wrong foot because of his constant practical and less practical jokes. One day, the Phyrexians attacked the island, and Teferi and Jhoira were killed. Urza sent Karn back in time to prevent the attack; the golem was successful, but the time machine overheated, causing a massive explosion that killed many and completely disrupted the time stream of Tolaria. Teferi survived but was caught in a slow-time bubble for thirty years, though he only experienced it as thirty seconds. After some time Jhoira, who had also survived and was stranded in a normal time zone, found him like that and threw a wet blanket at him. Five years later that blanket put out the fire on his clothes. Teferi trapped in the temporal bubble After Karn, Barrin and Urza returned and rebuilt the academy, Jhoira fell into a coma. When she awakened 10 years later, she discovered a way to free Teferi. She constructed a machine that used the water of Tolaria (which wasn't affected as drastically by the time anomalies as organic material) to create a portal between the normal time zone and Teferi's bubble. It was only a prototype, but the resilient bodies of Karn and Urza could pass through and pull Teferi out. For a while, he felt depressed and out of sync with the world because everyone he had known had either died during the explosion or had aged 20 years while he had been in stasis. But with a little help from Karn and Jhoira, he was back to his usual tricks soon after. Along with the rest of the surviving students, Teferi moved to the grand sailing ship New Tolaria to continue his studies. Some years later a more mature Teferi was told by Urza that he should accompany Jhoira to her homeland of Shiv , where the two worked on the Thran Mana Rig that could produce the powerstones needed to fuel the artifacts Urza built to battle the Phyrexians. Although there had always been an age difference between them (which had only become more pronounced while he was trapped in the time bubble), some romantic feelings developed between Teferi and Jhoira. Time had little meaning for students of Tolaria anyway. For a while Teferi stayed closely involved in Urza's crusade against Phyrexia, helping out in the battle against K'rrick and the battle for Serra's Realm , but after a while he became a Royal Mage of his homeland of Zhalfir , becoming a protector of the region. When Jhoira brought Serran refugees to Zhalfir, Teferi proposed to the artificer, though she declined. He did befriend the reclusive Jolrael , but this never became more than friendship and he didn't try to persuade her to return when she forsook civilization to live in the deep jungle. Teferi, Mage of Zhalfir As his power and influence grew, he used it to conduct risky experiments related to time magic and phasing — until one of them went wrong. But instead of disaster, something else struck in its stead. Something inside of him activated. A Spark ignited . Teferi had become a Planeswalker. Feeling the urge to wander the planes, he created the Creed structure of Zhalfir to aid the country in his absence. Thus the Civic Creed, the Shaper Creed, the Shadow Creed, the Armorer Creed and the Granger Creed were called into existence. When he returned, however, Teferi found the continent on the brink of war. Southern Zhalfir had split off and formed the theocracy of Femeref because the churches didn't agree with the fact that Teferi had left control of the dead in the hands of the Shadow Creed. When Femeref had found gold in the mountains, the northern country of Suq'Ata had invaded part of Zhalfir and had driven the dwarves there from their mountain homes. When the dwarves had aided Femeref in harvesting the gold, increasing their efficiency greatly, Zhalfir felt cheated out of their rightful portion of the gold. Teferi tracked down and tutored a capable girl of royal descent. After Teferi crowned her as Queen Yormeba she brought peace to the nation but failed to unify it. Tired of the petty squabbles of his people, Teferi left with a group of trusted advisors, sages, artificers, and sorcerers. They sailed for a hidden realm in the Chaza Isles , where Teferi wanted to manipulate time to make it easier to summon creatures. The experiments met with limited success, but after years of trial and error, Teferi realized that the process was inherently unstable. By then, however, the damage was done. The earliest experiments of Teferi had been clumsy and had damaged the temporal balance. Teferi attempted to correct the problems by unleashing a blast of mana to repair the hole in the stream. Although he had anticipated danger, he did not anticipate the results of his “cure”. The unleashed mana burned into all plants, animals, and buildings on the isle. Instantly everything but the bare rock of the island was phased out of existence. After two hundred years, Teferi's Isle returned. For a long time, its people were unaware that any time had passed, but when one of Jolrael's dragons attacked the isle, they began to realize something was wrong. Teferi did some research and discovered that they had been absent from time for quite a while and that his \"cure\" for the timeline had indirectly caused a great war on the mainland. The energy surge had attracted three powerful mages. The first was Mangara , a wise man from Corondor who was versed in politics and had been attracted out of curiosity. The second was Teferi's old friend Jolrael, coming to see what happened to her friend. The last one was Kaervek of Urborg , who wondered if he could use the power for his gain. After realizing that there was nothing on the island but bare rock, the three moved to the mainland to monitor it from a more comfortable place. Mangara involved himself in local politics and with his brilliant diplomacy, he solved the struggles between the countries and managed to put himself in the position of de facto ruler. A jealous Kaervek manipulated the xenophobic Jolrael into joining his side and the two of them amassed an army. After imprisoning Mangara in an Amber Prison , they declared war on the three nations. Unable to interfere directly with the war because of his need to monitor and reconstruct the timelines, Teferi aided the defenders with visions and sometimes helped empower their spells. However, during the remainder of the war, he remained on the sidelines. Still, he felt tremendous guilt over his role in causing the conflict. When Jolrael had defected to the defenders and ambushed Kaervek on his flagship, Teferi finally intervened, sinking Kaervek's armada and sending a drake to rescue Jolrael. Following the war, Teferi remained a recluse in the Chaza Islands and gave up manipulating with time. Teferi later appeared during the Planeswalkers' War on Corondor to save Daria from an Amber Prison. Teferi and Urza destroying the Phyrexian Portal Shortly prior to the Phyrexian Invasion , Keld attacked Jamuraa. For reasons unknown, Teferi stayed out of the war until the last moment when he defeated the Keldons. They made Teferi realize that he didn't want to be part of Urza's plans to fight Phyrexia anymore. He declined Urza's request to become part of the Nine Titans to begin to devise an alternative. When the invasion began and a portal opened in the sky over Zhalfir, Teferi convinced Urza to join him in teleporting in and out of the portals with him, overloading them. Teferi told his former tutor that he had the plan to use the resulting energy, but when Urza found out what this plan was, he wasn't happy about it. Teferi weaved it into one gigantic phasing spell that removed northwestern Jamuraa and the part of Shiv that Jhoira stayed on from the time stream to save them from the horrendous attacks of the Phyrexians. A furious Urza ordered Teferi to stop, for this action would remove many powerful allies from the time stream, but it was too late. One hundred years later the goddess Karona was looking for beings like herself. While doing so she pulled Teferi back into the time stream. Although he couldn't help her, he did get to see Dominaria again and realized the Phyrexians had been defeated. He left contemplating whether it was time to bring the phased-out lands back. Nearly three hundred years after the Apocalypse, Teferi and Jhoira returned to Dominaria to return Zhalfir and Shiv safely to their home plane. Teferi was terrified to find that Dominaria was almost completely barren of mana. After consulting Freyalise , Teferi was shocked to learn that he was reportedly seen speaking with Karona nearly two hundred years ago. Teferi did not know about the meeting, which casts doubt on whether or not the gathering actually took place. After Freyalise refused to help any outside of Skyshroud Forest , Teferi allied with Radha , a Keldon half-elf, and Venser , an Urborg artificer, to permanently close the time distortions that had gathered at several key locations on Dominaria. After losing a battle against Nicol Bolas , Teferi gave up his planeswalker's spark to seal the time rift over Shiv, restoring the continent to its rightful form. Moving to seal the other rifts, Teferi, Jhoira, and Venser teleported to Urborg, shifting to an alternate timeline in which the Ice Age never ended and Lord Windgrace was battling another Phyrexian invasion . Realizing the potential of Venser's latent spark, Teferi and Jhoira used their magic to help Venser complete his first planeswalk back to the Dominaria they knew. The Zhalfirin rift suffered a different fate. Jeska , manipulated by Leshrac , used Radha as a mana lens, forcefully closing the Zhalfirin rift. Without precise timing, the phased lands of Zhalfir were seemingly lost forever, although Teferi said that he could probably save it if he was still a planeswalker. Teferi and his daughter Niambi While trying to find a new purpose for his life, Teferi met the caravan drover Subira . She had a wit as sharp as Talruum crystal, and twice as lethal if she chose to turn it on you. When he met her, she thought he was a murderer for phasing out Zhalfir. Once he convinced her he didn't casually kill people, they got along great. Teferi decided to travel with the caravan for a week, and that week became a month, and that month was the happiest month of his entire life. They were wed soon after that and had many simple, happy years together. They left the caravan and settled down long enough to have their daughter Niambi . However, Subira's heart belonged to the road most of all, and she returned to the caravan when Niambi was very young. She visited as often as she could, but Teferi was the one who raised their daughter. Jhoira hands over the Powerstone that contains Teferi's spark By 4560, Niambi was an adult and Subira had passed away of old age. At this time, Teferi was searching for artifacts that Urza had left  that could be of help in repairing the Zhalfirin time rift. With help from his daughter, the Weatherlight crew and the Gatewatch , he retrieved one of these artifacts, the Starfield Orb , from a monument in the Tivan Desert. After this, he joins Jhoira 's crew to fight Belzenlok . Unbeknownst to Teferi, Jhoira wore an amulet around her neck, which contained a small Powerstone which held Teferi's Planeswalker spark. She has made this stone herself at the Thran Mana Rig . After several other planeswalkers unexpectedly showed up, Jhoira finally found the right moment to hand it over to Teferi. After he became a Planeswalker again he joined the Gatewatch to fight Nicol Bolas . Teferi saves many lives during the War of the Spark Teferi traveled with the Gatewatch to Ravnica for the final confrontation with Bolas, and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, he fought against the Eternals of Bolas' Dreadhorde . At the start of the conflict, Teferi slowed down the time around the Planar Bridge , thus greatly delaying the advance of Bolas' army. He also used his time manipulation abilities to save many planeswalkers and Ravnicans from the Eternals. According to Jace, he may have saved more lives than anyone else that day. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Jace, Jaya, Teferi, and Vivien volunteered to assassinate Liliana. When they found her, Teferi warped time around her, slowing her ability to react, defend herself, or strike back at her attackers. This allowed Jaya and Vivien to badly wound her with fire, arrows, and animal spirits, although the Onakke spirits in Liliana's Chain Veil protected her. Nonetheless, they almost succeeded, but Bolas stepped in and saved Liliana by destroying the buildings they were standing on. Fortunately, Teferi saved himself and the other three planeswalkers by slowing their falls. Teferi survived the battle and was present during the Planewide Celebration that followed. Teferi participated in the memorial service for Gideon on Theros . Afterwards, Teferi hosted Karn and Ajani Goldmane at his daughter Niambi ’s home in Femeref on Dominaria . There they strategized on how to assist Karn in his plans to help the Mirran Resistance . After coming to Innistrad for the first time, he joined a group of cathars in the hunt for a \"white witch\" in the Kessig woods. There he met the dryad planeswalker Wrenn . While attempting to help her find a new host, a malicious entity assaulted them. Teferi tried to throw the dark beast forward existence but his magic went awry, trapping him and Wrenn in a loop of time. The Dryad taught him a further understanding of metamagic, allowing him to undo his spell, free them, and accidentally accelerate her new host's growth. Thankful, Wrenn promised to return and help the planeswalker undo the spell he cast long ago on Zhalfir , but only after showing her new host the multiverse. Teferi goes to Innistrad to help investigate the Moonsilver Key . Arlinn Kord went to Ravnica to ask The Gatewatch for help to find the Moonsilver Key . She found and explained Innistrad 's situation to Teferi, Kaya and Chandra . The three planeswalkers agreed to help Arlin and headed to Innistrad to fight the coming of the Eternal night . . Together with the cathar Adeline , they decided to go to Thraben to investigate. Teferi, Arlinn, Chandra, Kaya, Adeline, and a group of cathars arrived in Thraben . They found the city destroyed and full of zombies , the army Liliana used against Emrakul . In town, Kaya found a clue to the whereabouts of the Moonsilver Key . The Key should be in the possession of the Betzold family. Arlinn and Adeline knew a Church bishop with that last name. They located bishop Worrin Betzold amid the ruins of a church. The group made its way through the zombies until they reach the bishop. Teferi used his powers to slow down time, thus slowing the undead's advance. Arlinn interrogated the zombie bishop and is given the name Dennick . The group moved to Gavony , where the family had a mansion. In the ruins of the mansion, they found the spirit of Dennick Betzold who tells the group the location of the Key. The key had been given by an ancestor of Dennick to Sorin Markov . At Markov Manor, Teferi and Arlinn waited with Sorin for the vampire to hand over the Key so they can help restore balance to Innistrad. The vampire refuses to give the Key. When Arlinn mentions Avacyn , Sorin attacks twice with his sword. The second time, Sigarda appears by answering a prayer made by the group before entering the Manor and stops the attack. The angel says that the Key is in Sorin's quarters and that she will stop the vampire giving the group a chance to get the Key. Teferi bowed in thanks to the angel and went with the group to get the Key. Along with the other planeswalkers , Teferi protects the Harvesttide festival participants. The party returned to the Celestus in possession of the Key. At that moment, Tovolar launched his army against the Harvesttide festival , but the witches' magical protections managed to stop the werewolves' advance. Arlinn told Kaya to take the Key to Katilda . At this point, the protections failed, so Teferi cast a powerful spell to delay the sunset and the transformation of the werewolves into their wolf forms. Planeswalkers , witches, and cathars began their battle against the invaders to defend the humans . When Teferi's spell wore off, the werewolves complete their transformation, including Arlinn's. During battle the witches begin the ritual. After Tovolar's defeat, he and his army retreat, and Arlinn went to the central area of Celestus. There, Katilda asked Arlinn for help to finish the ritual, but Olivia Voldaren appeared, interrupting and taking the Key away with her. Thus, the Eternal Night began. After the Harvesttide festival ritual failed, Teferi, along with a group of people from Innistrad and Adeline , the planeswalkers Arlinn Kord , Kaya , and Chandra Nalaar decided to help humans in distress across Innistrad. That is until Arlinn decided to return to Markov Manor and ask Sorin Markov for help. In the crypt of the Manor, the group encountered Sorin who says that Olivia Voldaren \"stole\" his grandfather . They formed a pact with Sorin and traveled together to the wedding of Olivia and Edgar Markov at the Voldaren estate. When they arrived, all but Sorin were forbidden entrance. Inside the castle, Sorin managed to disrupt the ceremony and attacked Olivia who dropped the Moonsilver Key . From it, Katilda ’s spirit emerged and freed Sigarda who unleashed a blinding holy aura that shattered windows and broke the manor’s wards. Now free to advance, Teferi used his magic to hasten the entry of their foot soldiers and assisted Chandra in burning through the great doors to the manor, granting full entry to their forces. Teferi was later attacked by Edgar Markov, but Sorin intervened and defeated his grandfather who was allowed to live. Emerging victorious and with the Moonsilver Key now secured, Teferi accelerated their journey back to the Celestus to complete the ritual. After the balance between night and day was restored, Katilda allowed Teferi to borrow the key for his temporal studies. Before leaving Innistrad, Teferi asked Arlinn to be on guard against the return of an old enemy, the Phyrexians . Teferi arrived in Oyster Bay during the peace summit taking place between the Keldons and New Benalia , revealing the New Phyrexian incursions on Kamigawa and Kaldheim . After Phyrexian sleeper agents disrupted the negotiations, Teferi fled with Jodah , Karn , Jaya , and Stenn to the watchtower of New Argive . While attempting to secure the tower, Teferi was gravely injured. The Phyrexians were discovered to be more numerous than initially thought, and Stenn revealed himself to be a Phyrexian agent, soon killed by Karn and Jaya. With the Phyrexians closing in, Karn called the Weatherlight for aid. After being pulled to safety, Teferi was healed by Rafwyn Capashen and spent the next few days recuperating on the Mana Rig with Jhoira and Karn, helping to recruit allies from the Shivan Nation . After recovering, he served as the New Coalition's general and quartermaster, and fought in the Battle of the Mana Rig. He contributed his memories to one of Jaya's memorial pyramids after the battle. Using the Temporal Anchor and Kaya's powers, Teferi sends his spirit into the past to investigate the Golgothian Sylex 's activation. With the Phyrexian multiversal invasion imminent and threatening multiple planes, Teferi, like his mentor Urza before him, rallied multiple planeswalkers (including Kaya, Elspeth, Chandra, Jace, Wrenn, Vivien, Saheeli, and Koth, by proxy) to reinforce as many planes as possible. During this time, he reflected upon Urza's legacy and his own role during the first Invasion, as well as his current status as strategic commander after Karn's capture. To determine the mechanism to fire the Golgothian Sylex , Teferi enlisted Saheeli to develop a device in Urza's Tower that enhanced his time manipulation powers to travel back in time to the Brothers' War . The device implemented the Skyship Weatherlight 's powerstone core, a component which Teferi was forced to fight Ajani over. Their first attempt sent him to 85 AR at the onset of The Dark Age , which wasn't far enough in the past. The second attempt sent him to the Fall of Kroog in 28 AR, which was too far back. His third jump sent him to a battlefield outside Tomakul in 44 AR, his closest attempt to that point. He finally located the moment just before the Sylex Blast during the Last Battle, but there were no obvious instructions as to how to use the Sylex. Left with no time and the New Phyrexians literally at the door, Teferi returned to the Blast, this time allowing it to pass, and entered a moment beyond time with Urza. Asking after the Sylex's trigger, Teferi learned that it was not a spell or artifact but a person that activated it. However, the powerstone overloaded and damaged the Anchor, losing Teferi's consciousness in the time stream. Teferi awoke naked on an unknown shore and began walking inland, finding himself unable to planeswalk away. He soon learned that he had arrived in Zhalfir, realizing that only a decade had passed there and that the Zhalfirins were still preparing for the first Phyrexian Invasion of Dominaria . Spending months as the Shaper Guildmage in a village outside Kiingal , he was eventually summoned to Aku . He found that The Wanderer had been able to reach the land as well, indicating that it had become a pocket plane . He reconnected with Sidar Jabari and Queen Wezna and found that Kaervek had escaped his Amber Prison . It gave him a new resolve to battle the Phyrexians. Teferi and the rest of Zhalfir were found and summoned by Wrenn , who had bonded to Realmbreaker . After Wrenn swapped Zhalfir and New Phyrexia's places in the Blind Eternities , Teferi led the Zhalfirin charge against Phyrexia, resulting in the demise of Vorinclex , Jin-Gitaxias , and Elesh Norn . In the midst of the battle, Teferi searched for the physical form of Wrenn, who was reduced to an ashen form at the base of Realmbreaker. He retrieved a single acorn from her corpse and later planted it on a hill in Zhalfir, mourning the fact that she had sacrificed everything to lift so much of his burden. He then assisted Karn and Melira in a ritual to un-compleat Ajani Goldmane and Nissa Revane . In the aftermath of the Invasion , Teferi's spark faded. Teferi's family name, Akosa, premiered in the non-canon BOOM! comic Magic , but was eventually incorporated into canon during the release of Dominaria United and first appeared on a card in March of the Machine . Teferi is the primary protagonist of the Phyrexian Arc trailer. The first spell that Teferi taught to Jhoira was one that jolted its target with an electric shock. The spell became notorious, and Teferi infamous, causing Tolarian students, professors, and even its headmaster Urza to avoid shaking the young mage's hand. In the video game Magic: The Gathering Arena , Teferi is voiced by Lennie James and Phil Morris . After helping to restore the balance between day and night in Innistrad , Katilda temporarily loaned the Moonsilver Key for Teferi to study. He would later integrate it into the Temporal Anchor . Teferi recovered the Skyship Weatherlight 's powerstone , which he also integrated into the Anchor before it imploded. Associated cards: Depicted in: Quoted or referred to: ↑ Mark Rosewater (June 29, 2020). \" Odds & Ends: Core Set 2021 \". magicthegathering.com . Wizards of the Coast. ↑ In Memoriam - Jaya Ballard ↑ a b Ethan Fleischer (August 24, 2022). \" We're incorporating that element of the Boom comics continuity into the main TCG's continuity \". Twitter. ↑ a b c d e f Miguel Lopez (January 17, 2023). \" Alone \". magicthegathering.com . Wizards of the Coast. ↑ Magic Story Podcast ↑ Wizards of the Coast (April 19, 2018). \" Dominaria’s history and legends are on full display in the new set! \". The Official Magic: The Gathering Tumblr . Tumblr. ↑ Harless Snyder and Natalie Kreider (March 13, 2023). \" Dominaria United #2: Sand in the Hourglass \". The Magic Story Podcast . ↑ Jay Annelli . (2022.) Magic: The Gathering - The Visual Guide , Wizards of the Coast . ISBN-13 978-0744061055. ↑ a b Mirage Character Profiles ↑ a b c Will McDermott (April 1999). \" Scars of the Legacy \". The Official Urza's Legacy Game Guide ↑ a b Magic Creative Team (June 12, 2020). \" Teferi: Behind the Magic \". magicthegathering.com . Wizards of the Coast. ↑ Pete Venters (February 1997). \"Visions Told: The Resolution of the War for Jamuraa.\" The Duelist #15, 63 ↑ a b c d e Reinhardt Suarez (October 21, 2022). \" The Brothers' War - Chapter 1: Stronghold \". magicthegathering.com . Wizards of the Coast. ↑ a b (2006). Time Spiral Player's Guide . Wizards of the Coast . ↑ a b Martha Wells (April 18, 2018). \" Return to Dominaria, Episode 6 \". magicthegathering.com . Wizards of the Coast. ↑ Martha Wells (May 9, 2018). \" Return to Dominaria: Episode 9 \". magicthegathering.com . Wizards of the Coast. ↑ Martha Wells (May 23, 2018). \" Return to Dominaria: Episode 11 \". magicthegathering.com . Wizards of the Coast. ↑ Martha Wells (May 30, 2018). \" Return to Dominaria: Episode 12 \". magicthegathering.com . Wizards of the Coast. ↑ a b c Greg Weisman (April 2019). \" War of the Spark: Ravnica \". Del Rey. ↑ a b Greg Weisman (November 2019). \" War of the Spark: Forsaken \". Del Rey. ↑ a b Seanan McGuire (September 03, 2021). \" Tangles \". magicthegathering.com . Wizards of the Coast. ↑ a b K. Arsenault Rivera (September 22, 2021). \" Episode 4: Harvestide \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (September 8, 2021). \" Episode 2: The Motives of the Wolf \". magicthegathering.com . Wizards of the Coast. ↑ a b K. Arsenault Rivera (September 15, 2021). \" Episode 3: The Fall of the House of Betzold \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (September 29, 2021). \" Episode 5: Night Closes 'Round \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (October 28, 2021). \" Episode 1: Tithes and Invitations \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (November 03, 2021). \" Episode 2: The Dolorous Weight of Pleasantries \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (November 10, 2021). \" Episode 3: Forever Hold Your Peace \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (November 17, 2021). \" Episode 4: The Wedding Crashers \". magicthegathering.com . Wizards of the Coast. ↑ a b K. Arsenault Rivera (November 24, 2021). \" Episode 5: Till Death Do Us Part \". magicthegathering.com . Wizards of the Coast. ↑ Langley Hyde (August 11, 2022). \" Episode 2: Sand in the Hourglass \". magicthegathering.com . Wizards of the Coast. ↑ Langley Hyde (August 12, 2022). \" Episode 3: The Locked Tower \". magicthegathering.com . Wizards of the Coast. ↑ Langley Hyde (August 15, 2022). \" A Brutal Blow \". magicthegathering.com . Wizards of the Coast. ↑ a b c Langley Hyde (August 18, 2022). \" A Whisper in the Wind \". magicthegathering.com . Wizards of the Coast. ↑ Dawn of the Phyrexian Invasion - Official Cinematic Trailer (Video). Magic: The Gathering . YouTube (October 30, 2022). ↑ jay13x . Twitter. ↑ a b Miguel Lopez (October 20, 2022). \" The Brothers' War - Episode 2: The Beginning \". magicthegathering.com . Wizards of the Coast. ↑ Miguel Lopez (October 21, 2022). \" The Brothers' War - Episode 3: Sword One \". magicthegathering.com . Wizards of the Coast. ↑ Miguel Lopez (October 24, 2022). \" The Brothers' War - Episode 4: The Ink of Empires \". magicthegathering.com . Wizards of the Coast. ↑ Miguel Lopez and Jeff Grubb (October 26, 2022). \" The Brothers' War - Episode 5: As Cruel, As Necessary \". magicthegathering.com . Wizards of the Coast. ↑ Seanan McGuire (October 26, 2022). \" The Brother's War - Chapter 5: Exodus \". Magicthegathering.com. ↑ K. Arsenault Rivera (March 24, 2023). \" March of the Machine - Episode 8: Wrenn and Eight \". magicthegathering.com . Wizards of the Coast. ↑ K. Arsenault Rivera (March 28, 2023). \" March of the Machine - Episode 10: The Rhythms of Life \". magicthegathering.com . Wizards of the Coast. ↑ Grace Fong (May 1, 2023). \" March of the Machine: The Aftermath - She Who Breaks the World \". magicthegathering.com . Wizards of the Coast. ↑ a b c d e MacKay, Jed. (2021). Magic . Vol 1, iss 9. ↑ Dawn of the Phyrexian Invasion - Official Cinematic Trailer - Dominaria United (Video). Magic: The Gathering . YouTube (October 30, 2022). ↑ Reinhardt Suarez (October 24, 2022). \" The Brothers' War - Chapter 2: Antiquities \". magicthegathering.com . Wizards of the Coast. ↑ Lennie James as Teferi . IMDB. ↑ Phil Morris as Teferi . IMDB. ↑ Teferi's Protection ↑ a b c d Jed MacKay (2022). Magic . Iss 18. Boom! ↑ Prepare for the Harvesttide Festival – Innistrad: Midnight Hunt (Video). Magic: The Gathering . YouTube (September 2, 2021). ↑ a b K. Arsenault Rivera (March 28, 2023). \" March of the Machine - Episode 9: The Old Sins of New Phyrexia \". magicthegathering.com . Wizards of the Coast. ↑ Jeff Franzmann (December 1996). \"Single Card Strategies: Teferi's Honor Guard .\" The Duelist #14, p.36 ↑ a b c d e MacKay, Jed. (2022). Magic . Iss 19. ↑ Seanan McGuire (2022). Magic: Nahiri the Lithomancer . Wizards of the Coast. ↑ Brady Dommermuth (November 13, 2006). \" The Legends of Time Spiral \". magicthegathering.com . Wizards of the Coast. ↑ Ian Duke (September 8, 2021). \" Teferi, Who Slows the Sunset \". magicthegathering.com . Wizards of the Coast. ↑ Magic Arcana (December 15, 2004). \" Teferi's Appearance \". magicthegathering.com . Wizards of the Coast. ↑ Magic Arcana (November 01, 2006). \" Glimpses of Teferi \". magicthegathering.com . Wizards of the Coast."}