{"text": "Teyo Verada is a human planeswalker shieldmage , or geometrist, from the plane Gobakhan . At his introduction in the storyline, Teyo is an orphan aged 19. He has a slender, Iberian-like appearance with short-cropped black hair. He is more a follower than a leader, and his magic used to be mostly defensive. He contemplated becoming a member of the Gatewatch , but decided against it. Kaya considers him to be naive, but with a hidden strength. His magic shields manifest as geometric shapes of white light. A small circle of light at his ear appears when he creates his circles, triangles, and four points. He has also developed the ability to shoot solid spheres of white light and to use his shields as a battering ram. Teyo Verada is centered in white mana. When he planeswalks, he seems to explode in white translucent spheres, cylinders, and cubes, his body reduced to its elemental geometry. One after another, the shapes rapidly pop away. Teyo was a natural shieldmage, a prodigy, a savant. He could summon up geometry with no lore, chanting, or training. His powers first manifested at four years old, when his parents and his sister were killed in a diamondstorm. Abbot Barrez found him in the wreckage of his village with a shield up. He was crying because he hadn't been able to save anyone but himself. After Barrez took him and tried to train him in orthodox geometry, Teyo became the worst acolyte in the Order of the Shieldmage . Although he sincerely tried to use his protective magic to shield his people against the storms, Abbot Barrez began to despair of him ever raising a decent shield again. Barrez didn't realize that the orthodoxy was stifling Teyo's natural ability. During an exceptionally harsh tempest Teyo's spark ignited , when the Interplanar Beacon called him to Ravnica . Distracted by the Beacon's call, he wound up buried alive in the sand of the Gobakhan's desert but planeswalked away to Ravnica before he would suffocate. Shieldmage. Confused and disoriented, Teyo wandered the streets of Ravnica. A Gateless street urchin named Araithia Shokta (nicknamed Rat) acted as Teyo's guide to the plane, telling him about the city's neighborhoods and districts and ruling guilds. He was soon joined by Kaya and Ral Zarek , who explained to him that he was a planeswalker. Teyo was extremely impressed by Ravnica (which was much larger and more advanced than any city on Gobakhan), but he didn't have much time to adjust to his new reality or enjoy the scenery: Bolas ' invasion began shortly after Teyo's arrival, and the Eternals of the Dreadhorde marched forth from the dragon's Planar Bridge . Like the other planeswalkers who'd been lured to Ravnica by the Beacon, Teyo found himself trapped. Alongside many other planeswalkers and Ravnicans, he fought against Bolas' forces; while he had no combat skills or offensive magic, he used his shields to protect his allies and hinder Eternals. Teyo and Rat accompanied Kaya on her mission to rally the Orzhov Syndicate against Bolas. They were present when Kaya met with the Syndicate's ruling triumvirate, consisting of the human pontiff Armin Morov , the vampire tithe-master Slavomir Zoltan , and the angel warrior-executioner Maladola . She faced resistance from them, but the Syndicate's chief enforcer – the giant Bilagru – convinced them that Bolas posed an existential threat to all of Ravnica and, by extension, to the Syndicate's economic interests. (Unbeknownst to Teyo, Bilagru had been persuaded to help Kaya by the Orzhov representative Tomik Vrona .) Swayed by Bilagru's arguments, the triumvirate agreed to have the Orzhov Syndicate join the fight. During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. At Jace 's recommendation, they decided to split up into teams to focus on specific tasks. Kaya, Teyo, and Araithia were sent to persuade the guilds that remained neutral (Selesnya, Gruul, Golgari, and Rakdos) to join the fight against Bolas. They received an audience with Emmara Tandris , acting guildmaster of the Selesnya Conclave , who initially refused their plea for help. However, her decision was overruled when Trostani awakened and ruled in favor of helping the Gatewatch. The group then went to speak with Borborygmos of the Gruul Clans , and Araithia convinced the cyclops to support their cause. They were joined by Ral , who accompanied them to the Undercity . In Vraska 's absence, the other leaders of the Golgari Swarm squabbled for control of her throne, but Vraska returned and united them. Despite Ral and Kaya's suspicion of the gorgon , Vraska pledged the Golgari to the fight against Bolas. With the help of Ajani and his team of planeswalkers, they were able to evacuate many civilians to the tunnels beneath the city, where they would be safe from the Dreadhorde. After that, Vraska, Ral, Kaya, Teyo and Araithia journeyed to Rix Maadi to negotiate with Rakdos . The demon lord was initially hostile due to the death of his emissary Hekara , and the blood witch Exava ordered the group to leave. However, the Orzhov representative Tomik showed up with Hekara's corpse, and the Rakdos cultists resurrected Hekara as a blood witch. After defeating Exava in a fight, Hekara used her newfound authority as a blood witch to lead the Rakdos against Bolas. Once all ten guilds were on board, Nissa performed a ritual at the ruins of the Guildpact Chamber: with the help of a representative from each guild, she was able to repair the leylines that empowered the Living Guildpact (which had been disrupted when Bolas destroyed the Guildpact Chamber by opening his portal there). Using a device that Niv-Mizzet had constructed before his death to preserve his consciousness, they were able to resurrect Niv and grant the power of the Living Guildpact to him. While all the guildmasters were in a trance, the ritual attracted the attention of the God -Eternal Kefnet . Teyo managed to create a mighty shield to stop the God-Eternal twice, saving just enough time for the ritual to get finished. Niv came back to life just in time to save the others. Using his newfound power, Niv was able to completely incinerate Kefnet in a torrent of flame, although the strain of channeling enough energy to kill a god caused him to fall unconscious. Teyo was one of the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. He survived the battle and was present during the Planewide Celebration that followed. Throughout the War, he developed a crush on Rat and greatly expanded his powers. Kaya was assigned to track and kill Liliana Vess but first wanted to lead Teyo back home to Gobakhan. She even found a way to bring Rat, merging her body and mind to take the thief with her on a planeswalk. Once on Gobakhan, Teyo discovered that his powers now far outshone those of his fellow monks and acolytes and that he had to leave again because they wouldn't be able to do their jobs if they felt inadequate. Having formed a deep connection with both Kaya and Rat, they decided to travel together to Dominaria to find Liliana. This was notwithstanding that Teyo had misgivings about executing Liliana without allowing her to defend her actions. Teyo and his friends were guided to Caligo on Dominaria by Jaya Ballard who soon left after refusing to go further. They found Liliana outside the House of Vess working in a nearby garden and a trance. While Rat went off to learn more about the mansion and its inhabitants, Teyo attempted to remove the gold collar from Liliana's neck which jolted her back to her senses. Liliana fought against Teyo and Kaya but was knocked unconscious by Rat. After Rat relayed what she had discovered, Teyo remembered the incense-like smell from Gobakhan and deduced that Mistress Vess, the fake Liliana, gained her power from a powerful djinn that was bound to the blue sapphire amulet that Rat had described. Liliana regained consciousness and agreed to let Kaya kill her in exchange for defeating her imposter and freeing her people. During the fight, Rat stole the sapphire amulet and destroyed it which released the djinn named Zahid . Seeking vengeance, Zahid attempted to kill Teyo who had been using his shield magic to contain the entity. While Rat retrieved the Spirit-Gem and returned it to Liliana, Kaya tried to kill the djinn but was knocked across the room. Liliana then used the Chain Veil to subdue Zahid and save Teyo. After the conflict, Liliana was allowed to live, although proof of a kill would be needed. Teyo suggested that Liliana give up the Veil, who reluctantly did so with a little help from the Spirit-Gem. Before returning to Ravnica, Kaya, Teyo, and Rat promised to meet Liliana in Paliano on Fiora . Teyo used his shield magic to transport the Veil and delivered it as proof of Liliana's death. The Veil was placed into a puzzle box for safekeeping by Niv-Mizzet. Teyo traveled with Kaya and Rat to Fiora and met with Liliana who had changed her name to Ana Iora . There they began to help their new friend on her path to redemption. After Teyo asked where they would go next, Kaya explained that they would travel to her homeworld of Tolvada . Teyo was known by Kaya to be warding Ravnica with assistance from its many planeswalkers. Teyo wears a circular earring in his right ear which helps him focus his spells. The earring was acquired in Gobakhan . Associated cards: Depicted in:"}