{"text": "Tezzeret (/tɛzɜrɛt/) is a male human planeswalker , born in Tidehollow on the shard of Esper ( Alara ). He was a henchman of Nicol Bolas but despised his master. Tezzeret is a planeswalker who wields blue magic. He is in his 40s, with a lined, weathered face and long hair bound into ragged gray dreadlocks. Under his loose robe, much of his chest is replaced with smooth, flexible metal , and his right arm is a twisted cage of metal struts, ending in fingers like talons. When necessary, he can conceal his etherium enhancements. The fingers can be fired off and return automatically. His eyes glow pink. After his reformation with a darksteel body, he has a sliver of vulnerable etherium on his back, and increased physical strength. His specialty is artifice: spells that forge artifacts , manipulate artifacts and technologies, and bring artifacts to life, creating huge constructs from mere scrap bits of metal. Despite this, the inventor Rashmi judged him incapable of science and invention. While he had often used his magic on himself, his new Darksteel body is resistant to his usual metallurgy. He also is proficient in mental magic and in the manipulation of magnetism. Like all Esperites, he has part of his body \"enhanced\" by the magical alloy etherium , part of an overarching planar venture to create the perfection of both body and mind. He possesses knowledge in Esper mind control magic. Tezzeret has a very explosive temper, with frequent violent outbursts, and an unscrupulous nature. His primal driving force is a lust for power and knowledge, and he is prone to punish people who failed him in severe and often brutal ways if he needs them in the future, or kill them outright if he does not need them. He also greatly resents being controlled and often frames his misgivings as betrayals, despite his own perpetual conniving and subterfuge against those above him. He has a twisted empathy for other orphans such as Estel and Nashi , though he is no less brutal for it. Tezzeret is primarily blue -aligned, but secondary in black mana. When he planeswalks, he vanishes in a buzz saw of blue-silver sparks. From his perspective, he hears a characteristic snap and, before his body was replaced with darksteel, momentary queasiness. At other times, he has been noted to implode into the void in his chest. Young Tezzeret and his father. Tezzeret was born, after the Mending , to scrapper parents, neither of whom cared enough for him to even name the boy. His father was abusive and his mother was a prostitute who had grown too old to ply her trade, and she would remind her husband of this at virtually any opportunity. Despite the hostile environment in which he grew up, he was not at a loss for peers. It was his peers, in fact, that gave him his name, Tezzeret being Tidehollow slang for \"an improvised weapon;\" he received this name after his first act of calculated violence, stabbing an older boy who had bullied him. Tezzeret's life would change when he was approximately seven, the day his mother died. While begging in Lower Vectis , she was run down by a guildmaster's carriage, leaving Tezzeret and his father alone. While cleaning the corpse out of the street, his father imparted the seeds that would alter Tezzeret's worldview forever; the strong ruled and took whatever they could from the weak, and on Esper, there was no force greater than the mages. With this simple declaration, Tezzeret swore he would become a mage someday so that nobody could take anything from him ever again. The next day, he began to help his father salvage metal from the cesspools. It was during this time that he learned of his natural talent in rhabdomancy , which gave him the ability to find metal more easily than his father, who soon stopped doing any work short of selling their finds. It was this lack of diligence on the older man's part that allowed Tezzeret to begin stealing etherium at the age of nine. He would receive a violent thrashing every time he was caught, which was almost always intentional, as it allowed him to get away with stealing even more of the metal while his father believed him pacified. While pursuing his goal of escaping his father, Tezzeret also rose in the ranks of the various Tidehollow gangs. It was here that the effects of his mother's death and his father's worldview became most apparent, as anybody who crossed the boy would find their mothers stabbed to death, proving at least in Tezzeret's mind, that they were weaker than he was. At the age of eleven, Tezzeret had stolen a total of 200 grams of etherium, most of which he had hidden beneath his skin and hair. With this small investment, Tezzeret fled Tidehollow, leaving his father to whatever life the old man could make for himself. Tezzeret apprenticed to an artificer immediately after leaving the cesspools of the Tidehollow. He assumed a new name and swore apprenticeship for seven years, mastering what the artificer had to show him in only three. He fled and began to search for hidden caches of etherium buried about the city, which were surprisingly abundant. These troves, along with whatever etherium he could extract from bandits that he murdered frequently, soon allowed him to join the Mechanists' Guild, spending a third of his fortune for a single year's tuition. He sought to be a master at manipulating magical artifacts as opposed to the more mundane artifice that he had already mastered. What was normally accomplished in seventeen years, Tezzeret accomplished in a mere five. He far outshone his rich and pampered classmates, having developed an appreciation for not wasting any materials. It was this trait that earned him his journeyman status so early, and with that, he gained more access to the etherium he desperately needed. At the age of 19, Tezzeret performed the ritual that severed his right arm and replaced it with a solid etherium arm of over ten kilos worth of the metal, a dream he had fostered for an entire decade since he began to steal from his father. Upon seeing what he had done, the guildmasters immediately elevated him to master status. Tezzeret left and never returned, proceeding straight to the Academy of the Seekers. A youthful Tezzeret during his time with the Seekers. Tezzeret gained entry into the Vectis City Academy wishing to join the Seekers of Carmot ; but, after being defeated in a duel with Silas Renn , his powers were considered substandard and not worthy to join the ranks of the Seekers. His father offered him no support, wishing his son would give up his starry-eyed dreams, but Tezzeret grew more adamant at gaining entrance. He went to the academy later that night seeking to clarify the quality of his performance to the headmaster, Amalet Pannex, but learned he was to be expelled instead, partially owing to his lowly birth. In an effort to cover his expulsion, he murdered Pannex and continued his training unabated. Three years passed, and Tezzeret was still dismissed by his peers. His grisly act had never been discovered, and yet he was still looked down upon. Right after Renn gained a heart supposedly forged of new etherium to prove his membership within the Seekers, Tezzeret had had enough. He broke into the vault to access the Codex Etherium for himself, the sacred tome said to contain Crucius 's teachings. The Codex proved to be a fraud: its pages blank. His trespass was not ignored this time, and the artificer was caught by the guards who brutally beat him and attempted to kill him, accidentally triggering his spark in the act. Tezzeret planeswalked wildly, falling through the Blind Eternities without guidance. Immediately afterward, he awoke to find himself on Grixis not knowing how he got there or why. Miraculously, he managed to survive the hardships and the attacks from Grixian monsters, in spite of his condition, and reached Nicol Bolas , who promised him power in exchange for servitude. In a non-specified future after his ascension, Tezzeret secretly built his own structure of agents inside Bolas' Infinite Consortium. In one fell swoop, he orchestrated the assassination of all high-positioned cell leaders who were directly subordinated only to Bolas, replaced them with his own people, and effectively took over the Consortium leadership. Tezzeret made an alliance with New Phyrexia . He travelled to Kamigawa , where he developed a prototype Reality Chip with help from the Saiba Futurists . After infiltrating the Imperial palace , he attempted to control Kyodai with the prototype. Instead, he accidentally ignited the Emperor of Kamigawa 's spark. Paranoid of spies answering to Bolas, Tezzeret sought out Jace Beleren to join the Consortium on Ravnica. After investing a great deal of time and training in Jace, Tezzeret revealed to him that he had been groomed to be Tezzeret's ace against Nicol Bolas who possessed an enormous grudge due to Tezzeret's betrayal. Tezzeret, however, viewed Bolas as the betrayer as he had learned that Bolas was the secret master of the Seekers that had lied to all of Esper and shunned him so long ago. Tezzeret had acquired Jace because of his unique telepathy and used him to ensure that none of Bolas' agents infiltrated the organization. When Tezzeret and Bolas came into direct conflict over the mineral rights to a specific mountain range on an unknown plane, Tezzeret sought to confront Bolas personally and negotiate the issue. He took Jace along with the hopes that Jace could protect him from Bolas, who Tezzeret feared had telepathic abilities of his own. Tezzeret's plan fell short though, as Bolas swept Jace's defenses aside and plumbed Tezzeret's mind for whatever secrets he could find. Tezzeret was shocked but confident that Bolas would still be unable to harm them. Unfortunately for the duo, Bolas had planned ahead. He betrayed each of them, having hired a troop of barbarian mercenaries to hunt the pair. They escaped with their lives, but just barely. Tezzeret leveled an ultimatum at Jace after this failure, and when Jace willfully failed the next mission, Tezzeret began to dream of Jace's death, seeing him as an enormous waste of Tezzeret's investment. He spent upwards of six months tracking Jace, thirsting for his blood after Jace fled the Consortium. Eventually, Tezzeret and Jace were pitted against each other due to the manipulations of a third party. Jace and his lover, Liliana, invaded Tezzeret's sanctum. Tezzeret captured Jace and allowed his second in command Baltrice to torture Jace while Tezzeret worked on a device that would turn Jace into his puppet. Jace broke free of his prison though and attacked Tezzeret once more. Tezzeret lost this duel against Jace after they planeswalked to Kamigawa , and his mind was utterly obliterated. Further, he lost his etherium arm when Jace amputated it with his manablade , a blade stolen from the artificer in the first place, in order to access the absorbed mana stored in the arm. Nicol Bolas reveals that pitting Jace against Tezzeret had been Liliana Vess' plan all along, and Bolas had agreed in order to regain control of the Consortium that Tezzeret had stolen control of twelve years before. Tezzeret was left braindead in the burned village for the ratfolk to find. The Nezumi kept Tezzeret until the day Nicol Bolas arrived and bargained for his body. Bolas kept Tezzeret, or at least his mangled and mindless body in his keep in the Meditation Plane . When he restructured him, Bolas tattooed his symbol upon Tezzeret's forehead to remind him of his loyalties. Following his restoration, Tezzeret at first stubbornly refused to submit to Bolas again, killing all of his imp minions that wanted to observe the growth of New Phyrexia , report its progress, and prevent leadership from taking hold. Only when Bolas personally arrived to reprimand his servant did Tezzeret obey. After arriving on Mirrodin near Lumengrid , a vedalken servant of Bolas injected him with a serum that made him immune to phyresis . Tezzeret established himself within the Phyrexian hierarchy without the compromise of undergoing compleation. His first encounter was with Jin-Gitaxias , who presented him directly to Karn. He worked his way closer and closer to Karn until he sat at his right hand alongside Geth and Glissa. As Koth and his allies sought to free Karn, Tezzeret moved against the other two, plotting to usurp Karn's throne. This resulted in direct combat with Glissa. The outcome of the fight is unknown. Due to the somewhat contradictory nature of Quest for Karn and the utter and complete lack of the praetors in the book, it is unknown if Tezzeret could have usurped the throne even if he had defeated Glissa. Tezzeret was later present when the praetors assembled to crown another Father - or Mother - of Machines following Karn's liberation. The most likely candidate for it was Elesh Norn , who had taken control over the territories of Sheoldred and Urabask. Tezzeret reported to Bolas that the New Phyrexians had not yet attained interplanar travel, but that they would be a force of chaos and a threat to Bolas' rule should they ever discover the technology. Bolas in turn pledged to obliterate the plane as his first act as god-emperor. Tezzeret, Special Grand Consul of Ghirapur An unknown period of time later, Tezzeret relocated to Kaladesh . Using money supplied to him by an unknown benefactor (likely Bolas) as bribes, he assumed the high-ranking post of Head Judge at the Inventors' Fair of the Consulate . He identified Pia Nalaar as the Renegade Prime of Ghirapur . In his position as Head Judge, he crowned the elven inventor Rashmi as the winner of the Inventor's Fair before facing the captured Pia Nalaar in a quicksmithing match. Using his superior knowledge of artifice and cheating with magic, Tezzeret nearly killed Pia but was attacked by Chandra Nalaar before he could. Tezzeret felt confident he could beat her, but had second thoughts when the Gatewatch was revealed behind her. As the assembled planeswalkers fought against Tezzeret's constructs, he announced the end of the Inventor's Fair and retreated into the Skysovereign, the largest airship of the Consulate. Jace suspected that the whole match had been a ploy, since Tezzeret had protected his mind against telepathic attacks, meaning he had anticipated Jace's presence. Alerted by Saheeli Rai , it was revealed that Tezzeret's troops had used the distraction of the spectacle within the arena to confiscate all inventions displayed at the Fair and took the participants prisoner. Tezzeret then met with Dovin Baan in the Aether Spire, where he entrusted the Vedalken with the task of dealing with the Gatewatch and the growing Renegade threat. He would retreat into an inquirium, studying the teleportation device of Rashmi for himself. In the wake of the ever-growing threat of Renegade attacks, Tezzeret was granted emergency powers and declared Grand Consul, redirecting much of the Aether supply of the whole city to the Aether Spire for his experiments. He supervised the participants of the Inventor's Fair, pushing them beyond their limits and threatened any failure to live up to his expectations with death. Most of his attention was directed at Rashmi, who completed her planar portal and became aware of the Multiverse . After her breakthrough, Tezzeret dismissed her, claiming her invention as his own. When Rashmi tried to lie to him that the device was still malfunctioning, he allowed her to attend to it again under the threat of killing her friend Mitul. Losing his patience with her, Tezzeret forced the elf to attend to the device, not knowing that she would use that moment to allow herself to flee. Tezzeret became Special Grand Consul, endowed by the Consuls for the duration of the Aether Revolt . He relocated to the Skysovereign after he had learned that the Renegades had taken the central Aether hub of the city. He ordered Dovin Baan to find weaknesses in the rebels' defenses. The Vedalken pointed out that the majority of the Renegades, under the Renegade Prime, had taken up residence in the hub and that a direct attack would surely fail. Instead, he advised him to encircle the facility and draw out their commanders, including the planeswalkers, and then strike with aerial support and various armored inspectors. Listing the weaknesses of the Gatewatch, Baan stated that the weakest link of the group was Chandra Nalaar, due to her impulsiveness. Tezzeret then ordered Baral to distract Chandra, exploiting the hatred that existed between the two of them. While tending to the Planar Bridge, he was greeted by Liliana and her Zombies . At first, he believed that Bolas had sent her to check on his progress but then learned that she was part of the Gatewatch. The pair fought, Tezzeret using his metal magic and Liliana her command over death. Tezzeret questioned her allegiance to the Gatewatch and tried to incite her against Jace, telling her that he had made her weak. Liliana, with the Chain Veil , managed to overwhelm him and asked him where Bolas had hidden. In pain, Tezzeret revealed the dragon's location as Amonkhet , the plane where Razaketh , one of the demons she had sold her soul to, dwelled. Before she could finish him off, Chandra and Gideon crashed into the Planar Bridge, apparently destroying it. However, Tezzeret managed to escape with the core of the portal intact. Tezzeret, Master of the Bridge In the buildup to War of the Spark , Vraska , Ral Zarek , Kaya , Lavinia , and the Rakdos emissary Hekara banded together against Bolas on Ravnica. Hekara was killed by a Bolas-possessed Lavinia. She had become possessed after Tezzeret had placed a device on her neck. As Tezzeret had incorporated the Planar Bridge into his body, he could function as the conduit from Amonkhet to Ravnica for the invasion of the Eternal Dreadhorde during the actual War. Dack Fayden , Ob Nixilis , Karn , and Samut managed to travel to Amonkhet through the portal that the Planar Bridge had created to shut off the device that Tezzeret was operating on the other side. They quickly found Tezzeret and attacked him by using a small device created by Saheeli Rai. The portal inside Tezerret's chest exploded, which lead to the larger portal that Eternals were actually walking through to implode and collapse upon itself. After they had succeeded, Tezzeret managed to seal the gaping hole in his chest with a mystic gesture. Then he congratulated them, saying that he hoped that they could beat Bolas because with Bolas out of the way, there would be no one left with the power to thwart him. Before they could react, he planeswalked away. In the aftermath of the War, Niv-Mizzet declared Tezzeret to be one of the three planeswalkers guilty of assisting Bolas, and Ral Zarek was assigned to track him down and kill him. With the damaged Planar Bridge in his chest leaking energy that slowly seared the surrounding flesh, Tezzeret fled to Esper on Alara . There he was informed by a gloating Tibalt , who had witnessed the end, that Bolas was dead. Tibalt had hoped to feed on Tezzeret's pain over his master's death, but he couldn't be happier about it. Bolas had been the only entity in the Multiverse powerful enough to stop his minion. With the dragon gone, there was no one who could stand in his way. Reuniting with his own minions, the gargoyle Brokk and the homunculus Krzntch , he reoccupied his fortress in the clouds, the Seekers' Sanctum . The Wanderer revealed that she feared what Tezzeret might become, now that he had become untethered from Bolas. She considered him extremely dangerous and a possible threat to the Multiverse . Aided by unique abilities she possessed that allowed her to track him, The Wanderer and Ral Zarek eventually found Tezzeret. The pair were attacked by a squadron of etherium gargoyles . Ral and The Wanderer destroyed all of them but the leader, Brokk . They then entered Tezzeret's base and battled against his minions and faced multiple traps. Upon reaching Tezzeret, The Wanderer was knocked unconscious by the lead gargoyle and automatically planeswalked away. Ral found his powers useless as Tezzeret's Planar Bridge technology absorbed and redirected his lightning strikes. Nevertheless, Ral challenged Tezzeret to continue fighting, and in hand-to-hand combat, Ral was badly beaten. Not wanting to be hunted further, Tezzeret showed mercy and gave Ral his damaged etherium arm to provide proof of the kill. Tezzeret returned to Ravnica to meet with Lazav with whom he had formed a secret alliance. Lazav revealed that Ral had unexpectedly told the truth about his defeat which prevented Lazav from blackmailing him. With better news, Lazav went on to discuss his plans to blackmail Vraska and how they could now exploit the new leadership structure of the Orzhov . Lazav also revealed that he had infiltrated the Simic . Five years following his previous visit to the plane, Tezzeret brought Jin-Gitaxias to Kamigawa through the Planar Bridge, to conclude the experiments. After confrontations with Kaito Shizuki , Tamiyo and the Wanderer , he managed to abduct Tamiyo. After he had also saved Jin-Gitaxias, he was complicit to the compleation of Tamiyo. Tezzeret made his way to the metropolis of New Capenna with the praetor Urabrask . While there, he intercepted Vivien Reid , hoping to introduce her to his ally. During their meeting, Tezzeret claimed to be helping progress the agenda of Elesh Norn in exchange for a Darksteel body, available only to the controlling party of Mirrodin. That said, he developed a contingency based off Urabrask spearheading a coup against Norn, that Vivien could gather forces to support. Tezzeret returned to New Phyrexia and oversaw the disassembly of Karn before being asked to take the golem's pieces to Elesh Norn . Angered by the menial labor asked of him, he took a detour to the Panopticon , where he revealed to the still-conscious Karn that he had no interest in New Phyrexia's goals and was only working with them so that they would replace his degrading etherium body with indestructible darksteel . His contingencies included hiring Kaya on Kaldheim and reporting to Jace about Koth and Phyrexia. Dropping Karn off at Norn's sanctum, he finally concluded that his reward was never on the table and vowed to bring Urabrask's war to Norn. Without an immediate plan, he returned to Dominaria and joined Rona 's attack on Urza's Tower , where Teferi and other planeswalkers were hiding. Despite being in prime position to execute a wounded Jodah and Elspeth , Tezzeret merely retrieved a defeated Rona and delivered a warning. Despite his misgivings against Norn, she ultimately held up her bargain, instructing Jin-Gitaxias to forge Tezzeret a darksteel body. Jin did so, but during the operation bound Tezzeret in order to convert the darksteel into blightsteel, revealing his knowledge of Tezzeret's betrayal and Urabrask's uprising. Tezzeret used an Esper mentalist power to control an unfortunate prisoner of Jin-Gitaxias' and enable his escape. Arriving at his home on Esper, he chased away a street gang on Tidehollow before reminiscing in his childhood home, after which Phyrexian forces began their assault on Alara. Still exhausted from the operation, he tasked a street urchin named Estel to deliver a message to Rafiq that the angelic forces may be the strongest defense against the invaders. Tezzeret leapt between Infinite Consortium safehouses on various planes, all of which were under siege, before landing on Kamigawa once more, where Tamiyo 's adopted son Nashi ambushed him in search of his mother. After brutalizing both Nashi and his gang, Tezzeret left the boy with the knowledge of Tamiyo's survival and compleation. He eventually located the forlorn plane that had held his headquarters, settling there to plot his next moves. Tezzeret has the Planar Bridge core fused into his body, acquired before the Bridge's destruction in Kaladesh . It is able to open interplanar portals and transport artifacts and other planeswalkers , but was slowly destroying Tezzeret's body. If not for periodic cauterization in Urabrask 's Kuldotha it would have succeeded before his body was replaced with darksteel. The Reality Chip (given to Jin-Gitaxias ). A manablade A darksteel metal body. Tezzeret the Seeker. Key events in Test of Metal have been contradicted by later stories. Chief among these contradictions are Jace and Liliana believing Tezzeret to be dead prior to the events of Kaladesh, and Jace having not seen Liliana between the events of Agents of Artifice and Catching Up. Parts of the events of Test of Metal have later been explained as a fevered dream of Tezzeret. After an extended period of time after Agents of Artifice , Tezzeret's mind and body were restored, albeit with alterations made by the elder dragon. Tezzeret awoke on Jund, in the Worldheart Chalice , where Bolas had chosen to lair. After casually abusing the restored artificer, Bolas tasked Tezzeret with a mission: Find the sphinx Crucius and the secrets of forging etherium. Transported back to Tidehollow , Tezzeret attempted to acquire some form of currency. He sought out a brewery that had been constructed by the Consortium during his reign. He found his etherium cache but learned that his secrets weren't safe anymore. When Tezzeret reached out for his treasure trove, he triggered the trap that had been set for him. A trio of Magma Scorpions chased him throughout Lower Vectis until at last Tezzeret bartered passage with a Tidehollow Sculler , trading a piece of sangrite for his protection. Safely aboard the boat, Tezzeret knew who had set the trap, the only person who could have done it: Jace Beleren. He knew, as well, what Jace would do next. Tezzeret returned to his father's hovel and fought Jace. The artificer had anticipated this confrontation and used his retrieved etherium to construct a device to incapacitate, and eventually kill Jace. With the telepath under his thumb, he coerced Baltrice , now assisting Jace, into assisting him with his next plan. Killing Nicol Bolas. Of course, that was the goal, but first, they had to return to the Sanctum Arcanum and his old rival Silas Renn. Theirs was not the only arrival of note, as Sharuum , Grand Hegemon of Esper, was also visiting the Sanctum. Tezzeret knew she was the closest being to Crucius before his disappearance. She knew of Tezzeret's quest and promised him her kingdom if she could spend time with Crucius again. Tezzeret agreed to her proposal. She offered him two riddles, given to her by Crucius himself, to help him in his quest. The first led to the Crystal Labyrinth , which was under siege by millions of zombies. This army could only have been orchestrated by Renn, stinging from Tezzeret's treatment at the Sanctum. Tezzeret knew they did not have any hope of defeating Renn because of Silas's ability at clockworking , but he had anticipated even this and hurt Baltrice badly while capturing Tezzeret. With no choice, Tezzeret retreated back to the Worldheart Chalice. Here, he used a piece of sangrite and the multitude of scraps of etherium left in his body from childhood to empower himself. He shaped the etherium into a device that would inject the powdered sangrite directly into his heart, gaining unbelievable powers which he used to teleport directly to the Labyrinth and defeat Renn horribly. Using Renn's body as a machine, Tezzeret tapped into his clockworking abilities to solve the maze. In doing so, he came face to face with Kemuel , The Hidden One, and he stood before The Riddle Gate . Using the gate, he was transported to a pocket plane called the Metal Island . Here, the final parts of his plans came together. Nicol Bolas soon arrived, unaware of Tezzeret's capabilities in this plane, and began to demand answers of the artificer. Baltrice arrived next, along with Jace, followed lastly by Sharuum, stripped of her etherium. As soon as she left, a terrible fight broke out among the assembled walkers, and it ended with Bolas apparently victorious. However, during the fight, his concentration and powers severely waned. This was revealed to have been engineered by Tezzeret, who was the true victor of the fight. He resuscitated Baltrice and Jace, giving Baltrice a sangrite necklace that would undo the mental tampering that Jace had been forced to use to save her. Jace fled under Tezzeret's malicious smile and Tezzeret himself left Bolas trapped on the island. Feeling smug, his victory was snatched away from him. Bolas had predicted all of Tezzeret's actions and sent a mere simulacrum to the island so that Tezzeret would think he had won, causing much of Tezzeret's gloating to fall flat. But in the end, it is revealed that Tezzeret knew about Bolas's secret trap. Tezzeret's plans for ultimate power nearly came to fruition on Ravnica using Isona Maive to amplify magic channeled from countless aether hotspots throughout the multiverse. Just as he tapped the mana sources to cast the Elderspell , Davriel Cane broke the interplanar machine and freed Isona. Isona completely dampened Tezzeret's aether connection just before she was unhooked from the machine, leaving him powerless. Chandra Nalaar , Garruk , Ral Zarek , Kaya , and Vraska broke into the laboratory a moment later and unleashed their full vengeance on him, not realizing the man was stripped of his powers. They left him as a statue in his laboratory. Tezzeret is the primary antagonist in the trailer for Aether Revolt and the secondary antagonist in the trailer for Kamigawa: Neon Dynasty . In the video game Magic: The Gathering Arena , Tezzeret is voiced by Dave B. Mitchell . Associated cards: Depicted in: Quoted or referred to:"}