{"text": "The Bog Entity is a Worldsoul that had hidden itself in The Bog from the Approaches on Innistrad . It resided there for centuries, infusing everything in the area with its power. It seeped into the souls of the villagers and tied them to it. When Prioress Merlinde first came to the Approaches — sent to the region by the Church of Avacyn to teach the people the correct path of faith — she went to the Bog and looked into it using her powers. There, she found the Bog Entity to be terrible, vast, and ancient. Knowing that she could not fight it with conventional prayers or wards, she built the priory of the Nameless Angel , and dedicated everything she had to converting the people of the Approaches. Souls began being converted, and they gave themselves to the Angel instead of the Bog. Because the souls that were part of its being were siphoned off by the Seelenstone , the strength of the Entity in the Bog shrank, until it grew desperate enough to try something new. The Entity pulled the rest of itself out of the Bog and sought a host. By accident, it found the womb of a woman pregnant with two daughters - Willia and Tacenda Verlasen - and ended up split between the twin sisters. As it was not complete, it couldn't communicate with either girl. It tried to affect senses, trying to override their vision as a way to communicate, which resulted in their regular blindness. Events turned into a contest between the Bog Entity and the Nameless Angel when Willia became an acolyte at the Priory, and was assigned to guard the Seelenstone during daytime. It began to speak to Willia and told her of the  power she possessed and that she could use it to stop the darkness. She just had to make it whole, by finding the other pieces scattered through the people of the Approaches. The first pieces Willia reclaimed were the souls of her parents. When she found that they were carrying offerings to the Bog — what she thought was a false god — they fell into an argument. She didn't mean to kill them. But the power from the stone, combined with her own, made it happen and turned them into Whisperers. She returned to the Priory to confess, but lost her faith when she found out that the people of the Priory had murdered the Nameless Angel. She instead began gathering the power of the Bog and, enthralled by its promises, started to pull the souls out of the people of Verlasen. By this time, she was ready to kill her sister to make the Bog Entity whole. The Seelenstone was of no consequence anymore, and she broke it to release its souls for the benefit of the Bog Entity. After this, she was ready to kill her sister. Fleeing from her sister, Tacenda found the body of the Nameless Angel, killed after it had been struck by Emrakul 's madness. Its soul still lingered and it encouraged Tacenda to use a new song. With this warm joyful song, Tacenda defeated the Whisperers and absorbed their souls. With help of Davriel Cane , she also overcame and killed Willia. Willia's body released its part of the Worldsoul, and the Bog Entity was made whole inside Tacenda. Power permeated Tacenda. Perspective slammed into her like the weight of a mountain. She saw... worlds. Hundreds upon hundreds of them. So many people . She knew, instantly, the generations who had lived in the Approaches. Memories of the ages, the essence of all those who had come before. She gasped beneath the weight of it, becoming one person with ten thousand souls. And then...she let some go. The Entity didn't like it, but she was its master. She would not keep the souls of those who could still live. Every person whose body still lived, waiting for the spirit to return. She now was a child of two worlds, two gods, two ideals. As she considered it, something deep within her exploded , awakening at the power. Then — complete for the first time in her life — Tacenda vanished, taking the Bog Entity with her."}