{"text": "The Purifying Fire is the second book in the \" A Planeswalker Novel \" series, this time focusing on Chandra Nalaar . It is written by Laura Resnick . It was published in July 2009. Fresh off an encounter in which the young pyromancer was able to show off some of her more enlightening talents, Chandra Nalaar has earned a place in a loose association of fire mages. But she still has a lot to prove ... Especially to the Order of Heliud , a sect of mages bent on imposing their draconian law across the land. The Order's ever-increasing influence is an affront to all Chandra holds sacred: freedom, individuality, the right to self-determination, and most of all, the right to blow things up. A great pyromancer once said that destruction is best left to professionals, and Chandra is proving to be world-class in the art of boom. Unfortunately, that notoriety is about to cause her a whole lot of trouble ... This book tells the origin story of Chandra Nalaar , a young fire mage with a temper and limited self-control. There is a brief run-in with a blue mage, presumed to be Jace Beleren near the start of the story, then we follow Chandra as she goes to Kephalai to steal a scroll. This ends very badly as she destroys a significant part of a city by accidental overuse of power. While there, she meets Gideon Jura and then flees blindly to the plane of Diraden . Gideon, and Chandra vs. the Order Gideon followed Chandra to Kephalai where he quickly found her, due to her cataclysmic theft of the Dragon Scroll . This theft led to the destruction of the Sanctum of Stars and Gideon tracked Chandra down and attempted to assist her. Unfortunately, he wasn't the only being to have found her and in an attempt to save innocent lives, he incapacitated Chandra. Eventually, he returned the scroll, having kept it in hopes that Chandra would not be executed until it was found, but with her escape, he found no reason to keep it. Gideon once again tracked Chandra, landing on the plane of Diraden in Chandra's footsteps, much to the pyromancer's immense disbelief and fury. He quickly calmed her and suggested that they would accomplish more to escape the plane, which was dominated by black mana and endless night ruled by a Vampire prince if they would work together. Chandra's last remaining ally, a goblin named Jurl , chose that moment to attack them, and Gideon quickly subdued the being. With Jurl as their guide, Gideon and Chandra found their way to a village to speak with their wise woman, the monarch Falia . Falia appeared to be a child, but through the use of Blood Magic, had gained her wisdom from her mother, as well as slowed her aging considerably. Falia was instantly smitten by Gideon's good looks and secretly plotted to separate Chandra from her accomplice. She sent Gideon on a hunting expedition and summoned the Fog Riders to abduct Chandra. Gideon showed up at an opportune moment and slew one of the Fog Riders before they were both incapacitated. While Prince Velrav treated Chandra to his bedchambers, Gideon was handled with more ostentation for his part in the death of the Fog Rider. Gideon was tied to stakes in the courtyard with the understanding that any who should wish it were encouraged to feed on him. When Chandra awoke, she parlayed with Velrav to treat Gideon with more mercy, which resulted in the planeswalker being moved into the dungeons below. Unfortunately, as part of the price paid to have Gideon moved, Chandra had told Velrav of planeswalkers, and Velrav believed he could harness Gideon's essence to become a planeswalker himself. During the ritual that was to attempt this though, Chandra beheaded the prince, and with his death, the spell preventing them from planeswalking was lifted. The pair returned to Regatha and sought the help of Chandra's woodland friend Samir Mia Kaulda . To Chandra's shock, Samir revealed that he had already met Gideon at the headquarters of the Order. Feeling betrayed, she left him to fend for himself and stormed back to Keral Keep. The Order had laid siege to the Keep though, with the simple ultimatum to hand over Chandra. When Chandra surrendered, she only requested that Gideon escort her to Walbert . When the walkers reached Walbert, he revealed that he planned to offer Chandra to the Purifying Fire , hoping she would be cleansed and left powerless as an example to any who would oppose him. Gideon felt immense guilt, not having known of Walbert's intentions, and sought some way to help Chandra escape her fate. Finally, he found passages stating that if a person went into the fire with no regrets, they may survive unharmed. Chandra confessed to Gideon the accidental part she played in the death of her village and how it had haunted her ever since. The Fire spared Chandra and left her intact, and with great relish, she destroyed Walbert and his guards, cracking the foundations of the Fire's cavern and the temple above with the power of her fire magic. Gideon was the first to venture forth into the ruin and found Chandra passed out. He was aghast at what she had done but swore he would cover for her if she left and never returned. Chandra revealed then that the soldiers that had killed her parents had the same ideals as the Order of Heliud, and it was in his best interest to consider his allegiances closely, stating that anyone who exemplified the Order's ideals was to be her enemy, even Gideon. Gideon simply responded that they would meet again, and she vanished from Regatha. On February 27, 2010, the Japanese magazine Dengeki-Maoh published a manga-version of The Purifying Fire , drawn by Yoshino Himori. Laura Resnick (May 19, 2009). \" The Purifying Fire Blurb \". magicthegathering.com . Wizards of the Coast. Laura Resnick (May 19, 2009). \" The Purifying Fire Sample Chapter \". magicthegathering.com . Wizards of the Coast. Laura Resnick (April 18, 2010). \" The Purifying Fire e-Book \". magicthegathering.com . Wizards of the Coast."}