{"text": "The Helvault was a huge rough, angular monolith made of silver rock that existed on Innistrad . It was created by Sorin Markov and functioned as a prison for supernatural creatures. Stories say it and Avacyn first appeared on the same night, and it remains the holiest object on Innistrad after Avacyn herself. A piece of Innistrad's silver moon , the Helvault stood at the precipice inside the courtyard of the Thraben Cathedral , overlooking the lake beyond. Its surface was rough and unrefined, and thin veins of dark mortar branched across its surface. The Lithomancer Nahiri while able to control stone, was not able to influence the Helvault. Edgar Markov created vampirism on Innistrad thanks in part to the prodding of a demon called Shilgengar . Edgar inflicted his curse of vampirism on his grandson Sorin, awakening Sorin's latent planeswalker's spark . Now a planeswalker , Sorin lived and traveled and fed his vampiric thirst for many centuries. But when he returned to Innistrad and saw the threat to life on Innistrad that vampires and other supernatural monsters represented, and realizing that vampires couldn't exist without humans, Sorin took action. He created the archangel Avacyn to safeguard humanity , providing both vampires and humans a way to subsist in the world. The archangel Avacyn and her host of angels took up the sword against those who would harm humanity. They slew vampires with holy fervor, thrashed the werewolf howlpacks that threatened to overwhelm those towns bordering the wilds. They banished malevolent geists and they incinerated unholy ghouls with piercing light. Humanity was able to flourish again and the power balance on the plane tipped in humanity's favor. Avacyn was only half of the protective measures Sorin created to protect Innistrad.  The other half was the Helvault. It came from the plane's silver moon , and it had taken great effort for Sorin to bring it down. Tree of Redemption with The Helvault behind The retreat of the supernatural fiends of the plane opened a space, an opportunity for infernal forces to manifest. Demons and their hosts of impish devils began to make their presence known in far greater numbers. Avacyn engaged each demon in single combat, defeating them one by one. She found that new demons would appear a short time later and decreed: \"What cannot be destroyed must be bound.\" She then forged a collar of silver to bind demonkind, so they could be hauled away and imprisoned. The Silver Collar became Avacyn's symbol and the holy symbol carried by Avacynian priests and cathars. With the proper incantations and rituals, Avacyn and her angelic host could cause wicked creatures to be drawn into the Helvault. She trapped so many demons within the Helvault that only a handful remained. To the relief of all but the demon-worshipping Skirsdag cult , demons and devils were largely out of human life. Incidentally, a certain planeswalker who threatened Sorin was imprisoned in the Helvault as well. It was only a short time ago that the demon Griselbrand , the most powerful of his kind and one who had never become imprisoned, committed an act of unprecedented boldness and heresy: he landed on the Helvault itself, under a full moon, and challenged Avacyn to combat. Avacyn and Griselbrand battled for days, out of view of all but Avacyn's host; the Lunarch Mikaeus and his most trusted bishops. Finally, in an act of desperate effort, Avacyn used all of her remaining strength to drive Griselbrand into the Helvault. As his final act, Griselbrand threw his spear and impaled the archangel's heart. The binding spell backlashed as she was impaled, and Avacyn was drawn into the Helvault herself. Innistrad's most powerful demon was now encased in a great silver mass, as was the archangel Avacyn herself, the keystone of the Church and protector of humankind. The words of her own spell imprisoned her: \"What cannot be destroyed must be bound.\" Avacyn was gone. Mikaeus reeled. Church officials struggled with what to tell the general populace, and whether to keep Avacyn's imprisonment a secret. As the days and weeks went by, practitioners of the faith felt the effects. Rumors abounded that Avacyn had abandoned the world, leading to a crisis of faith across all four provinces. With humanity's safeguard trapped within her own silver vessel, the people of Innistrad are now again left exposed to the creatures of the night. The planeswalker Liliana Vess , who had made a demonic pact with Griselbrand, sought to destroy him, and thus was the cause of the Helvault's destruction. She proposed a threat to Thalia , the Helvault's guardian; either she'd destroy the rock, or have her men slaughtered. With the Helvault destroyed, both Avacyn and the demons were unleashed back into the world. The fragments of the Helvault were collected, and the raw silver ore was distributed among the most distinguished lunar smiths. A family of swords was forged from that metal. Associated cards: Depicted in: Quoted or referred to:"}