{"text": "The Thran Empire (Thr-ann) was an ancient civilization on Dominaria . It spanned large stretches of Terisiare during a period stretching from an unknown point in the past until its decline after -4795 AR . The Thran created powerful artifacts and crafted ornate designs into their creations. The ruins of Thran civilization were a subject of archaeological study in later years, notably by Tocasia , Urza , and Mishra . The Thran came from the east and carved out an empire that covered two-thirds of Terisiare , with colonies all over Dominaria. The full extent of the Thran Empire is unknown. At its height, the Thran Empire was divided into the eight city-states of Halcyon , Nyoron, Seaton, Phoenon, Orleason, Chignon, Losanon, and Wington. Halcyon served as the Empire's capital during its final golden age, though Phoenon was the oldest of the eight. The site of Nyoron was later occupied by Kroog . In modern times, Thran ruins have been found both on Terisiare and Shiv , as well as distant Caliman . The locations of most Thran city-states are unknown. However, the Caves of Koilos , known to the Thran as the Caves of the Damned , are the site above which Halcyon was suspended. Descendants of the Thran still live in places like Shiv and Ru-Nora . The Empire was governed by a council with a tiered voting system. An initial round of voting was decided simply by the volume of \"aye\"s and \"nay\"s shouted by the full assembly. In the absence of a clear majority, a count was gathered from the eldest delegate from each city-state. If that vote was also undecided, the proposal finally passed to the larger leader's council, composed of prominent Thran of varied backgrounds. The founding of the Thran Empire on Terisiare is lost. The Thran migrated in, probably from the east, and their empire covered two-thirds of the continent, though they also had colonies in other places (Like Caliman and Shiv ). It is said their patriarchs all \"founded a city, or took over a city that was already there perhaps.\" The earliest known point in Thran history is the recognition of Halcyon as its capital in -4903 AR, less than 200 years before the city's destruction. Around the time of Halcyon's ascendance, rival factions of artificers and eugenicists emerged. The former, backed by the Thran elite, supported traditional powerstone -based machinery and a magic-centric worldview, especially in healing. Eugenicists promoted a materialist approach to medicine, eventually leading to such innovations as surgery and a germ theory of disease. The backlash against \"degrading\" eugenic theories led to the exile of prominent eugenicists in -4808 AR. Five years later, in -4803 AR, Glacian , the lead artificer of Halcyon, was wounded in a riot and contracted an unknown disease, incurable by traditional Thran medicine. At the behest of Rebbec , Glacian's wife, a reluctant council of elders recalled the lead eugenicist, Yawgmoth , from exile, in the hope that his alternative approach to medicine would prove effective. Yawgmoth ultimately diagnosed the illness as phthisis , a degenerative and purportedly contagious disease induced by powerstone radiation. Word of the diagnosis was met with skepticism by the elite, many of whom appeared to possess an innate resistance to the disease. In particular, Glacian himself refused to trust Yawgmoth. However, phthisis was already widespread among the rest of the population. This was especially true of the lowest class, labeled \"Untouchables,\" who were crowded into a series of caves below the city , and, critically, below the machinery responsible for producing powerstones. Their forced exposure to heavy powerstone radiation helped incite outrage against the ruling class and led to a series of further riots. Throughout the unrest, Yawgmoth expanded his influence through a combination of political maneuvering and genuine Thran artifice. The arrival of the planeswalker Dyfed in -4797 AR set off a series of events that would lead to the downfall of the Thran Empire and the creation of an interplanar threat. Dyfed sought an audience with Glacian, who possessed a latent spark , and who had recognized a theory by which an entire plane could be mapped to the interior of a powerstone. However, he rejected her presence as a charade staged by Yawgmoth, who in turn enlisted her help in locating an unpopulated plane for his designs. Dyfed eventually discovered a wholly artificial plane, covered in mechanical life and composed of nine nested spheres. The creator of the plane had recently died of unknown causes in the innermost sphere, leaving it without a controlling will, and Dyfed proposed that Yawgmoth attempt to assume psychic control of the plane before it succumbed to slow decay. He successfully did so and named the plane Phyrexia . While Dyfed was searching the multiverse, the Thran Alliance formed on Dominaria. The Alliance was comprised of peoples claiming grievances against Yawgmoth, including the city-states of Chignon, Losanon, and Wington. Yawgmoth was accused of masterminding several suspicious plagues which broke out during his exile, and the Alliance threatened war against Halcyon if he was not removed from power. When the ultimatum was presented to the ruling council, it passed through two split votes, with Halcyon's eldest siding with the Alliance, before reaching the leader's council, where Rebbec and Yawgmoth himself narrowly defeated the motion. Immediately thereafter, Yawgmoth overthrew the council entirely and declared martial law. Yawgmoth called upon Dyfed to exile the council to Mercadia , on the pretense of protecting them from the upcoming civil war. Then, with her further assistance, and insights into powerstone physics from an increasingly delusional Glacian, he opened an interplanar portal between Phyrexia and the caves below Halcyon, and offered it to the Thran as a refuge from powerstone radiation. Shortly afterward, he slaughtered the Halcite population for raw parts from which to construct Phyrexian horrors. The Thran Civil War opened on the Thran Alliance capturing Phoenon and Orleason, which had supported Yawgmoth, without great resistance. It ended with the Battle of Megheddon Defile in -4795 AR. The Alliance army was decimated by Yawgmoth's artificial and hybridized Phyrexian troops, the Null Sphere was used to unleash a killing mana cloud across the area, and the portal to Phyrexia was closed in a final defiant act by Rebbec. It is unknown how long the remains of the Thran Empire existed as a cohesive unit past that date. Represented in: Associated cards: Referred to:"}