{"text": "A time stream defines the time continuum of each of the multiverses . A time stream can be imagined as a constantly extending line, with a beginning at the starting point of the multiverse's existence, and a lengthening end-point that represents the current, global time in the multiverse. Each point between the beginning of the line and its end represents one moment of the multiverse's history. Failed experiments by Urza on Tolaria resulted in fast and slow bubbles of time. These can be considered as locally condensed or diluted parts of the time stream. There are infinite time streams, and each represents one reality containing a multiverse . Because their amount is infinite, some of them are exactly the same, others differ only in some details or historical period (their global times may flow with varying speed ), yet others can be completely different. New time streams can appear spontaneously, but can also collapse, mostly as an effect of some cataclysm in the multiverse (usually connected with its Nexus ). Some of the time streams fray, branch, or intermingle. Usually then, time streams are autonomous or affect each other in ways that are not dangerous for their existence. However, in some circumstances their interactions are hazardous. Especially when time rifts come into play, bridging alternate time streams, seemingly those most similar, possibly neighboring ones. Rifts are very dangerous, creating serious temporal stresses and can cause a collapse of a time stream - the end of existence of the multiverse it carries. The Temur shamans of Tarkir speak of the past, the \"now\" (the present), and the \"unwritten now\" (the future). They are seeing the past and the various possible presents all at the same time . In the old timeline, Chianul saw a Tarkir that was dominated by dragons. Arel, in the new timeline, saw a Tarkir where the dragons have fallen and Tarkir is ruled by khans. While apparently the future does not yet exist past a certain point in any given time stream, there does exist an analogue for time travel into the future: phasing . It magically removes an object from the time stream (so from existence) for a specified amount of time. Unphased objects don't feel the flow of time — from their perspective it takes one moment to phase out and back into reality, though thousands of years might have passed. Although extremely rare and dangerous, it is possible to travel backward in time — to the past. For most of history, the only being known to travel backward in time in the multiverse of Dominia was Karn . When Urza started his research of time travel, he found that resulting temporal stresses would kill any creature that has a natural body — even that of a planeswalker . Experimenting with different kinds of materials Urza declared that silver was the most resilient element to withstand temporal stresses. To confirm this, he built Karn whose initial purpose was that of a probe to be sent back in time. Urza's experiments didn't let Karn do very long jumps. Before the explosion of Urza's time machine, Karn could move only one day back. But thousand years later, when Karn became the embodiment of the Legacy , hundreds of souls, minds, and a planeswalker himself, he repeated this achievement on a much larger scale and without any external machines. Using the recollection of his time travelling experience, he succeeded in moving hundreds of years back in time. The second person to travel back through time was Sarkhan Vol . Using Ugin's Nexus on Tarkir , he traveled 1,280 years back to the pivotal fight between Bolas and Ugin . To determine the mechanism to fire the Golgothian Sylex , Teferi used the Temporal Anchor in Urza's Tower that enhanced his time manipulation powers to travel back in time to the Brothers' War . The exact mechanisms of time travel are not known and the results of the act may differ for unknown reasons. What can be said is that after moving back in time, the history is overwritten to some degree by the new version of events, all the way up to the point of the multiverse's \"present.\" Karn's time travel on Tolaria , changed the result of the Phyrexian invasion on that island. However, his next time travel that closed the rift on Tolaria hundreds of years back, didn't seem to have that much of an influence over the events of the material history. According to Doug Beyer, while Sarkhan's actions altered the history of Tarkir , they didn't affect the rest of the Multiverse. But the story did coincide with a soft reboot of the origin stories of some of the planeswalkers and thus could be viewed as having something to do with it. It is not possible to stay in the past, because the time stream presses on the traveler like a current of a strong river. Because the energy costs needed to stay there are enormous and travelers have finite supplies, the time stream will eventually return them to their natural period of departure. It is not known how all paradoxes are resolved. However, it was noted that they do happen and cause temporal energies to accumulate in rifts, threatening to collapse the time stream, or speeding this process up. One clear example of a grandfather paradox happened when Sarkhan's change of the history of Tarkir made it so that he would never be born. The planeswalker survived this. Dubbed since then an orphan of time, he was returned to the time stream's present moment. According to Tezzeret in the canonically contested novel Test of Metal , mages known as clockworkers treat time as a spatial dimension; they can easily jump back and forwards in time like other mages teleport room to room. Such a person is also powerful enough to control the personal temporal flow of people, slowing or speeding up time (making you die by growing old really fast). Tezzeret illustrated the concept of moving sideways in time. Comparing time to a braided rope he explained that every time you make a choice you split off a new temporal strand, some of which will return to the mainline and some of which will go to different ones (basically infinite alternate timelines - although only the more \"local\" ones close to your main thread are accessible to you). A master clockworker can choose whichever timeline they like, basically selecting the outcome of any encounter. The only limits to clockworking are the power of the adept and rules of probability - the more improbable an event is, the more power it requires to know about and access the alternate timeline where that event occurs. Upon observing the clockworkers in action, Nicol Bolas claimed to be capable of this kind of magic. The events events of Test of Metal and clockworking have later been explained as a fevered dream of Tezzeret. ↑ It is known, however, that planes can sometimes leave the multiverse: \"Planeswalkers have been known to disappear entirely if the universe they currently inhabit relocates radically, or shifts free of Dominia itself.\" — \"Dominia and Its Walkers\" by Richard Garfield . It is not known what happens with such planes though. Do they cease to exist, or maybe there is some outer space of multiverse, still contained within the time stream? Another possibility is that when they leave the multiverse, they keep their own part of the time stream creating a new, independent one. It isn't known if such a plane can return to the multiverse either. ↑ Time Streams novel ↑ according to Karn in Planar Chaos novel ↑ For example, what would happen if Karn traveled back in time and stopped Urza from building him. ↑ According to Teferi in Future Sight"}