{"text": "Toshiro Umezawa (TOH-shee-roh oo-meh-ZAH-wah; Japanese: 梅 澤 俊 郎 ; rōmaji : Umezawa Toshirō ; known as Toshi for short) was a ronin samurai, kanji magician and con artist from Kamigawa who lived during the Kami War . Whilst he was mainly interested in self-preservation, he became embroiled in the war's events and ultimately played a key role in ending it. His family name disgraced after his grandfather's death at Shizo, Toshiro learned to live by his wits, squatting in a decrepit manor near Numai, the city in the Takenuma swamp. Over the course of many years, he picked up many useful survival skills: swordsmanship, thievery, stealth, and kanji magic: the nearly forgotten art of crafting spells through the drawing of kanji, often with his trusty jitte. Toshi became a member of Boss Uramon 's hitmen. As such, he was a part of a party that had been sent to attack the ogre shaman Hidetsugu . The ogre killed all the others, but the kanji mage managed to convince him to form an allegiance that became known as the Hyozan Reckoners , which protected both of them from attacks and enabled Toshi to become independent. Some years later, Toshi accidentally interrupted a parley between Marrow-Gnawer and two soratami in Numai. The moonfolk tried to kill him, but he defeated them with the help of his kanji magic. When he came home, another party of soratami led by Chiyo was waiting for him, forcing him to seek Hidetsugu's aid. Hidetsugu suggested that Toshi go to Jukai and ask the forest monks for advice. He provided Toshi with a companion - his apprentice Kobo , a former budoka. After performing a ritual to make Kobo the newest member of the hyozan, Kobo and Toshi set off to Jukai. They crossed Sokenzan on their way, and successfully defeated the minions of the Myojin of Infinite Rage . Shortly after they entered Jukai, Toshi and Kobo met Princess Michiko Konda and her party. However, the party was soon captured by orochi . When Toshi awoke, he found Kobo hung between two trees, his lungs filled with water, a victim of the Minamo agent Choryu . Toshi rescued Michiko and with the help of a moth that was indebted to him moved into one of Toshi's secret hiding places, a cave in Jukai. Hiding in the cave, Toshi and Michiko were confronted by Mochi , the Smiling Kami of Crescent Moon. Mochi showed Michiko the night of her birth, explaining Konda 's crime and the reason why the Kami War erupted. He then introduced Toshi to the Myojin of Night's Reach , Kamigawa 's patron kami of darkness and secrets. Beset by Michiko's friends and with the orochi quickly approaching, Toshi decided to accept the blessings of Night, but on different terms than Mochi intended. The Myojin of Life's Web manifested nearby and demanded Michiko. Toshi was able to defeat Life's Web using his kanji magic that had been greatly enhanced by Night's Reach. Toshi then marked Kobo 's murderer Choryu with a kanji that lifted him up and then sent him directly into Hidetsugu's home, enabling the ogre to have his revenge. He then faded into shadows and escaped the enraged remainder of the group. Toshi returned to Numai, where Kiku found him in a pub and brought him to Uramon. Toshi was able to escape Uramon's judgment, to both Uramon and Kiku's anger. A group of assassins led by Kiku and Marrow-Gnawer pursued Toshi into a region of Sokenzan called the Heart of Frost . After the powerful yuki-onna spirit killed all the men except Kiku and Marrow-Gnawer, both of the pursuers were forced to join the hyozan reckoners. The yuki-onna was then imprisoned inside a tile. The hyozan trio then returned to Hidetsugu to plan their next move. The ogre informed them that he was planning to take revenge on Minamo , the soratami, and its patrons, with the help of eight yamabushi that he had enslaved. In the end, the ogre let himself be persuaded to forestall his vengeance in exchange for the tile with the imprisoned yuki-onna. Toshi, Kiku, and Marrow-Gnawer left for Numai, but Toshi soon received a messenger kanji from Michiko, asking for his help. Kiku and Marrow-Gnawer brought Toshi to Uramon in tethers, faking his capture. When Uramon ordered Toshi's death, both of the new hyozan turned on their former lord. Toshi was able to steal Uramon's most valued artifact - the Shadow Gate , a gift from the Myojin of Night's Reach that allowed the owner to travel from any shadow in the world to any other. He used it and appeared in the Honden of Night's Reach. The myojin then rewarded him for his achievements by uniting the Shadow Gate with his body, allowing him to travel almost anywhere on Kamigawa. Toshi appeared in Michiko's room, promised to help her, and demanded payment. Toshi then shadow-walked to Hidetsugu's cave and ended Choryu's suffering. He then went to the outskirts of Jukai and found lady Pearl-Ear , promising to bring Michiko to her if she promised that they would not head for Minamo. Pearl-Ear agreed and so Toshi brought Michiko to Jukai. Toshi later visited Otawara , the moonfolk city above the academy. He fought and defeated Chiyo, then released Hidetsugu's oni-dog from the tile to destroy much of Otawara. After arriving in Minamo, Toshi discovered Michiko had not followed his advice and that Hidetsugu and his revenge force had arrived. Toshi narrowly escaped Mochi and left the party there to set off on an even more important task. Toshi appeared in Konda 's throne room and took the daimyo's stone trophy. He used the shadow-walk to get it away, but his trip ended in the Honden of Night's Reach. The myojin informed Toshi about the nature of the disk and said that she did not want it passing through her realm. Toshi arrived back in Minamo, left the Taken One near the still-frozen Mochi, and transported the core of Michiko's party out of the danger of Hidetsugu, his hunters, and the freshly-manifested All-Consuming Oni of Chaos , who had answered Hidetsugu's call. With the Myojin of Night's Reach's help, Toshi was able to escape the bonds of the hyozan oath. Toshi returned to Minamo and spoke with Hidetsugu. Hidetsugu was displeased that Toshi's allegiance was shifting more to Night's Reach than the hyozan. After Hidetsugu revealed his plans for the destruction of Otawara, Toshi escaped and returned to Numai. Toshi raced to Numai to collect Kiku and Marrow-Gnawer. In the middle of a mahotsukai/soratami slaughter, he found Kiku, who had been used by the mahotsukai masters as their ultimate weapon. Her powers had been greatly amplified, however, the curse of the elders was also driving her insane. Toshi removed the curse, leading to a night of strange passion between the two. In the morning, Kiku was furious but resolved to aid Toshi in exchange for release from the hyozan oath. After recruiting Marrow-Gnawer and stealing a rider-moth, the three flew to Minamo. Toshi banished the jaws of the All-Consuming attacking Nagao and his men and then ferried the men to safety. When he returned, he was attacked by the very oni dog that Hidetsugu had sent after him. With Kiku's help, the demon was killed, but both of them were then struck down by a pair of yamabushi. Hidetsugu grabbed Kiku and Toshi and slowly choked them, sparing himself the hyozan oath's wrath by not spilling any of his fellow reckoners' blood. Marrow-Gnawer managed to stab the ogre's eye, freeing Toshi and Kiku but invoking the wrath of the oath upon himself. Invoking her heightened powers, Kiku battled the ogre. Hidetsugu prevailed in the end, but Toshi used his victory gesture to stab him through the remaining eye from a shadow cast by Kiku's body. Fortunately for Toshi, the All-Consuming and O-Kagachi clashed with each other at that very moment. The utter defeat of his patron changed Hidetsugu. Toshi then transported Kiku away to Numai before transporting a willing Hidetsugu into the honden of the All-Consuming. The ronin was, however, unable to save Marrow-Gnawer from the curse and so ended the nezumi's suffering with an axe. Under the cover of darkness, Toshi fled to Jukai. While resting, he had a strange vision where a disembodied voice spoke to him and then brought other people to talk to him - Uramon, Godo , Choryu, and Marrow-Gnawer, who all blamed him for their suffering. When he awoke, he was captured by orochi and brought in front of Sosuke . During a soratami attack, Toshi was brought to witness the battle, in which Sachi and Jugan participated. Later, another vision told him that the yuki-onna was close to killing everything in Godo's part of Sokenzan and that he must revert to what he had caused. Toshi arrived in the Heart of Frost and began to destroy the kanji that bound the yuki-onna. The Myojin of Night's Reach intervened and cleared his mind and thoughts. Toshi proceeded anyway, calling the yuki-onna back from Sokenzan, but paralyzing her temporarily and not yet giving up her power. Toshi then released the yuki-onna and returned to Jukai. As O-Kagachi manifested and Toshi became beset from all sides, the ronin had no other option but to escape through the shadows with the disk, directly violating the myojin's wish. Night's Reach was infuriated until the disk punctured her mask with a bolt of energy. She fled and Toshi was spat out of the shadows bereft of the myojin's blessings and even his kanji abilities. Toshi explained to Michiko the relationship between her and the disk and tried to persuade her to touch it. Pearl-Ear refused, but with O-Kagachi manifesting fully directly above the forest, there was no other choice. Michiko touched the disk, where Toshi inscribed the words \"sisters\" and \"united\" with his blood. That Which Was Taken shattered, releasing the trapped spirit - her \"sister\", who was given the name Kyodai . Michiko and Kyodai then merged into a new combined entity, the Sisters of Flesh and Spirit . Together, they destroyed O-Kagachi and took his place. When Konda arrived, Kyodai confronted him and punished him for his crime by turning him into stone and shattering him, but with Konda still being alive and perceiving. Kyodai opened a gate to the realm of the All-Consuming, and from it emerged Hidetsugu, who had merged with the oni in much the same way. Mochi was torn apart and eaten by the oni's jaws. After departing the scene and walking for some miles, Toshi was ambushed by the vengeful Chiyo . Toshi was stabbed through the chest in the ensuing conflict. Night's Reach, however, chose that very moment to forgive Toshi and offered her help. Once more, Toshi swore his allegiance to her and so Chiyo was destroyed. Toshi was then transported to another plane, wherein the Myojin informed him that she had \"planted\" him in a new world, one she found during O-Kagachi's preoccupation with the Kami War. As a parting gift, the myojin took his sight, leaving him blind. The location where Toshi had been left was the coast near the Talon Gates at Madara , Dominaria . Toshi departed to the inland, where he smelled the scent of swamps. He became the first of Clan Umezawa , from which Tetsuo Umezawa would arise. Toshiro was transported across the planes by the Myojin of Night's Reach. Kamigawa Dominaria Associated cards: Depicted in: Quoted or referred to:"}