{"text": "Tymolin Loneglade was a woman from Sarpadia , Dominaria . She was the sister of Tev Loneglade . Tymolin grew up with her brother on the coast of Sarpadia. As the older sibling, she acted as both sister and guardian of Tev. As Tev grew up he somehow gained a planeswalker 's spark and enchanted Tymolin with eternal youth. In time she would learn to view her youth more like a curse, expressing her wish to die to him. Not much is known of their early life, but the siblings did travel to both Terisiare and Argoth together with disastrous results. Returning to Sarpadia, Tymolin lived her own life while Tev grew reclusive residing alone in Havenwood lamenting the mistakes of his past. During this time Tymolin became entwined with two lovers — Kaylen the Dwarf and the Icatian Priest Oliver Farrel . In the end, she chose Kaylen and lived amongst the dwarves in the Crimson Peaks . This decision would hold bitter with Farrel who had noticed her eternal youth. Although Tymolin and Tev were separated during this time she would continue to serve as his last link to humanity. In 170 AR, a large Orc - Goblin army besieged the Dwarven kingdom. The army swept through and destroyed much of the Dwarven empire. Kaylen and Tymolin, both capable fighters, defended their kingdom fighting tirelessly against the chaotic forces. Kaylen would fall in battle to an Orc resulting in Tymolin being banished from the crumbling Dwarven empire. She would seek out her brother to the south in Havenwood, not knowing that from Montford , Oliver and the Farrelites had started to hunt for her proclaiming her to be the living incarnation of Tourach . Tymolin, ever noble, struggled to convince her brother to aide Montford and Icatia against the encroaching Goblin-Orc army, yet he would remain steadfast in his neutrality. While traveling near the Icatian -Havenwood border, Tymolin and Tev were ambushed by the Farrelites in a powerful magical battle. Tev defended Tymolin tirelessly while she struck countless blows against her foes. Eventually Tev cast Darkness to cover their escape. However, the siblings became separated in the confusion and Tymolin was waylaid by Vaylesh and the Order of the Ebon Hand . Tymolin, now alone, slew two of the Order but eventually was incapacitated with a sleeping potion. Vaylesh, using Tymolin as bait, seemingly knowing of her and Oliver's tryst, would lure the Farrelites to their encampment as a trap. However, Vaylesh misunderstood Farrel and Tymolin's relationship and allowed Oliver to speak alone to the captive Loneglade. Tymolin, refusing Oliver's offer to once again be his lover and replace Sianna as his champion, was stabbed to death by Farrel. With Tymolin dead, Tev's last tie to humanity was broken and he transformed into Tevesh Szat . Flying down in his new dragon -like form, Tevesh avenged Tymolin by slaying all present with a powerful Fireball ."}