{"text": "Ugin (/uːɡɪn/ OO-gin ) is an elder dragon planeswalker from Dominaria . Ugin is a dragon of great stature, with feathered wings and scales of coruscating blue. He is the twin brother of Nicol Bolas , and sibling to Arcades Sabboth , Chromium Rhuell , Merrevia Sal and Palladia-Mors . Unlike his twin brother, Ugin is uninterested in power for its own sake, preferring instead the pursuit of knowledge in the hope of understanding the nature of the multiverse. Ugin's unparalleled knowledge allowed him to transcend the colors of mana, and he is now centered in colorless mana, although he retains the ability to use all 5 colors. Before this, it is implied he had access to at least red and blue. Like his twin brother, Ugin is one of the most powerful planeswalkers in existence. His capabilities range from the transmutation of energy into matter to the manipulation of time and fate, and on several occasions, he has proven able to return from death. Ugin generally uses his powers to create rather than destroy, but if threatened he is capable of unleashing ghostfire , an invisible flame that can incinerate virtually anything in the multiverse. Ugin is most associated with the plane of Tarkir , where his elemental storms birthed the dragons who now rule the lands. But his story begins on the plane of Dominaria , where he was born. Ugin was spawned from The Ur-Dragon alongside his twin, Nicol . Where in every other egg there was only one, they woke together, they named themselves together, and touched the soil of Dominaria at the same instant. They were both only half the size of their siblings. When they witnessed their sister Merrevia Sal 's being attacked by non-specific humanoids and dogs ; Nicol tried to rescue and then avenge her, while Ugin was far more pressed to find their other siblings and seek more knowledge. Upon climbing a mountain , Ugin expressed wonder at the multiverse , while Nicol sought to become strong to not die like their fallen sister. After Palladia-Mors mocked their size and their hunting techniques, the twins spent years perfecting various techniques for hunting in tandem. For the next few years, they lived with Arcades Sabboth, who had taken up residence as dragonlord in a human settlement. Here Nicol learned about the nature of humans, and how easily they could be manipulated to further his own goals. Meanwhile, Ugin made particular friends with an old holy elder named Te Ju Ki , whose sole purpose in life, it seemed, was to think about things that could not be seen. He soaked up the calm wisdom she exuded and learned about the existence of other planes . After several years, Bolas had learned enough and took Ugin to seek revenge for their sister's murder. On their way to the birth mountain, Ugin was wounded and poisoned by humans that had evolved into dragon hunters. After recovering, Ugin witnessed Bolas manipulating the dragon hunters into a quarrel between several factions and taking over as supreme leader. After Bolas tried to use his brother to aid in his endeavors, Ugin realized that Bolas had never truly cared for him at all. This mental shock caused his planeswalker's spark to ignite and he planeswalked to the Meditation Plane . While the rest of the Elder Dragons clashed in the Elder Dragon War , Ugin instead explored the Multiverse, marveling at its grandeur. When he, at last, chose to return home, he found the world embroiled in war, with Arcades Sabboth and Nicol Bolas sending their armies of dragons and humans against each other. Seeking to convince them to stop fighting, Ugin revealed himself. Nicol, who had believed that his twin had been killed by the humans after he had taken control of him, distrusted him at first but was convinced that he was the real Ugin. When Nicol proudly displayed his empire before him, asking his brother to join him in being emperor of all. Ugin retorted that all that Nicol had achieved was a minor speck in an infinity of worlds and nothing to be proud of, revealing that he had found a way to travel between worlds. Nicol angrily asked Ugin to show him how to planeswalk, and when he could not, suspected that he had been in hiding somewhere on Dominaria and plotted against him. The brothers exchanged bitter words before Ugin left Dominaria again, cementing the rift that had grown between them. Many, many times and adventures later, the two planeswalking brothers confronted each other on the Meditation Plane . First above the wide waters of the Meditation Realm and then on a wild pummeling path through the planes, they struggled for days, years, generations. Knowing that he could not match Bolas' savage hatred, Ugin returned to the Meditation Realm and allowed his brother to fatally wound him. As his body fell into the pools of the Meditation Realm, the ripples created an expulsion of power that fractured the very plane and cast Bolas back into the Blind Eternities. An unknown amount of time later, Ugin awakened, his spirit inhabiting a new body formed from the Meditation Realm's waters. The newly reborn Spirit Dragon had found his purpose - to protect the multiverse from threats like Bolas, whose hatred would destroy entire planes if left unchecked. Transmutation powers. Ugin eventually made his home on the plane of Tarkir, where his magic was responsible for the creation of the plane's dragons. Valuing both the dragon broods and the humanoid Clans , he gifted the Clans with concealment magic so they could evade the depredations of the dragons. He also revealed the secret of Ghostfire to the Jeskai Way , and the art of the Whisper Mind to the Temur Frontier . By sharing his secrets among the clans, no one clan would have more power than the others. In the Eye of Ugin Ugin was the mastermind of the trio of planeswalkers , including Sorin Markov and Nahiri , that lured the Eldrazi to Zendikar to imprison them within the Eye of Ugin . over 40 years, the planeswalkers prepared Ugin's plans, creating a massive network of stones known as hedrons , powered by leylines and coded by draconic runes. When the Eldrazi finally arrived on Zendikar, Ugin's part was to combat the Eldrazi with his colorless magic, the magical key to unlocking the Eye. Thousands of years after the Eldrazi were sealed, Ugin and fellow planeswalker Azor devised a plan to trap Bolas on Ixalan . Before it could come to that, Bolas tracked his twin to Tarkir. The two planeswalkers waged a titanic battle, leaving Ugin nearly dead. Bolas dug deep into Ugin's mind for information about the Eldrazi and their prison. His purpose accomplished, Bolas departed, leaving the grievously wounded Ugin to die. In the original timeline, although physically dead, the dragon's spirit had not departed and found its way into the mind of the planeswalker Sarkhan Vol . Sarkhan was plagued by Ugin's whispers in his head, 1,280 years after the dragon's death. Sarkhan later discovered that the whispers were Ugin's psychic plea across time and space for help. Ugin, the Spirit Dragon Sarkhan Vol was drawn back to his home plane of Tarkir by the whisperings of Ugin's spirit in his head. While there, he was able to travel back in time 1,280 years using Ugin's Nexus , a spiritual nexus surrounding Ugin's bones. The nexus transported Sarkhan back in time, just before the battle between Ugin and Nicol Bolas. Using a shard of a hedron containing Ugin's life force, Sarkhan created the Crucible of the Spirit Dragon to save Ugin and thereby alter the fate of the entire plane. Sarkhan was transported back to the future, and the timeline of Tarkir was forever changed. Because his essence was contained within the hedrons, Ugin became the soul of Tarkir. Shamans could communicate with the part of him that was rooted in Tarkir, even if he was supposedly dead. 1,280 years after Sarkhan Vol saved Ugin, the spirit dragon still rested in his cocoon of hedrons. During that time, Tarkir's history changed and Ugin's dragons had now become the dominant species on the plane. Sorin Markov arrived on Tarkir and with the help of an enthralled Atarka warrior made his way to Ugin's resting place. There, Sorin awakened and freed the spirit dragon from his slumber. Ugin explained about his battle with Nicol Bolas to Sorin who then informed him about the awakening of the Eldrazi. A shocked Ugin inquired about Nahiri stating that they would need her help to fight the Eldrazi again by rebuilding the hedron network. Ugin soon realized that Sorin was purposely hiding the information about Nahiri's fate and was annoyed. He warned Sorin to put aside whatever spat the vampire and Nahiri had and to find her. He then thanked Sorin for his assistance with a warning that they will meet again on Zendikar, and Nahiri had better be with the vampire. Later, Ugin met Sarkhan Vol who had arrived searching for answers. The spirit dragon had been studying Tarkir's new history in the various carvings around the canyon. He eventually questioned Sarkhan on his actions and how a hedron from the Eye of Ugin arrived on Tarkir. Sarkhan informed Ugin of the events in the past few years, deducing his actions in the past. As Ugin had no memory of the alternate timeline and the role his spiritual echo had played in it, he theorized that Sarkhan had now created a time paradox of sorts. The Dragon Man had appeared from nowhere and had saved Ugin the Spirit Dragon before disappearing to reappear a thousand years later. Understanding this, Sarkhan made his peace with Ugin and left. Ugin warns Jace that the Eldrazi Titans should not be destroyed, for the sake of the Multiverse Having been freed from stasis on Tarkir, Ugin returned to Zendikar. With Sorin Markov and Nahiri missing, he started to rebuild the Eye of Ugin and the hedron network. When Jace Beleren arrived to investigate, the Spirit Dragon revealed how the network might be used to again immobilize the Eldrazi titans, but Jace suspected that the same trick might instead serve as a first step in killing them. Ignoring Ugin's dire warnings, Jace left the Eye and made his way back to Sea Gate to pass this information on to Gideon . After the newly formed Gatewatch destroyed Ulamog and Kozilek , Ugin berated them for killing the ancient creatures instead of trapping them, fearing dire consequences for the multiverse . Seeking to end the threat posed by his brother once and for all, Ugin conspired with Sarkhan to take down Bolas. Sarkhan helped Ugin bypass the wards that Bolas used to protect the Meditation Realm , which enabled Ugin to quickly take back control of the plane. This also allowed Ugin to see through the Spirit-Gem between Bolas' horns, giving him one way to effortlessly spy on his brother without any chance of being noticed. (This was because the Spirit-Gem was metaphysically tied to both Ugin himself and the Meditation Realm, as Bolas had taken it from Ugin's essence after killing him there.) Upon learning that Bolas would be going to Ravnica to complete the Elderspell , Ugin allied with the Ravnican dragon Niv-Mizzet . Together, they came up with a contingency plan to resurrect Niv in the event of his death: Niv preserved his consciousness in an advanced device that could house his mind and his soul for a century. When Bolas killed Niv (as expected), Ugin sent Sarkhan to retrieve the device and bring it to the Meditation Realm, where he could keep it safe until Ravnica 's leaders performed the ritual to bring Niv back to life. After that, Ugin sent Sarkhan to Amonkhet to retrieve the spear of the god Hazoret . As an object created by Bolas and infused with his energy, Hazoret's spear was one of the few weapons capable of harming the elder dragon. As Ugin had planned, the spear wound up in the hands of the newly-resurrected Niv-Mizzet. Niv used it to stab Bolas in the back, impaling him. This enabled the God -Eternal Bontu to deliver the fatal blow, biting Bolas and harvesting all the sparks he'd consumed as well as his innate spark. After Bolas' defeat, Ugin took his brother's body to the Meditation Realm to prevent him from coming back to life on Ravnica. To prevent anyone from following him, Ugin had Jace use an illusion to conceal his presence from everyone, making them believe that Bolas' corpse had disintegrated instead. Ugin spied on Nicol Bolas 's plans through Spirit-Gem. Ugin wrapped Bolas in his wings while traveling through the Blind Eternities . Despite this protection, and even though Bolas was an elder dragon and a former planeswalker, the journey to the Meditation Realm ended up causing even more damage to Bolas' body, stripping the scales off his hide. Nonetheless, Bolas still came back, although it took him weeks to regain consciousness and months to start recovering. Upon awakening, Bolas found himself completely powerless, unable to planeswalk, or even use the simplest spells. Furthermore, Ugin had stripped away his two names, preventing anyone from summoning him. To add insult to injury, Ugin explained precisely how he had managed to outmaneuver his brother, revealing how he worked with Sarkhan and Niv-Mizzet to orchestrate Bolas' defeat. Ugin then expanded himself throughout the plane, revealing that he'd merged his essence with the Meditation Realm. He'd also sealed the plane off from the rest of the multiverse, preventing anyone (including himself) from entering or leaving again. Ugin told Bolas that he will keep watch over him, ensuring that he cannot bring any more harm to the multiverse, until Bolas' natural death in thousands of years. After the War of the Spark, but before Bolas awoke on the Meditation Realm, Ugin communicated through the Spirit-Gem with Araithia Shokta and Liliana Vess in Caligo on Dominaria . Ugin explained that the Gem could reveal its possessor's “true, best self.” While Araithia held the Gem, she became visible to everyone. For Liliana, Ugin appeared to her and explained that she would have to choose her path to redemption. Later, when Liliana held the Spirit-Gem in one hand and the Chain Veil in the other, the Spirit-Gem began to glow. As it disappeared, Liliana dropped the Veil and gave it up. The Gem's location is officially unknown, although it presumably returned to Ugin. The Breath of Ugin , also known as the Ghostfire , is an invisible colorless flame. It was used by Ugin against the Eldrazi . Along with the presence of three planeswalkers, it is the key to activating the Eye of Ugin . The Future Sight colorless burn spell Ghostfire , and its flavor text , were the inspiration for the backstory of the Eye of Ugin. Matt Cavotta wrote a short story entitled \"How Many Eyes?\" inspired by Ghostfire , in which Ugin emerges from a time rift , implying this character's alternate reality origin. It is doubtful this story has any real bearing upon Ugin's true appearance as this was written sometime before the Eldrazi plotline had been created. Doug Beyer stated that he believed the fact that Ugin transcended color in his magic is the reason why he became a \"spirit\" dragon. There had been much speculation about whether Ugin was an Elder Dragon , but Creative had not decided against it at that time. Later, Bolas Twins confirmed that he was born an elder dragon; whether he retains that status or not is currently ambiguous. His \"spirit\" persona was revealed to be an aspect of his rebirth on the Meditation Plane. Until Ugin's origin was revised in the Chronicle of Bolas, Ugin was considered to be from Tarkir by Magic creative. Associated cards: Depicted in: Quoted or referred to:"}