{"text": "Ulamog , the \"Infinite Gyre\" is one of the three Eldrazi titans and the monstrosity whose half-forgotten name came to be known as the Zendikari merfolk sea god Ula . Ulamog is the smallest and weakest of the three Eldrazi titans. His head resembles a bony helmet but lacks eyes or expression. Most of his body has the color of exposed muscle and is covered with bony plates. He moves via a writhing mass of tentacles studded with bony spikes below the torso. His two arms split at the elbow and lead to four hands. A stench of rotting meat, decay, and sulfur surrounds him constantly, earning him the name \"The Reeking Titan\". Ulamog is the Titan of Consumption, as he and his brood consume living and unliving matter alike. In doing so, they drain mana and vital energy from everything in the vicinity. His processors transform the consumed energy into spell -like effects that defy the understanding of Zendikari mages , creating plagues, deadly parasites, and endless teeming spawn. The processors leave distinctive white, chalky lattice-like structures in their wake. Everything, including water, is transformed into a white manaless husk of what it once was. Ulamog is emblematic of plague, the blind bonds between parasite and host, and overabundance; he is creation and destruction wrapped together in unholy harmony. The Ulamog brood lineage is mostly characterized by dense masses of fleshy tentacles, multiple withered arms split at the elbow, and eyeless, bony plates in inhuman yet vaguely facial forms. Ulamog's spawn grow quickly from tiny larvae to about the size of a wolf. Some have spiderlike legs and some have tentacles. Ulamog's drones can grow up to ten feet long. They fill specialized roles like Broodkeeper (birthing and tending spawn) and Hunger (draining the land). The ravenous and brutish Eldrazi of the Ulamog lineage lurch and shudder over the ground, adept at spreading disease and draining from the psyches as well as the life energy of their victims. Zhulodok , Void Gorger is the only known Ulamog Brood Eldrazi to receive a proper name. Ulamog's Destructive Abilities After their imprisonment by Ugin , Sorin Markov and Nahiri , Ulamog and the other two titans ( Kozilek and Emrakul ) were locked away from the planes. Destruction caused by Ulamog on the continent of Bala Ged A few thousand years after the imprisonment of the Eldrazi by The Three , the noxious creative force of Ulamog became an infection that took hold of the people who dared to live in Akoum 's mountains despite the tectonic instability of the region. They became a sort of cult devoted to an imagined deity of the mountains, established a temple near the site of the prison, and began performing rituals inspired by their growing madness. The cultists avoided the notice of the increasingly reclusive Nahiri and over time and multiple generations, their rituals actually proved effective in loosening the bonds of the Eldrazi prison. Though the titans themselves still couldn't escape, teeming hordes of their broods sprang into existence. This swarming host devastated Zendikar. During the rampage, the cultists underwent a transformation. Only twelve of them survived the initial wave of spawn emerging from the prison, but those twelve became the first vampire bloodchiefs, the progenitors of the vampire race. Whether they were originally human , kor or a race of their own, they became something entirely new - and utterly enslaved to the will of Ulamog. The Eldrazi took the plane's vampires as a race of servants, adapting their very anatomy for servitude. Hooklike horns grew from the vampires' shoulders, convenient handles for the Eldrazi to dominate their slave race, and for millennia afterward, carnal symbols of the vampires' heritage of persecution. The vampires, forced to conspire in the campaign of destruction against their own homeworld, had their identity and tribal memory erased forever. After Nahiri enforced the Eldrazi prison all on her own, no more broods came to life. She trusted the people of Zendikar to deal with them and left the plane. The vampires remained, now free of Ulamog's yoke. Millenia later, the subsequential actions of Jace Beleren , Chandra Nalaar , Sarkhan Vol and Nissa Revane freed the Eldrazi titans. After their release, Ulamog was the most prominent titan on the surface of Zendikar. Its brood caused the Slaughter at Sea Gate . The Infinite Gyre Six months after they had been released, both Emrakul and Kozilek vanished, only leaving a few spawn behind. Ulamog continued to blight and ravage Zendikar for two years, despite the efforts of Gideon Jura , Nissa Revane, and the Zendikari. Jace and Jori En encountered Ulamog during their journey to the Eye of Ugin . They attempted to hide with some survivors which were later discovered to be cultists who still worshiped the titan through his fake \"god\" form of Ula . Escaping from their would-be captors, the two discovered that Ulamog was on a direct course for Sea Gate and the remaining survivors hiding with Gideon. Jace dominated Jori En's mind to force her to leave him and return to warn the survivors of Ulamog's coming. The Zendikar resistance army led by Gideon, Nissa, and Kiora assaulted and retook Sea Gate from Ulamog's brood. However, before they could celebrate, Jori En was seen running towards the planeswalkers, warning them. Ulamog was coming. Ulamog's Power In a combined assault, Gideon and Kiora's armies attacked the titan. Gideon then single-handedly wrestled with Ulamog, buying time for Nissa to unearth a massive number of hedrons buried around Sea Gate. Maneuvering the hedrons around the titan, Jace then triggered them, activating their latent magic and knocking the titan off balance while trapping him. Everything looked to be smooth sailing until Ob Nixilis arrived, knocked the hedrons out of alignment, and positioned himself between them. The demon planeswalker absorbed a massive amount of the hedron's magic which reignited his planeswalker's spark and allowed him to escape. Meanwhile, Ulamog was confused, battered, and weakened by the network's activation, still rather immobilized, still in reach of Gideon's armies, and appeared on the edge of defeat. Gideon ordered the joint army to attack and he himself leaped forward to attack the titan, but they were rebuffed by the arrival of a second titan: Kozilek . After heavy initial losses, the Gatewatch performed an orchestrated attack on both titans, binding them again in a web of leylines and burning them. This was the end of the material manifestation of Ulamog on Zendikar. Ulamog appears in mascot form in the trailer for Secret Lair: Just Add Milk . Represented in: Associated cards: Depicted in: Quoted or referred to: Ulamog's Brood: Doug Beyer (March 17, 2010). \" Gods and Monsters \". magicthegathering.com . Wizards of the Coast. Doug Beyer (Monday, March 29, 2010). \" The Eldrazi Arisen \". magicthegathering.com . Wizards of the Coast. Kelly Digges (Know Your Spawn!). \" Know Your Spawn! \". magicthegathering.com . Wizards of the Coast. Adam Lee (June 25, 2014). \" Nissa, Worldwaker \". magicthegathering.com . Wizards of the Coast."}