{"text": "Ulgrotha , whose name means \"Garden\", was a small backwater plane , far from Dominaria , sometimes called the \" Homelands \" by its inhabitants. Ulgrotha was the setting for the Homelands expansion. Apart from being a world very rich in mana and diverse life forms, Ulgrotha wasn't much different from any of the other planes that made up the fabric of the Multiverse . On this plane was the citadel of the Tolgath , a group of planeswalkers directly opposed to their rivals, the Ancients . Around 3200 AR, when the two warred on the plane, the battle was so massive that one of the Ancients was forced to open a rift from Ulgrotha to a different world, just to fuel their spells. To bring a drastic end to the war, the Tolgath Ravi rang the Apocalypse Chime , given to her by her master. The effects of the chime were monstrous, as the artifact caused a magical backlash that erupted across the entire plane, with effects seen even on the distant planes of Dominaria and Kamigawa . The Chime, attuned to the mana patterns and streams of Ulgrotha, disrupted mana channels all over the plane. All creatures perished, and all of the duelists who could not escape in time were burnt by the colorless fire, as an entire world of energy surged against them. The land died, the energy channels ran dry, and most of the summoned creatures died, their lifeforce drank by the very soil of the Dead Zone . Where before the rich earth had produced mana, now it drank mana and life from any creature who walked across its surface. Only the deep sea was safe. Ravi hid in a magical coffin in the Basalt Spire but was later unable to free herself. Only a small section of the plane remained relatively unscathed, as it was fueled by the mana pouring through the rift that was opened by the Ancient wizard. Twenty years later, on the inhabitable plains of Ulgrotha, a nomadic human culture started to form from a mish-mash of the summoned warriors, healers, sorcerers, and the like. Goblins and orcs also made their homes in the Koskun Mountains , and started to dig through the rich soil. The plane was going through some serious changes; there was a constant and violent storm, along with unpredictable seasons and weather patterns. Another forty years and the tales of the Great War started to become only tales for grandchildren; with the passing of the centuries, they continued to degenerate even more, as there is no single and widespread written language. Around 3420 AR, a colony of Dwarves from another plane dug through a subterranean planar gate to Ulgrotha in search of minerals and\ngems. They arrived deep beneath the mountains of the Homelands, where they established a Dwarven city, called New Freedom in the Dwarven tongue. The Dwarves dug to the surface, and started to build a great stone castle called Morning Light overlooking the saltmarsh. A number of the Dwarves built sailing ships to explore the local world they have found their way into, and left the rest of their kin to finish the castle. After two unknown planeswalkers dueled in the swamps near the uncompleted castle, an ancient Vampire Lord by the name of Baron Sengir was left stranded on the plane. When the Sea-Dwarves returned, they found that all of their kin had been slain or turned into undead by the Baron. Even though they knew many ways to get into their own castle, Baron Sengir proved too strong for them. In one of the raids in the dwarven mines, Baron Sengir captured the Dwarven King's daughter, Irini , and turned her into a vampire. Finally, the Dwarves accepted the fact that they would never be able to reconquer the castle and left it to the victor. The dwarves, beaten and demoralized, went to find their own home in this world. The survivors swore a life oath of vengeance and strike the knowledge of the planar gate from their history. Soon after, the Baron discovered the resting place of Ravi, who had gone mad in centuries of imprisonment. He freed her from the coffin, and brought her with him, renaming her Grandmother Sengir. At the same time, the planeswalker Serra arrived in the Homelands. Although temperamental and impulsive, she encouraged peace between the various plains nomads and the foundation of the state of Aysen . She took on the role of protector over the people of Aysen, which saw her as a goddess. Meanwhile, the seafaring dwarves learned that the other inhabitants of the Homelands don't know of the other planes of the Multiverse. Still following their oath of keeping the existence of the planar gate a secret, they decided to try to uncover the fragmented history of their devastated plane. Baron Sengir also started sending his vampires to Aysen, in order to instill fear in the populace. Around 3560 AR, another planeswalker, Feroz , arrived on Ulgrotha. He encountered both the latent planeswalker and soon-to-be apprentice Sandruu and Serra , with whom he quickly falls in love. Sensing the presence of the planeswalkers, the Baron approached them and moved to minimize the obstacle they represent to his plans of conquest. This prompted Serra and Feroz to actively tend to the people of Ulgrotha, in order to give the plane a new chance of renewal. During this time, Feroz founded the Wizards' School on the Floating Isle , to teach the people of the Homelands the rudiments of magic, and Aysen Abbey was built in the city of Onella , in honor of Serra. The relative peace of the Homelands was abruptly broken when a jealous Taysir follows Sandruu (now a proper planeswalker) to Ulgrotha. Their duel was won by Taysir, who exiles Sandruu to a remote plane. Taysir was then confronted and defeated by Feroz but with great damage to the pacific culture of the Anaba minotaurs. The now-married Feroz and Serra realized the danger that wandering planeswalkers represent to the fragile balance of Ulgrotha and decided to cast a magical barrier over the world to guard it against further despoilment at the hands of strangers. Due to the side-effects of Feroz's Ban, the Autumn Willow gained sentience and a great deal of power over the Great Wood . Almost at the same time, the immortal Eron became the King of the goblins of Koskun Keep . The tenuous balance of the Homelands, however, was not fated to last long. Around 4110 AR, Feroz tragically died in a laboratory accident, and Serra was manipulated by Sengir to leave the plane in sadness and guilt. The countries of Ulgrotha then started to fall to internal conflict, and Baron Sengir used this to spread fear and tighten his grasp over the plane. With Feroz's death, the ban began to fail, and planeswalkers were once again able to reach Ulgrotha. Among the known planeswalkers to visit the Homelands were Leshrac and Nicol Bolas . During his brief stay on the plane around 4500 AR, Leshrac saw a vampire army marching in the night at the reluctant command of Ihsan 's Shade, the lieutenant of Baron Sengir, probably hinting that the vampire lord had completed his conquest of Ulgrotha. Leshrac sensed the existence of a vibrant forest and of short, sturdy mountains , however the dominant mana in the land was black. Interestingly enough, the plane had been described as being without rivers or oceans. If this meant that the state of Ulgrotha had worsened from the fall of Feroz's Ban, or if it was only a mistake on the author's part, is unknown. Ulgrotha was a target in New Phyrexia's Invasion of the Multiverse . Almost all of the races that inhabit Ulgrotha are descendants of the few survivors of the Great War . Among them are the humans of Aysen and An-Havva ; the same is true for the goblins , orcs , and minotaurs who reside in the Koskun Mountains. The dwarves (both mountain-dwellers and sea clans) arrived in the Homelands from an unnamed plane through a planar gate, and since the conquest of their castle by Baron Sengir, are trapped on Ulgrotha. With the coming of Sengir, other vampires and werewolves were created. Meanwhile, after the birth of Autumn Willow , Faeries appeared in the Great Wood. In the sea of Ulgrotha live sea trolls and even a few merfolk . At least some of the plane's inhabitants wrote in a script known as Old Ulgrothan. Avatars - Autumn Willow and Daughter of Autumn Dwarves Faeries Goblins - Ruled by Eron . Depicted on several cards such as Ambush and Evaporate Humans An-Havva Aysen The Dark Barony Various bandits and rogues Minotaurs and Minotaur Spirits Orcs - Depicted on Orcish Mine Shade Sea Trolls (e.g. Sea Troll ) Vampires - Including many vampire dwarves Werewolves (e.g. Greater Werewolf ) Zombies (e.g. Reef Pirates ) Gargoyles - Mana constructs created by Serra (e.g. Abbey Gargoyles ) Gnomes (e.g. Clockwork Gnomes ) Insects (e.g. Clockwork Swarm ) Rhino (e.g. Ebony Rhino ) Walls Badgers (e.g. Rysorian Badger ) Bats (e.g. Sengir Bats ) Bears , including Spirit -Bears (e.g. Spectral Bears ) Birds Dogs , including Spirit -Dogs (e.g. Ghost Hounds ) Elementals (e.g. Hungry Mist ) Ferrets (e.g. Joven's Ferrets ) Horrors (e.g. Timmerian Fiends , although they might not be native to the plane ) Horses Lizards (e.g. Leaping Lizard ) Mammoths - Depicted on Mammoth Harness Oysters (e.g. Giant Oyster ) Serpents (e.g. Marjhan ) Spiders (e.g. Root Spider ) Unicorns - Depicted on Feast of the Unicorn Whales (e.g. Narwhal ) Wolves (e.g. Heart Wolf ) The majority of the plane is a Dead Zone , a cursed place that strips away not only the mana but the very life of everything touching it. This effect doesn't extend into the deep sea or onto its surface, but just to the areas near the shore. Only a small portion of the plane, on the edge of the Greater Sea , was spared from the devastation caused by the Apocalypse Chime, since it was close to an extraplanar rift opened by an Ancient planeswalker, deep under the surface. The steady flow of mana kept the area alive and not drinking up mana; an oasis on a plane thirsty for energy. The inhabitants call this region the Homelands. Most of the humans drifted to the Northern Plains, where they would found the country of Aysen, while goblins and orcs found a home within the mountains to the South, naming them Koskun Mountains. The mountain range was already inhabited by the minotaurs, that lived secluded within the vales of the Kher Range ; they continued with their lives in much the same fashion, relatively unaffected by the dramatic turn of events. Bordered by the Dead Zone, the Sea, and the Koskun Mountains, the eastern swamps were for the most part unpopulated, at least until the arrival of the dwarves first, and Baron Sengir later, who would transform them into his Dark Barony . One forest at the western base of the Koskun mountains still contained many creatures and monsters, some indigenous to the plane, others summoned and left behind. A small island near the Homelands coast also didn't have the draining effect found elsewhere in the world. Ulgrotha has a planar portal , which is located in the abandoned dwarven city under Castle Sengir. Where it leads is unknown, although Ulgrotha's dwarf population emigrated from beyond it. Another portal leads from Dominaria 's Sursi to the Koskun Mountains. Northern Plains The Citizenship of Aysen Onella , its capitol The Serra Aviary Aysen Abbey the Border Gates of Aysen The Floating Isle Port the Wizards' School The Dark Barony Castle of Morning Light / Castle Sengir New Freedom Koskun Mountains Kher Range Koskun Keep Strongrock Ruins of En-Sendra Koskun Falls Koskun River The Great Wood An-Havva Carriage Road Kerselin Lady's Path River Bridge The Dead Zone Basalt Spire The Ulgrothan Citadel The Greater Sea Serra's Isle Sengir As Ulgrotha Associated cards: As Homelands Referred to:"}