{"text": "Umbris is a nightmare horror from Ulvenwald , Innistrad . The bright light of Innistrad's silver moon casts long shadows as you travel through the Ulvenwald . Near imperceptibly, perhaps spotted in the corner of your eye, black mist leaps between the darkness. You can't tell if it's getting closer (it is). Is this thing you sense a demonic threat? A horror brought about by the monster's presence on the moon? A twig snaps, and you turn around quickly, just in time to see a figure made of teeth and claws pull itself up out of your shadow. Umbris is a spectral entity that feeds on the painful and sad memories and fears of humans . But to appreciate such feelings he must have a physical body. One hundred years ago Taivas imprisoned Umbris in a magic circle and made a pact with the entity. Umbris should steal the painful and sad memories of the villagers of Traublassen (so they would always be willing to work) in exchange for Taivas or someone in his family delivering human sacrifices to Umbris at certain times. With the pact made, the village and, mainly, the Taivas family prospered. Umbris stole the villagers' memories and sorrows and stored them in jars, for which he counted on the help of devils who served him as their master. One hundred years later, Taivas' great-grandson Vytas hired Torens to investigate strange sounds coming from an old building on the outskirts of Traublassen. Unknowingly, Torens was sent to Umbris as a sacrifice. The entity possessed the body of Aleksandar , who was helping Torens in his investigation, so Umbris could enjoy the stolen memories. When Torens found the possessed young boy, Umbris made an offer. He would remove the painful memories of the death of Torens' mother and older brother and the man could leave in peace. Torens refused and destroyed the circle that held Umbris using his sacred mace. After he freed Umbris, Torens made a new deal with the entity. In exchange for leaving Umbris unharmed, the entity must return the stolen memories to the villagers and abandon Aleksandar. The entity accepted the agreement and before departing heard from Torens that the next time they would meet Torens would destroy him. Depicted in:"}