{"text": "Urabrask ( Phyrexian : DYrbreLh , IPA : [ʔurbrask] ), \"the Hidden,\" was the red -aligned praetor of New Phyrexia . The most mysterious praetor in the beginning, his continual defiance of the New Phyrexian leadership gave the Mirran resistance the chance they needed to eventually bring the fall of Elesh Norn . He is presumed dead. He had a blazing-hot temper and was easily infuriated when dealing with others. Much less formal than Phyrexians like Elesh Norn, Urabrask was known to be sarcastic and even sassy. He often injected slang and modified words into his speech, expecting his followers to understand his meaning. Physically, Urabrask was serpentine, with a long tail and powerful limbs. His head was eyeless, its most notable feature being a crocodilian mouth filled with jagged teeth. Urabrask was constantly upgrading himself; it's unclear if any of his original form remained. As of his travel to New Capenna , he had upgraded his body with large, metallic blades onto his forearms. Upon his return to New Phyrexia, his body was streamlined, redesigned to be more combat-ready and aggressive. His body glowed with internal heat, which is vented from two exhaust ports protruding from his back. Like other praetors, Urabrask believed the compleation of living beings elevates them into a more perfect Phyrexian form.  As one of the more intelligent red-aligned Phyrexians, however, he retained a sense of individualism and some empathy.  Unlike the other praetors who force new recruits into their designs, Urabrask preferred they retain the strongest parts of their original form and contribute these assets to Phyrexia. Secretly, he preferred when beings willingly choose to join New Phyrexia, but he was not above destroying those who oppose it. Urabrask opposed the strictly hierarchical leadership of New Phyrexia . Similarly to Jin-Gitaxias , philosophical differences led to him coining a new term for Yawgmoth's Grand Evolution: The Great Work. After Phyrexia's conquest of Mirrodin, Urabrask allowed the Mirran survivors to take refuge in the furnace layer of the plane, which was controlled by him. This was because he is aligned with the color of emotion and freedom , granting him enough empathy not to (actively) destroy the Mirrans. This, coupled with a sheer dislike of the other factions, led him to seal the Furnace Layer of the plane off from other Phyrexian factions. For the most part, they didn't seem to care either, except the blue -aligned Progress Engine, who was paranoid about it. Inevitably, Elesh Norn laid waste to his domain, though the Mirran Resistance fled to the mountain shelters, out of her reach. He and his red Phyrexians now dwell on the Furnace Layer. Seeking to double-cross Norn, Tezzeret found an unlikely ally in Urabrask, who he transported to New Capenna . The Planar Bridge heavily damaged the praetor's body, searing his flesh from his inorganic components, and leaving him in a severely weakened state. He had been in the city for several weeks, healing enough to survive a return trip. While there, the praetor met with Vivien Reid and tasked her with bringing him Halo and the Planeswalker Elspeth Tirel , claiming that her presence would tip the balance of the war on New Phyrexia in the Mirrans' favor. Returning to New Phyrexia, Urabrask and his rebel Phyrexian faction openly fought against Elesh Norn, staging their own rebellion parallel to that of the Mirrans (though they do not openly assist them). The rebel Phyrexian faction included the Steel Thanes that didn't bow to Elesh Norn. Later, he helped Chandra and Wrenn , among a squadron of Mirran resistors, reach Realmbreaker . Soon after, Urabrask was captured by Elesh Norn's forces, and the Grand Cenobite ordered his execution by quartering. Once the heretic praetor was reduced to a limbless torso, Urabrask himself heard Norn ordered her harvesters to \"leave the traitor be,\" but whether this dismemberment was a fatal injury is not confirmed. As a powerful Phyrexian, Urabrask could travel to other planes using an improved form of the Planar Bridge , though this travel would leave him severely wounded, as his organic flesh was seared from his body. New Phyrexia Capenna Associated cards: Depicted in: Quoted or referred to: ^† Scryfall does not record flavor text for digital cards. See Alchemy: Phyrexia/Flavor text The flavor text of Steel Sabotage ( Mirrodin Besieged ) attributes support for the Great Work to a member of the Progress Engine , whose relationship to Urabrask is unfriendly. Urabrask speaks the Phyrexian language with an accent. He believes in innovating the language, and often incorporates his own slang. An example of this can be shown in the flavor text of his phyrexian language card: while the English version sounds formal, the structure is actually more akin to \"Let them be, duh!\" Urabrask is the only Praetor not to be explicitly killed during March of the Machine , with it noted that he was conscious despite having lost all his limbs. Vorinclex is written as though he was defeated by decapitation, but that may not have been lethal either."}