{"text": "Vampire is a creature type . The first card with the subtype was Sengir Vampire in Alpha . Like Zombie , Vampire is a characteristic race for the color black. Vampires are a bloodthirsty species, often a type of undead . While humans are the most common victims of vampirism, other races can be afflicted as well. Throughout the multiverse , vampires can be created through other vampires turning their victims, or through enchantment . The most defining characteristic of vampirism is their hunger for the blood and/or life forces of others. Other traits of vampires can include unnatural physical strength, enhanced healing powers, and/or the ability to fly , with their methods being through either natural or supernatural means. Many species of vampires are highly sensitive to sunlight and therefore only go out at night or in the shade, but this is not always the case. Regardless, the secretive and predatory nature of these creatures means that they all prefer the cover of darkness. Vampires can range from mindless predators to sophisticated and intelligent nobles. The appearances of vampires are similarly varied, although they all have somewhat elongated fangs, with the more feral ones having bat-like qualities. Before the Conflux , the rare Alaran vampires were exclusively found on the shard of Grixis , where they fed on zombies . Grixian vampires range in their strength from the amount of vis they have consumed. Those who only managed to wring lifeforce from corpses are skeletal and mad with hunger, often lacking the ability to fly. Those who managed to taste vis from the still-living soar in the skies, commanding hordes of bats and other vermin. Blood-sated vampires have an almost irresistible aura of power. These vampires knew that their life on Grixis ran on borrowed time and held annual meetings at Unx to discuss how to prolong their race's survival. After Grixis rejoined with the rest of the plane, vampires were known to be seen flying over neighboring lands like Jund . Vampires of Arcavios have elongated ears and are associated with Silverquill and Witherbloom . Some are even deans, such as Valentin. They are seemingly less vicious than their counterparts from other planes, with some openly stating that violence is \"the last resort of the witless\". A Sengir Vampire Sengir Vampires are said to be descendants of the legendary Baron Sengir of Dominaria and Ulgrotha . While they are most common on the latter, others have been found across the multiverse . On Dominaria, they were found in Aerona and in the pits of the Cabal in Otaria . Over the centuries, the Sengir bloodline has degenerated; while they were once as attractive and human-seeming as their progenitor, Sengir vampires are now hideous, misshapen creatures with pointed ears, long claws and toes, and feral eyes. Their skin is so translucent that their blood vessels show through. After feeding, a patch of red blood can be seen where their stomach is. Their fingers are webbed, and a thin patagium connects their arms to their body to facilitate flight. Krovikan Vampires stalked the streets of the plague-ridden city of Krov during the Ice Age , led by their queen Garza Zol . These vampires have a pale appearance, with porcelain-like skin and blood-red eyes. A Vampiric Dragon appeared in a short story in The Monsters of Magic anthology. They are particularly dangerous, combining the strengths of both races to lethal effect. The vampiric bloodlines that govern the Innistrad province of Stensia reap the benefits of the isolation in the region. The chain of mountains called Geier Reach , which dominates the province, separate the valleys from each other and makes them easier to be monitored and controlled. The suffering humans of Stensia have an irrational loyalty to their oppressive home, but strictly speaking, have few options; they are trapped in the narrow mountain passes and attached to their customs and lives of herding and gathering. Thousands of years ago, before there were vampires on Innistrad, Edgar Markov was an alchemist in the land that would become Stensia. Famine was sweeping the land, and the old alchemist Edgar searched for a solution that could help the starving families feed themselves. The answer was a brutal one: to undergo a blood ritual that would cause some of the people to feed on blood. It would provide sustenance to those few, reducing demand for the failing crops, but it would also cull the overall population, reducing the number of hungry mouths to feed. Thus were vampires born on Innistrad. Though they are not undead, they have some traits common to undead, including agelessness and skin cold to the touch. Neither a virus nor a curse, vampires euphemistically refer to their vampirism as a \"condition of the blood.\" The eyes of Innistrad vampires have black sclera and gold, silver, or red irises in the middle. Innistrad vampires have a particular weakness against weapons cut from living wood, although normal weapons can also be used. They are unable to cross streams that show the reflection of the moon, and water blessed by Avacyn or her archangels burns them like acid. Within silver or a silver-backed mirror, they appear as they would have as humans. If they fail to drink about five liters of human blood in a moon's cycle, they shrivel to dust. Not all vampires are created equal. Among the existing vampiric bloodlines, some are more common but prestigious whereas some are rare but less respected. There were originally twelve bloodlines, which originated long ago in a ritual that had something to do with the Markov progenitor, Edgar Markov . Three of these bloodlines have died out completely. Five others are relatively minor, having sired fewer vampires. Each bloodline has a special affinity to certain abilities innate to the vampiric form. The four major bloodlines that remain are: Falkenrath Markov Stromkirk Voldaren The Falkenrath and Stromkirk largely fell victim to Emrakul 's corruption. The Markov suffered great losses when the lithomancer Nahiri destroyed Markov Manor, trapping its inhabitants in stone. Four of the remaining five minor bloodlines are: Dusken , a nearly extinguished bloodline that rivaled the Maurers Maurer, founded by Strefan Maurer and fairly centered around Strefan's domain in Stensia's outland valleys. Domnathi , vampires that are consorting with demons . Nusfar, predatory vampires that look like children. Uniquely, some vampires on Ixalan are mono- white and part of the Legion of Dusk . They originate on the continent of Torrezon, which is under their control. Expedition forces have crossed the sea to Ixalan to reclaim an artifact stolen from them - the Immortal Sun . With it, they hope to bestow immortality without the drawback of drinking blood to their followers. The first of their kind, Elenda of Garrano , allegedly achieved this state due to a deal with Aclazotz on Ixalan and then spread her teachings among her native kingdom before leaving them behind again. The vampires on Ixalan live heavily clad in ritual and taboo and they are viewed as holy by the population of their homeland; they view the increased strength and speed they receive from drinking blood as proof of their blessed state. They believe that everything exists in a state of perpetual balance; gain is impossible without loss, triumph without sacrifice, and no sustenance without death. They undergo what is referred to as a Blood Fast, in which they starve themselves for some time. When this is over, they enter a state known as the rapture, in which they revert to an animalistic trance and attack anything in sight. Ixalan vampires feed only on the blood of the guilty; meaning heretics, criminals, and rebels against the state. Of course, other vampires are more liberal in their choice of prey, defining guilt along with their parameters. Unlike the Vampires of Innistrad, Ixalan vampires are unharmed by the sun. They have pale skin and pointy, bat-like ears. By transforming the lower half of their body into black smoke, they can achieve flight (which they refer to as the Exaltation). Some aetherborn like Yahenni, Undying Partisan have the vampire sub-type. A few aetherborn are spawned with the ability to absorb others' life force, prolonging their own lives. Some dragon s of the realm of Immersturm on Kaldheim are vampiric, and are the only known vampires endogenous to the plane. Mephidross Vampires are named after the Mephidross on Mirrodin . The warlord Geth kept what he believed to be the only Mephidross Vampire as his bodyguard until it was defeated by Glissa . Afterward, Geth created a new vampire from a Moriok named Yert , who then established himself as the new prime predator of the Mephidross. Like all of the creatures on Mirrodin, Mephidross Vampires are partly metallic. Its most prominent feature is that it has fangs on his hands rather than his mouth. With the return to Mirrodin in the Scars of Mirrodin block, it was revealed that whole clans of vampires live in Mirrodin. Often, these are former Moriok clans that willingly turned into vampires to survive the Nim Onslaught. Like the Mephidross Vampire , they have characteristic fangs on their pointer and third fingers. Of New Phyrexia's vampires, only the most skilled assassins are granted a seat in the Bleak Coven. They are led by Vraan , the Thane of Blood. The vampires in the metropolis of New Capenna are often part of the Maestros crime family. While becoming a vampire does not appear to be a requirement of joining the Maestros, many human members do receive the gift of vampirism. They hide their illegal activities behind an interest in preserving art and relics of Old Capenna.  They have sharp senses and are undead, possessing both agelessness and some resistance to injury.  However, they are not invulnerable. Anhelo bears the scars of a previous fight with a Nightmare , and, following a strong blow to the head, he expected to be pained and unbalanced for the rest of the day, although he did survive the blow.  Likewise, Xander's knee never healed even after centuries after its initial injury. One man claimed vampires are addicted to luxury, though how true that statement is (whether it is inherent to their nature, a result of being in the Maestros family, or only a stereotype) remains unknown.  Vampires in New Capenna are not bothered by sunlight. It appears that vampirism may not be inherited, as Errant , who appears to be the biological daughter of Anhelo , is a human and not a vampire. Vampires on New Capenna do not appear in mirrors, and thus often employ the artistic skills of Parnesse , a vampire who is Errant's wife and Anhelo's daughter-in-law, and who can view herself using an Obscura surveillance device. Vampirism came into existence around the time of the founding of New Capenna.  Xander, founder and head of the Maestros, was the first vampire, and his first progeny was Evelyn . Xander also gifted vampirism to Anhelo who was already serving Xander before the city's construction. Xander, Evelyn, and Anhelo are thus among a small number of inhabitants of New Capenna left who remember a time before the city's founding. Skyshroud Vampires are found in the Skyshroud Forest , where the dense foliage provides them with shelter from the sun. They are amongst the most bat-like and unintelligent forms of vampire. Vampire Hounds are used with watch dogs in Stronghold . The Moroii from Ravnica are psionic vampires, draining the youth and mental abilities of their victims for sustenance. They are employed by House Dimir as assassins and spies (although they employ traditional blood-drinking vampires as well). They are unaffected by sunlight.  Some look like humanoid bats while others, such as Szadek and Mirko Vosk , could pass as humans. Orzhov vampires are a lower ranking of Syndicate members who have not been allowed the gift of becoming a spirit and have settled for being turned into vampires instead. Shandalar is known to have vampires, some of these Bloodlords influence the corrupt city of Lesh. Vaasgoth is a name associated with a few Shandalarian vampires although it is unclear if this is a familial house, faction, or place. There are 2 species of vampires on Tarkir: The native Kheru vampires - This species of vampire looks vastly different than other known vampire species. They have giant tongues and their fangs look more like tusks. They are members of the Sultai Brood and live in the jungles. The vampire planeswalker Sorin Markov created progeny when he entered Tarkir in his search for Ugin . While in the old timeline, his vampiric spawns were left behind, in the new timeline, they were sacrificed to break Ugin's hedron cocoon. Zendikari vampires are associated with black mana since their existence is predicated on draining the life from others to fuel their existence, on putting their own lives ahead of everyone else's. Philosophically, they do not constrain themselves with artificial rules of morality but believe that the strong can and should take what they need from the weak. Bred to a life of decadent corruption, the vampires of Zendikar feed on the energies in the blood of living creatures—energies that are particularly strong in times of terror and pain. To members of other races, they are a fearsome mystery, the stuff of nightmares, hunting their prey like beasts through the jungle or reclining on thrones made of skulls in their moss-draped cities. Hexmages are vampire mages who use their talents at curse-magic to drain quantities other than blood. A few Zendikari cultists were made vampires by the Eldrazi Ulamog and differ from typical vampires in many respects. They have a lifespan of approximately 200 years, and while they feed on blood, it does not have to be blood from a sentient race. A few thousand years after the imprisonment of the Eldrazi by The Three , the noxious creative force of Ulamog became an infection that took hold of the people who dared to live in Akoum 's mountains despite the tectonic instability of the region. They became a sort of cult devoted to an imagined deity of the mountains, established a temple near the site of the prison, and began performing rituals inspired by their growing madness. The cultists avoided the notice of the increasingly reclusive Nahiri and over time and multiple generations, their rituals proved effective in loosening the bonds of the Eldrazi prison. Though the titans themselves still couldn't escape, teeming hordes of their broods sprang into existence. This swarming host devastated Zendikar. During the rampage, the cultists transformed. Only twelve of them survived the initial wave of spawn emerging from the prison, but those twelve became the first vampire bloodchiefs, the progenitors of the vampire race (among them Rayami, First of the Fallen ). Whether they were originally human , kor , or a race of their own, they became something entirely new – and utterly enslaved to the will of Ulamog. The Eldrazi took the plane's vampires as a race of servants, adapting their very anatomy for servitude. Hook-like horns grew from the vampires' shoulders, convenient handles for the Eldrazi to dominate their slave race, and, for millennia afterward, physical symbols of the vampires' heritage of enslavement. The vampires, forced to conspire in the campaign of destruction against their homeworld, had their identity and tribal memory erased forever. After Nahiri enforced the Eldrazi prison all on her own, no more broods came to life. She trusted the people of Zendikar to deal with them and left the plane. The vampires remained, now free of Ulamog's yoke. The later Zendikar vampires are divided into five families, each presided over by a bloodchief, a powerful, immortal vampire. Each bloodchief is the progenitor of their entire family, as when a bloodchief drains blood from a sentient creature, that creature will become a vampire with the tastes and passions of the bloodchief imprinted on them. Whenever a vampire fully drains the blood of a living creature without destroying the husk, that creature does not become a vampire. Instead, it becomes a null , a faceless zombie that is stronger and much faster than typical zombies. If nulls are left without orders, they will hunt and kill living things that they can find. The vampires live in cultured, decadent cities on the humid continent of Guul Draz . Each family controls its section of the vampire city of Malakir . \nThe five vampire families are: Kalastria - The wealthiest and most powerful family, who refer to themselves as Highborn . The head of the clan is Drana . Nirkana - Notorious assassins, including a group called the Lacerators who are feared by all. Emevera Urnaav Ghet - The poorest and least powerful of the families. The head of the clan was Kalitas . As the Roil increased in intensity in the leadup to the Eldrazi's escape, hinterland vampires, considered primitive by the Malakiri vampires, began flooding the city. Tensions rose between the refugees and the highborn families until open warfare broke out in the streets. When the Eldrazi finally broke free again, the vampires became locked in a brutal civil war. On one side, desperately battling to remain free, were those who held to their traditional ways. On the other side were those whose legacy reached back into the deepest recesses of Zendikari history. Bound once more to their ancient masters and creators, the Eldrazi, these vampires hunted their kin into the wild swamps to extinguish the very idea of freedom and rebellion. The Ghet seized holdings outside of Malakir, including the port city of Nimana, and threatened to turn all of the vampires of Malakir into thralls of the Eldrazi. Drana struck back, retaking control of Malakir and driving Kalitas and his traitors away from the city. But Drana's victory was short-lived, and she and her remaining people were driven from the city by ever-growing hordes of Eldrazi. As the only survivor of the first generation of vampires, Drana holds unquestioned leadership over vampire society as it rebuilds from the devastation of the war against the Eldrazi. In a desperate attempt to repopulate vampire society, Drana is trying to discover the means to create new bloodchiefs, since only a bloodchief can create a new vampire. The most defining characteristic of vampires is their hunger for the blood or life force of others. This has been represented mechanically in several ways within the game. The two most notable are the addition of +1/+1 counters for sending other creatures to the graveyard, and the ' bloodied ' mechanic of Zendikar , where Vampires get bonuses as long as an opponent has 10 or less life. For most of Magic's history, vampires and demons have occupied a similar position card-wise. Both were large, flying, expensive-to-cast 'iconic' black creatures that showed up as rares a few times in each set. This meant that vampire cards had to compete with demon cards for a limited amount of card slots in a set, and they often lost out to the slightly more iconic demons. Meanwhile, vampires were becoming more and more popular amongst movie-goers and readers of fantasy fiction. To solve the demon/vampire dilemma, and 'cash in' on the popularity of vampires, they were shifted from big iconic creature status to the role of the shared characteristic race of black with Zombies . In essence, vampires became smaller in size, but larger in numbers, showing up in common and uncommon slots. They also gave the color a common creature type that represented the color pie slightly better, as zombies tended to have little agency and required the lore of necromancy responsible behind their return. To achieve this, vampires were given a vampire lord in Magic 2010 , followed by a heavy tribal theme in the Zendikar block , even though Zendikar was not a tribal-based block. This seems to have continued with the Scars of Mirrodin block, on a plane that was previously noted for having only one vampire ( Mephidross Vampire ). Ravnica also increased their Vampire population in both return blocks, though Tarkir , Theros , Kaladesh , and Amonkhet had less than five per block. Vampires have spanned all colors, though their secondary color is largely partitioned by plane. On Innistrad , black and red Vampires are a major supported tribe and repeated each return. Red is the second-most common for monocolored vampires due to Innistrad's three blocks. Crimson Vow expanded the Innistrad Vampires into White while also keeping Red, and featured the first nonblack multicolored vampires, the Red/White Markov Waltzer and Odric, Blood-Cursed . White has had multiple gold Vampires across Dragon's Maze and Battle for Zendikar block , and eventually the race was introduced to mono-white in Ixalan . Since then vampires are a common choice for the black-white gold uncommon, even in core sets. Vampires with blue in their cost have been seen on a few planes, most on Ravnica , one on Grixis and some on Innistrad as well. New Capenna 's Maestros clan brought the first common blue vampire ( Glamorous Outlaw ) and ten others, nearly doubling the blue vampire count of the time. The first vampire with green in its cost was featured in Commander 2019 : Rayami, First of the Fallen . In Strixhaven: School of Mages , Blood Researcher marks off the first Standard-legal, first common, and first nonlegendary green Vampire. Bloodthirsty vampires Rise of the Vampires Magic Arcana (February 18, 2010). \" Visualizing Vampires \". magicthegathering.com . Wizards of the Coast. Monty Ashley (November 09, 2011). \" Visualize More Vampires \". magicthegathering.com . Wizards of the Coast. Mark Rosewater (October 25, 2021). \" How Trivial – Vampires \". magicthegathering.com . Wizards of the Coast."}