{"text": "Vantress is the blue -aligned court of the Realm on the plane of Eldraine . It borders on Ardenvale and Garenbrig . Vantress' symbol is a keyhole. The court exemplifies the virtue of Knowledge and is the former home to Indrelon , the Magic Mirror . Vantress has no official ruler. Instead, the people of Vantress are led by the Magic Mirror itself. Still, taking the orders of a sentient magical object that spends most of its time underwater can be quite a challenge, so most of the day-to-day responsibilities are tended to by the archmage, currently Gadwick . The highlands of Vantress are riddled with murky swamps and noisome bogs. The castle itself sits at the center of the lake Lochmere , in which live undines who ferry travelers across, making it almost impossible for an intruder to make it into castle grounds. A walled and warded compound stands on the shore, with an inn, a barracks, a substantial stable, and warehouses for goods waiting to be ferried over to the castle. The water of Lochmere is opaque, not silty but impenetrable, as if it devours all light. Its depth is unknown. Patches of fog drift along the surface of the lake, which is cut here and there by rocky islets like a giant's stepping stones tossed across into the wide expanse. The castle itself rises as an island above the gloomy waters of the Lochmere. Pillars shore up the outer rim of the castle, wrapped by mist and spray. Spire-like towers and roofs are draped with pennants and flags and banners that flutter in a wind lifting from beneath. The constant movement gives the impression of a place that can never be still, much like the questing minds of its loremages , riddleseekers, and chroniclers. The mists clinging to the pillars that support the castle come from the churn rising off a vast circular waterfall. Around the pillars and the mantle of rock they rest on, which is a hollow ridge of mountains rising beneath the lake, the water pours away into a massive hole. The waterfall protects both the castle and the mirror and thus makes it impossible to attack Vantress by boat. A ramp angles out from the main level of the island and drops past the pillars to meet the water well away from the deadly waterfall. Inside the castle walls are a marketplace and a series of meeting areas where people sit in groups debating or in stone-tiered theaters listening to lectures. The central structure of the castle is a circular building whose interior is a series of short stairways linking study rooms and libraries. In Vantress, knighthood is knowledge applied to the challenges of the world. To become a knight, an aspirant must tell the Magic Mirror a secret it did not already know, and even then, the gift of knighthood is bestowed at the Mirror's inscrutable discretion. Once that gift is bestowed, the blue/grey knights of Vantress continue to seek out new secrets for the Mirror, but they also venture out into the world and the Wilds to put their knowledge to use. Many of them strive to help those who are in need of knowledge. To the knights of Vantress, knowledge must serve a practical application; the mere compulsive hoarding of trivia, as practiced by the wild merfolk of Eldraine, is anathema to them. The elite knights of Vantress use owl- griffins as steeds. Vantress wizards (often called loremages , chroniclers, or riddleseekers) seek out the lore of the Wilds and dig into the secrets of the convoluted magic of the fair folk. They are known to be daring and well-traveled scholars; it is not uncommon for knights of every court to journey into a remote swamp or delve a firefly-lit cavern and find a loremage of Vantress already there. Vantress wizards are experts in contracts with supernatural beings, resolving transformations, and the terms and consequences of faerie promises; they routinely spout off counterexamples, exceptions, and special conditions. Consulting the magic mirror is no easy task. One must tell Indrelon a secret that it doesn't already know to have a single question answered. Indrelon may be found via a round chamber beneath the central building at whose heart lies a large pool bridged by a stone pier. Two pillars mark the start of a stone staircase that descends into the water. If a worthy applicant approaches, the water-level slowly recedes, revealing a staircase carved into the side of a well-like hole in the rock. The stair ends in a narrow rocky pit, where the path continues through an archway carved into the rock at the base of the castle's foundation. It opens to a stone bridge spanning a circular chasm. The lake waters continuously pour a streaming curtain all around the chasm. Where the bridge meets the far wall of the chasm, stairs take a spiral path, winding along the side with a sheer stone wall to the right and a stone barrier with keyhole openings to the left. As one descends, the waters finally fall away to expose Indrelon, a towering arch built in the shape of the Vantress keyhole. When the waters have drained, all that remains is a shallow pool surrounding the mirror, filled with undines. A small stone causeway and eight steps lead a raised platform. From here, one can address the mirror. When activated, the open space within the keyhole arch shimmers and hardens to become the mirror. Indrelon speaks with a voice that squeezes the heart. When the presented secret is unsatisfactory, or after a satisfactory secret has been exchanged for the answer to a question, the waters in the pool and well quickly rise again and the mirror disappears in its depths again. Eight or nine generations before the Wildered Quest, mankind rose and overthrew the Elven Lords that had enslaved them, and the five knightly courts were created. The court of Vantress was established around Indrelon . During New Phyrexia's Invasion of the Multiverse , Lochmere was flooded, destroying much of the castle. In a matter of days, Vantress and all other courts fell before the invaders. In the aftermath of the Invasion, Indrelon was stolen from Castle Vantress and moved to Beluna Grandsquall 's castle, Stormkeld. Acting king Will Kenrith abandoned Castle Ardenvale moved his seat to Vantress. As the Wicked Slumber spread across the plane, Will instructed Vantress's wizards with encasing its victims in glass caskets and studying its effects. Associated cards: Depicted in: Referred to:"}