{"text": "Viashino is a predominantly red creature type describing intelligent bipedal humanoid lizard -folk descended from Dragons , over whom they exert some power. The savage Viashino possess lean but muscular builds and can be agile, quick, and vicious when necessary. Before they appeared on cards, the viashino were mentioned in the The Prodigal Sorcerer novel. The novel came out exactly a year before Mirage was released. The Viashino were a creation of Mark Sumner for this novel, and the team behind Mirage liked them enough to incorporate them into the game.  A likely prototype of them, the Viashin, appeared in Sumner's short story \"Storm Winter\", published in Dragon Magazine #163. Viashino were introduced to the game in Mirage ( Viashino Warrior and the legendary Hivis of the Scale and Zirilan of the Claw ). The Lizard Warrior from Portal depicted a Viashino, but didn't have the subtype . The creature type returned in Visions , Urza's Saga and later sets. Mark Rosewater 's opinion is that it was a mistake to create the Viashino subtype for the Lizardfolk. On the Alaran shard of Jund , the viashino possess a crocodilian form. Viashino are fairly unintelligent and with minimal society. They form self-organized hunting bands referred to as thrashes that live and hunt in well-defined territories in the swampy lowland jungles. Brute strength determines who leads the thrash, and once established, the leader makes all decisions for the viashino in his band. The personality of the leader affects how the thrash hunts and where it lives. When a leader is killed, a thrash often will change its name and move to a new hunting ground. Viashino males generally lead the thrashes: they are heavy-set, muscular creatures that resemble humanoid alligators. The whole group is nomadic, though, so the females also hunt and fight — and when they’re protecting clutches of eggs, they can overpower males larger than themselves. Known thrashes include: Carrion Thrash Manytooth Thrash: This thrash prides itself on the might and viciousness of its warriors. They seek out other thrashes against which to test themselves, and over time have earned a very large territory for themselves. The Manytooth have a coming-of-age ritual that involves young viashino fighting to the death for the right to become full-fledged warriors of the thrash. Palehide Thrash: This thrash prides itself on slaying humans, which they call \"palehides.\" They're aggressive and largely nomadic, following what weaker human tribes they can find. Their leader is an old, brittle-scaled viashino named Igh who claims to have personally slain three hundred humans in his lifetime. Pitch Thrash: This thrash rules a vast network of low-lying tar pits known as the Seethe. Leadership changes often; the black mana of the Seethe causes these viashino to be more treacherous and merciless than other thrashes. The thrash specializes in running its prey into the pits and trapping them in the quagmire. Scorch Thrash Thorn Thrash Thunder Thrash / Skyclaw Thrash Viashino are masters of the ambush, lying in wait for beasts or human hunting parties. Sometimes a viashino party will raid a human settlement, stealing children or other objects of value to lure the humans onto the canyon floor. The viashino conceal themselves in the murky channels that wind across the jungle floor, sometimes for days, waiting for the warriors to pass. On the shard of Grixis , necromancers have found the remains of viashino and resurrected them as zombies or skeletons . After the Conflux , the Viashino of Jund were confronted by their primitive, beastly, counterparts on Naya . Viashino weapons are simple, usually, clubs studded with chips of obsidian or teeth. Kikkach: The paddle-shaped club lined with the teeth of crocodiles or predatory dinosaurs is called a kikkach, which means \"rasping tongue\" — like that of a great cat. Sshak: A sshak is a crude axe carved from a large animal's bone, with chips of obsidian along the cutting edge. The name is an onomatopoeic name for the sound of its strike. Challik: Some viashino use a type of grappling hook that launches jagged, heavy stones attached to cords that let them draw in entangled prey. The word challik translates as \"toad's tongue.\" On Capenna , viashino are more draconic than lizard-like, to the point of some possessing breath weapons. They are found almost exclusively among the Riveteers family. In Dominaria , viashino are the main civilization on the Shivan sands. In addition to Shiv, they may be found throughout the Burning Isles and as far west as Jamuraa . The viashino live in clan communities, each of which is led by a ''bey'' , and have a society of warriors. They live almost exclusively in simple desert camps, which can disappear in minutes if they decide to mobilize. Despite the emphasis on militarism and their warrior code, the viashino are also known for their metalsmithing and crafts. As harsh as the desert is, the viashino are suited to it, relying on \"sand swimming\" for transportation and tactical advantage. Viashino have constantly been skirmishing with the Goblins , which are also native to Shiv, the Ghitu tribe of humans , and even the Shivan dragons themselves. In the face of any outside adversity, the viashino often became staunch allies of the goblins and the Ghitu . The four species now have formed the Shivan Nation together. The Viashino of Tamingazin live in the city of Berimish. The city does not have any stairs, as they prefer to use climbing poles. Older viashino “retire to the breeding house” and they don't know their gender until they reach maturity. A cold-blooded species, the viashino survived the Ice Age by hiding within the Mana Rig . The wild En'Jaga of Tamingazin are possibly related to the viashino. They are twice as high as any human, and have huge fangs and armored scales. The viashino of Karsus populate the plane's Mirrored Depths. In Ravnican society, the viashino are members of the guilds, among them the Boros Legion , Gruul Clans , and Izzet League . \"Viashino\" — Phyrexia.com"}