{"text": "Vivien Reid , named the Queen of Ghosts on Ixalan , is a shamanic human planeswalker . Vivien was born on Skalla , a plane destroyed by Nicol Bolas . Raised for the hunt, Vivien is tall and muscled. She has medium-dark skin and her dark hair is usually held back in a pragmatic ponytail. She has a martial demeanor and a cold-sated intensity. Lately, her hair has become partly white. Vivien can call forth spirit creatures with her Arkbow , by firing arrows at her foes. She is also able to enlarge living animals to enormous sizes. Her mission is to destroy the cancer of civilization and restore the natural order to the Multiverse . She has seen a great many forests and can identify poisonous and nutritious plants by their magical aura. She has not forgotten her home, however, and takes swift action against those who would see other worlds meet the same fate as her own. To Vivien, we are all part of the natural world and must find our place in it, or minimize our damage to it. And for those who threaten the delicate balance, the Arkbow will deal out justice. Vivien Reid's center is in green mana. When she planeswalks, she disappears in a burst of ghostly green light. Vivien Reid Vivien's homeworld was deeply divided between the forest dwellers Smaragdi , a tribe of rangers and druids sworn to protect the forest, and the Nura , an advanced civilization that encircled the dwindling woodlands. With the Nura's expansion constantly encroaching, the Smaragdi, to which Vivien belonged, were fighting a losing battle against the soldiers of progress. Nicol Bolas took an interest in the Nura. After plundering them for their secrets, Bolas decided the plane was of no more use to him and began to destroy it. In desperation, the Nura fled to the forest, but by then, there was no safe place to hide. Sensing that their doom was imminent, the Nura and Smaragdi combined their collective magic into a unique artifact , the Arkbow , which contained an invocation of every creature that had ever lived on Skalla. They planned to use the Arkbow as a last stand against Nicol Bolas, but as the forest erupted into flames and the battle was lost, Vivien's spark ignited , planeswalking her and the Arkbow to safety. In her early days as a Planeswalker, Vivien struggled to understand the Arkbow, which seemed to have a life of its own. At first, the creatures called through the bow were weakly incorporeal – ferocious but dim, ghostly versions of themselves. But as Vivien traveled to new planes, encountered new creatures, and added them to her menagerie, the Arkbow grew in power. Soon she could call the magical spirit forms of creatures from myriad planes, beasts greater than anything that had ever lived on Skalla. Vivien's Invocation. Attracted by the fame of all the animals in the Royal Menagerie of Luneau , Vivien visited Ixalan . To her disappointment, she found the animals to be malnourished and regularly tortured. After the Baron of Vernot hurt a monstrosaur for the entertainment of the Perfumed Court, Vivien couldn't resist her revulsion and intervened by firing spirit animals at the court. This resulted in her capture by the Baron. The Baron tortured her to find out the secret of the Arkbow. Although he didn't succeed in this, he did discover Vivien's planeswalker nature. Managing to escape, Vivien killed the Baron by firing the spirit of the monstrosaur at him. After this she unleashed all the living animals of the Menagerie and magically enlarged them, effectively destroying Luneau and killing or driving off all its citizens. Vivien was lured to Ravnica by the Interplanar Beacon , and immediately became trapped there due to Bolas 's use of the Immortal Sun . Alongside many other planeswalkers and Ravnicans, she fought against the Eternals of Bolas' Dreadhorde . For her, the war was personal: Seeking revenge for Skalla's destruction, she hoped to personally kill Bolas. Vivien Ikoria Comic-art Style During the invasion, the trapped planeswalkers got together with Ravnican leaders to strategize. When some of the Ravnicans proposed surrendering to Bolas to prevent further destruction, Vivien and Samut insisted that surrender was not an option; given what Bolas did to their home planes, they knew that Bolas would conquer or destroy Ravnica simply for his satisfaction, even if he got what he wanted. At Jace's recommendation, they decided to split up into teams to focus on specific tasks. Jace, Jaya, Teferi, and Vivien volunteered to assassinate Liliana. When they found her, Teferi warped time around her, slowing her ability to react, defend herself, or strike back at her attackers. This allowed Jaya and Vivien to badly wound her with fire, arrows, and animal spirits, although the Onakke spirits in Liliana's Chain Veil protected her. Nonetheless, they almost succeeded, but Bolas stepped in and saved Liliana by destroying the buildings they were standing on. Fortunately, Teferi saved himself and the other three planeswalkers by slowing their falls. Vivien was one of the few planeswalkers who chose to remain on Ravnica after Chandra disabled the Immortal Sun, helping the Gatewatch in their fight against Bolas. She survived the battle and was present during the Planewide Celebration that followed. While talking with the Gatewatch, she said that she considered Liliana to be another potential threat to the multiverse, and thus another enemy for the team to defeat. Vivien assisted Vraska in tracking Dovin Baan to Kaladesh but later lost his trail. With Bolas's apparent death, Vivien has returned to her embrace of the natural world. Her expeditions have taken her across The Multiverse to explore and learn about new ecosystems. Ever since the War of the Spark, Vivien contemplated what it means to have a spark. She thinks that planeswalkers must use it wisely, and currently searching for meaning in that. Vivien and the Bonders help defend Drannith. Vivien traveled to Ikoria to research its population of unique and incredible monsters. She also chooses that destination, because she feared that another planeswalker had gone there as well. She hadn't known him long, but she knew it was his nature to meddle. After sensing some weird magic and investigating it, she happened upon the recently bonded Coppercoat Lukka and scared off his pursuers. Upon further investigation, a big crystal formation called the Ozolith turned out to be the source of the recent bondings, mutations, and attacks by monsters. A voice, an urge, seemed to force monsters to attack Drannith . Vivien feared that this was all the unnamed planeswalker's doing. After finding some other bonders, they all traveled to the Ozolith. A three-way battle ensued between them, the pursuing hunters and pirates, and the Nightmares guarding the Ozolith. After Lukka connected his mind to the crystal, he talked to whoever was using the crystal for nefarious purposes. They implied they were from a different plane and decided to help Lukka and let him use the Ozolith's power to win the battle. After this, Lukka decided to use this newfound power to control monsters for the sake of Drannith. The bonders and Vivien weren't happy with this idea, as they saw animals as friends, not slaves. Eventually, this got to the point where Lukka decided to take control of the bonders' monsters. Vivien tried to fight him but had to flee with the bonders while Lukka went mad with power. Vivien and the bonders changed sides when Jirina Kudro took control of Drannith 's defenses, agreeing to fight against Lukka's army of monsters. In the fight, once things started to turn against Lukka, he overloaded the Ozolith's power and caused it to explode. This caused his planeswalker's spark to ignite and he planeswalked away. In New Capenna . Vivien wants to honor the lessons of her homeworld. The last survivor of Skalla, a plane where advocates of progress and guardians of nature failed to find balance, Vivien works tirelessly to ensure that her people's mistakes are not repeated elsewhere in the Multiverse. She is a conservationist and keen observer of nature who cultivates healthier civilizations by sharing lessons from the natural world. She hopes that, by fostering in others the sense of wonder and respect that she feels for nature, she can preserve the beautiful diversity of life in the Multiverse and honor the memory of her lost world. At some point after the events on Ikoria, Vivien found her way to New Capenna , hoping to find a place where technology and nature could coexist in harmony. She was aghast to discover that New Capenna's plane is devoid of life, except for the metropolis, whose greenery was found unpleasantly artificial by the planeswalker. Vivien met Tezzeret , who claimed to work for Urabrask , the red-aligned Praetor of New Phyrexia. Vivien then left with Tezzeret to meet Urabrask. Tezzeret brought Vivien below the city, to where the enormous girders supporting New Capenna were fixed to a plateau. There, she met a severely wounded Urabrask who informed her of his plans to fight against Elesh Norn and his need for both Halo and Elspeth Tirel , who he claimed is feared by Norn. Later, Vivien met with an Obscura spy who she knew only as \"Navy,\" who gave her leads regarding Elspeth. Fearing Vivien knew too much about her secret employer, the Adversary, Navy attacked Vivien but was defeated. Vivien claimed Navy's notebook, which she used to learn more details of Elspeth's movements. Meeting Elspeth but being unable to communicate with her for long, Vivien returned to Urabrask who tasked her with meeting Elspeth at the Crescendo . On the night of the Crescendo, the Adversary activated his agents, attacking the attendees and the families across the city. Vivien arrived at the venue in time to rescue Elspeth and her companion Giada , and the three escaped to an abandoned warehouse. After the riots had subsided and Nixilis had been subdued, she and Elspeth entered Xander 's archives to learn the history of the plane and its fight against the Phyrexians . Armed with new knowledge, the pair planeswalked to Dominaria to inform the Gatewatch of their findings. Vivien was recruited by the Gatewatch to join the fight against the Phyrexians. She brought Elspeth to Dominaria before making her way to Ravnica to update Jace on the situation. Afterward, she returned to Ikoria to marshal a defense there. Vivien wasn't part of the planeswalker strike force that set out to destroy Realmbreaker on New Phyrexia . Together with Wrenn , Chandra , and Liliana , she took refuge in one of the latter's cabins on Dominaria and anxiously awaited the return of the team. When the survivors returned, they were devastated to learn what had happened. When New Phyrexia's Invasion of the Multiverse started, Vivien travelled to Ikoria to assist Jirina Kudro and Chevill in its defense. With many wounded unable to outpace the monstrosity Lukka had formed, Jirina led them to Vadrok 's lair, where Vadrok made short work of Lukka's flesh-titan and ripped him from it. She finished the apex monster's work, planting three spectral arrows in Lukka's chest. Vivien is the primary protagonist of the trailer for Ikoria: Lair of Behemoths and appears in the Magic SpellSlingers trailer. She is considered an incredible cook. The Arkbow Associated cards: Depicted in: Quoted or referred to:"}