{"text": "Vraska ( Phyrexian : lreLhFD , IPA : [vraskəʔ] ) is a black and green -aligned gorgon phyrexian planeswalker assassin from Ravnica . She was part of a mercenary organization known as \"the Assassins of the Ochran.\" Later she became the Queen of the Golgari Swarm . On Ixalan , she is known as Captain Vraska . She was compleated during the events of Phyrexia: All Will Be One . Vraska is a striking, green-scaled woman with long, black snake -like hair tendrils. She has narrow features and bright yellow eyes with a petrifying gaze. Like all gorgons, she likes to collect trophies. Her eyes shine golden when she uses her power to turn her victims to stone. After her compleation, Vraska grew a long, curved, scorpion-like barbed tail. Her tendrils hardened to wire and coils. Vraska used to be a sadistic and efficient killer, an assassin of the Ochran. She resented the order of the Azorius, thanks to her upbringing, and the world around her. To fulfill her ambitions of becoming guildmaster and restore equality within the Golgari, she aligned herself with Nicol Bolas . Caring not for her actions, she only began to see that there was still something worth cherishing within life upon being trapped on Ixalan alongside Jace Beleren . At first, attempting to manipulate Jace, she soon found herself admiring his honesty and his unbiased view of the world around him. By the time their journey came to an end, she looked back on her past actions with a different view and found herself longing for the mind mage's companionship. After the War of the Spark , she more openly works with others, even showing a moment of affection by sharing a kiss with Jace. Vraska is primarily centered in black and secondary in green . When she planeswalks, she fades into shadow. Vraska's life had been fairly simple in the Undercity , on the fringes of the Golgari Swarm . However, on a world such as Ravnica, even a simple life can be destroyed by politics. Vraska was seventeen when the Azorius Senate decided that the Golgari had grown too powerful, too numerous, and needed to be pushed out of certain areas they'd claimed. Isperia , then a high-ranking Azorius judge, issued a writ of a mass arrest for any people caught bearing allegiance to the Golgari. Vraska was amongst those apprehended, and they were taken to an Azorius detention compound, the place where all victims of the writ had been imprisoned. Vraska was kept blindfolded with broken ribs in standing water for weeks, only able to listen as another gorgon, Ludmilla , was blinded and killed. The cells quickly filled beyond capacity, and, vastly outnumbered by their prisoners, the Azorius guards were swept under the tide of a prison riot. These events became known as the Duskend Purges . Vraska and her fellow inmates found themselves quickly ferried away to a secure location while much of the riot continued, but in the tight confines of the basement, they were trapped. Hours passed and tensions grew thick, the guards becoming nervous and abusive. Soon enough, the prisoners had taken enough from their callous jailors. Many of the Golgari captives worked together and freed Vraska, but realizing the threat, the guards quickly turned their attention to her. She was severely beaten and lay near death when her planeswalker's spark ignited , threw her away from the world she knew. She woke up in a swamp on a dark plane, with half her ribs broken and no idea where she was. She lay in the darkness, unable to understand what had happened, and much time passed before she learned to control her abilities. Vraska's Petrifying Stare Two years after her disappearance, she returned to Ravnica. In her travels, she had learned an important lesson, a creed by which to live her life. \"A person should die the death they deserve.\" She began gathering followers in her quest to bring justice to those she felt deserved her retribution. Many died in her name, all deaths thematically linked to how they lived their lives. Amongst her many victims and those of her followers, there was always a special place for the Azorius. Slowly, she sought justice against those who had a hand in the riot, the guards, the arbiters, and any who were connected to it in any way. In between her missions of bloody vengeance, she has become something of a shadowy urban legend amongst the Golgari. She only surfaces when something stirs her interest, the exact reasoning a mystery to all involved. She chooses her missions carefully and stays well away from guild politics. Her activities have begun to gain notoriety even outside the undercity and her targets die swiftly once she commits herself. After her mission is completed, she disappears back into the aether, taking her expertise to other planes to gain experience and add to her ever-growing collection of trophies. Vraska attempted to force Jace Beleren into her service. She gathered citizens of Ravnica whose names would be known only to a planeswalker and arranged them to spell Jace's name. It forced him into a confrontation with the assassin and she used various threats and attempts at coercion to bring him under her sway. Jace ultimately escaped her clutches and shone a light onto her existence, possibly undoing everything she'd tried to accomplish. It is unclear if she can ever return to the shadows now. At this time, she contacted the disenfranchised among the Golgari, to rally them against Jarad and his elves. She found willing allies in the Kraul , who delved into darker necromancies to unearth the Erstwhile in their hidden catacombs beneath the Undercity. Captain Vraska An agent of Bolas placed a note in the House of Ochran that invited Vraska to the Meditation Plane . Here, Nicol Bolas offered to make her the guildmaster of the Golgari and bring those to justice that preyed on the downtrodden, if she would travel to Ixalan and deliver the item stored in the Golden City of Orazca to one of his agents. To aid her in this, Bolas gifted Vraska with a Thaumatic Compass and the knowledge of sailing. On Ixalan, Vraska posed as a member of the Brazen Coalition , serving Lord Nicolas . Assembling her crew and her ship named The Belligerent , she turned out to be a very democratic leader, which earned her a great deal of respect and admiration from her crew. Vraska obtains the Immortal Sun for Bolas. Guided by the compass, her ship found the shipwrecked Jace in the sea. Seeing that he had no memory of who he was, she spared him. Using his powers as an illusionist, she plundered ships of the Legion of Dusk . Slowly, Vraska and Jace began to develop a new relationship, based on a sense of respect and attraction. After The Golden City revealed itself, Vraska and Jace fell in its churning waters. To Vraska's horror, the shock caused Jace's memories to return, his telepathic powers causing her to witness every single memory that returned to him. Vraska was filled with fear that Jace's memories would reignite their enmity, but Jace instead forgave Vraska for her past transgressions against him. Their friendship even stronger, they struggled on to Orazca, where they unexpectedly were confronted by a legend of their own home plane: Azor, the Lawbringer . Vraska witnessed how Jace used his power as the Living Guildpact to banish the Sphinx to Useless Island. Realizing that Nicol Bolas would learn about her love for Jace if he would read her mind, Vraska asked Jace to remove all her memories of him. Jace implanted a trigger to reinstall her memories at the right moment, planning to defeat Bolas together. After this, Vraska summoned Tezzeret , who removed the Immortal Sun from the plane, using his Planar Bridge . Having removed the planar barrier , Vraska planeswalked away. In Bolas' Meditation Plane, the dragon read her mind and witnessed the false memory created by Jace, in which Vraska had found Azor and turned him, along with all her challengers, into gold using the power of the Sun. Pleased, the dragon called her \"Guildleader Vraska\" and rewarded her with the information where Jarad was to be found. As Vraska set out to petrify Jarad, she couldn't help but feel that both she and Bolas missed something very important during their meeting. Guildmaster. Back on Ravnica, Vraska killed Jarad and established herself as guildmaster . She was helped by the Erstwhile (which are more durable and intelligent than regular Golgari rot zombies ), and the Kraul . Meanwhile, The Devkarin was bitter about this and were wanting the current Matka , Izoni to take over. The kraul Xeddick , who was a telepath, found out about Jace's mind block and removed it at her request. She now remembered Ixalan , her friendship with Jace, and her newfound righteousness. She also realized that Bolas was planning to invade Ravnica with his Eternal army, and decided to attend the guild summit . To prove herself, she pledged her guild to attack the Orzhov Syndicate , to change its leadership. With Ral Zarek and the Rakdos emissary Hekara she led an army of rot zombies, trolls, and giant insects into Orzhova as a distraction, allowing Kaya to kill the Obzedat . Though she had been sincere when she had approached Ral Zarek and Kaya to volunteer her services, she ultimately betrayed them. This happened after she was met by a Devkarin elf who turned out to be possessed by Bolas. Bolas noted that Vraska has deviated from her assigned role by helping Ral Zarek. He threatened to turn the Erstwhile against the Golgari , creating death and chaos for her people. Bolas then forced her to make a choice, for or against him. While making the choice, Vraska felt guilty toward her friend Jace . Vraska killed Isperia after the guild summit as payback for the suffering of her youth. After that, she continued to fight for Bolas because she was worried that she would be deposed as Golgari's guildmaster without his help. During a confrontation with Ral Zarek and Aurelia, she only managed to escape at the cost of Xeddick 's life. Later, Bolas orders Vraska to kill Ral after his great machine fails and to disrupt his backup plan. Vraska's betrayal led to the Rakdos emissary Hekara being killed by a Bolas-possessed Lavinia . In the same fight, Vraska proved no match for the fully-powered Ral Zarek and barely escaped getting killed by planeswalking away. Vraska had planeswalked to Ixalan to escape from being killed by Ral Zarek for betraying their group. As a result, she was not present on Ravnica when Bolas' invasion began. However, she worried that the Golgari Swarm would fall apart without her, and she eventually decided to return to Ravnica out of concern for her people. Vraska leads the Golgari against Bolas. Upon returning home, she encountered Ral and Kaya in the Undercity , where they were trying to convince the other Golgari leaders to support their cause. Despite Ral and Kaya's suspicion of the gorgon , Vraska united the Golgari once again and pledged the guild to the fight against Bolas. With the help of Ajani and his team of planeswalkers, they were able to evacuate many civilians to the tunnels beneath the city, where they would be safe from the Dreadhorde. After that, Vraska, Ral, Kaya, Teyo, and Araithia journeyed to Rix Maadi to negotiate with Rakdos . The demon lord was initially hostile due to the death of his emissary Hekara , and the blood witch Exava ordered the group to leave. However, the Orzhov representative Tomik showed up with Hekara's corpse, and the Rakdos cultists resurrected Hekara as a blood witch. After defeating Exava in a fight, Hekara used her newfound authority as a blood witch to lead the Rakdos against Bolas. Once all ten guilds were on board, Nissa performed a ritual at the ruins of the Guildpact Chamber: with the help of a representative from each guild, she was able to repair the leylines that empowered the Living Guildpact (which had been disrupted when Bolas destroyed the Guildpact Chamber by opening his portal there). Vraska served as the representative for the Golgari Swarm. Using a device that Niv-Mizzet had constructed before his death to preserve his consciousness, they were able to resurrect Niv and grant the power of the Living Guildpact to him. Niv came back to life just in time to save the others from the God -Eternal Kefnet : using his newfound power, Niv was able to completely incinerate Kefnet in a torrent of flame, although the strain of channeling enough energy to kill a god caused him to fall unconscious. Later, Jace reunited with Vraska. He tried to restore her memories, only to find that they'd already been restored by Xeddick . Vraska confessed that even though she was fully aware of the threat Bolas posed, she still murdered Isperia in a fit of rage, despite knowing that it would help further Bolas' plans. Jace forgave her and promised to get together with her if they made it out of the war alive. Vraska survived the battle and was present during the Planewide Celebration that followed, where she and Jace finally shared a kiss. Later, she was confronted by Niv-Mizzet and the other guildmasters (with Tomik now representing the Orzhov Syndicate in Kaya's place). They decided to spare the planeswalkers who formerly worked with Bolas but defected before the battle, on the condition that they make amends by hunting down the planeswalkers who stayed loyal to Bolas or defected too late. As her penance, Vraska was assigned the task of capturing Dovin Baan. By command of the new Living Guildpact, who feared his interference, Jace had to be kept out of the loop concerning the assignment. Vraska's lying, and the ultimate choice for the Golgari, resulted in them growing apart again. Although Vraska was still guildmaster of the Golgari Swarm, during her absence her position was contested. The elf shaman Cevraya , the Devkarin Izoni , the troll Varolz , the kraul Azdomas , and the Erstwhile leader Storrev all claimed to have a right to the title. After being blinded by Lazav, Dovin Baan planeswalked to his home on Kaladesh but soon returned to his safe house on Ravnica . There he was discovered by Vraska, and in exchange for his life, Baan offered to help her retain control over the Golgari . Vraska accepted the offer and Baan helped her frame Izoni for a crime that she didn't commit. Together they also plotted to fake Baan's death. Using a statue replica of himself, a fight was staged in Zinara on Regatha with Chandra Nalaar being an unsuspecting accomplice. During the fight, Vraska severed Baan's right hand to use as proof of a kill while Chandra believed she had delivered the killing blow. The plan succeeded and Baan returned to Ravnica, only to be assassinated by Atkos Tarr who had been sent by Lazav in his plans to blackmail Vraska. Vraska is now in control of the Golgari again, but in turn, is controlled by Lazav who will make her failure to kill Baan known to the Living Guildpact if she doesn't comply with his wishes. Vraska joined with Jace, the Gatewatch , and other assembled planeswalkers to support the Mirrans ' efforts against Elesh Norn on New Phyrexia . However, when they traveled to New Phyrexia, she was caught by the Phyrexians and forced to fight in Sheoldred's Coliseum . A compleated Vraska injecting Jace with Glistening oil When her teammates reached Vraska, they found she was heavily wounded and already infected with Phyresis . Too late to save her, Jace chose to stay behind with her and relive their happy moments on Ravnica in their minds. Lingering too long, Vraska succumbed to the Phyrexian influence and infected Jace in turn. Now compleated, Vraska's body became fully altered. Metallic markings stretch across her face and upper body, her snake-like hair has transformed into segmented cables with sharp edges, her fingers grew longer and now look skeletal, and her entire lower body became long and serpentine, connected to a long tail ending with a scorpion-like stinger that injects glistening oil. Vraska led the invasion of Ravnica, using the opportunity to enact a personal vengeance for the Azorius's imprisonment of the Golgari. Many of the Golgari submitted to compleation given her status as guildmaster. As retribution for Ludmilla's blinding during the Duskend Purges, she instructed her forces blind the Ravnicans, who then scrabbled upon the glistening oil-slicked streets. However, Jace's mental partition persisted and her pre-compleation self still bubbled through with emotions and nostalgia, subconsciously leading her through her and Jace's Ravnican living spaces. Ral Zarek was able to disable Vraska's body with a sonic device that neutralized glistening oil , resulting in an ambiguous meeting of Vraska's mind with some psychic image of Jace. This image of Jace called her \"Captain\" - the mental trigger that Jace programmed into her mind on Ixalan as a way to restore her memories - and it appeared to affect her mind. Reports from Ravnica that reached Ajani Goldmane suggested that she was dead, though her body was  never found. In the video game Magic: The Gathering Arena , Vraska is voiced by Katy Townsend. Vraska appears in the Phyrexia: All Will Be One trailer. Vraska received the Thaumatic Compass from Bolas , which she used to find the Immortal Sun on Ixalan . The compass is dull silver, a series of stacks of circles and etchings, with one long point extending from an empty ring on its side. She remains in possession of the compass after returning to Ravnica . On Ixalan, Vraska obtains and uses a cutlass which she later takes to Ravnica. Collecting keepsakes from her travels, she has a Locthwain banner, a Theran pot, a Kaldheimr drinking horn, and a Segovian chariot in her Ravnican apartment. Associated cards: Depicted in: Quoted or referred to:"}