{"text": "Lord Windgrace was a panther warrior planeswalker from Urborg on Dominaria . He was one of the Nine Titans that Urza gathered to fight Phyrexia . After his death, he became a protective Avatar of Urborg. Windgrace had a distaste, maybe even an outright hatred, for anything artifice. This stemmed partially from his time spent with Urza, seeing the man's creations as somewhat destructive, and from his time spent fighting the Phyrexians. He cared deeply for his homeland of Urborg, going as far as to watch over it after his death. Windgrace had access to black , red , and green mana. Windgrace hates artifacts. Windgrace began his rise to fame at age twelve. He claimed to have been the warrior chief of his tribe. He was older than Urza, since he remembered Urborg being a forest before it was submerged by the Sylex Blast . Seeing his entire world devastated by the detonation of a magical device instilled in him a hatred for artifacts. He was described by Teferi as the \"panther king of Urborg \" and it was told that the panthers ruled Urborg in peace for three centuries before the Brother's War. He was worshiped by many different catfolk on Dominaria over the years. Windgrace was one of the eight other planeswalkers Urza recruited for the war with Phyrexia. When Urza went mad and killed Taysir , Windgrace took the fallen planeswalker's heart and put it next to his own. Windgrace survived the Phyrexian Invasion and became a leader and guardian of Urborg. During the Time Spiral crisis , Windgrace had control over the zone's slivers and other monstrosities, which he commanded to destroy anyone and anything even remotely related to artifice . During the events of Planar Chaos , Windgrace put his mark on Venser, to control him anytime, but the Weaver King removed it so that he could control Venser without getting noticed by the ancient planeswalker. Later he talked to Freyalise about the time rifts and he was grieved when he heard of her death. After Teferi and Karn's insistence, he attempted to seal the time rift in Urborg located where the Rathi Stronghold had overlaid to prevent a mass of Phyrexians from pouring in. As the rift began to fold in on itself under Windgrace's magic, it sucked the life essence from him. As the rift vanished from existence, so too did Lord Windgrace. Urborg's protector. Before facing the rift, he performed a spell to fuse his spirit to Urborg and watch over it. Long after Windgrace's sacrifice, his followers remain on Urborg, sabotaging the Cabal 's artifacts. Aryel is from Urborg and trained with the panther-folk, bearing Windgrace's legacy. With the return of the Phyrexians , Windgrace's magic stirred, ready to protect Urborg once more. Dominaria Phyrexia Associated cards: Depicted in: Quoted or referred to: Magic Arcana (September 3, 2009). \" Who's That Planeswalker? \". magicthegathering.com . Wizards of the Coast."}