{"text": "The World Tree of Kaldheim was the binding element of the Ten Realms of that plane. It is located in the Cosmos . It was intentionally burned by the denizens of Kaldheim as part of New Phyrexia's Invasion of the Multiverse , and is slowly regrowing. Esika is the god of the World Tree. The World Tree was the origin of all life on Kaldheim, and you could see the branches in the sky in all ten realms. However, they looked different in each realm. The realms constantly shifted and moved around the World Tree and can even collide. Such an event is called a \" doomskar \" and causes earthquakes, destabilization, and chaos. The realms and the World Tree acted like a microcosm of the Multiverse and the Blind Eternities , as the realms require certain abilities to traverse between, akin to planeswalking. That said, planeswalking itself does not work to travel from one of Kaldheim's realms to another. The light of Starnheim shines atop the highest branches of the World Tree. The skoti use a highly magical substance called Tyrite that is derived from the \"sap\" of the World Tree. Tyrite looks like the aurora-like lights of the Cosmos given solid form. While the gods may handle it safely, direct contact with Tyrite is quite dangerous for mortals. Esika makes a \"Cosmos Elixir\" from Tyrite, that slows the Skoti 's aging and maintains their supernatural powers. Because of this elixir, the Skoti's skin or other aspects of their appearance show the influence of the aurora lights. Vorinclex took a sample of tyrite during his exploits on Kaldheim . As the physical manifestation of plane-binding material, tyrite has the potential application to forcibly link planes, which New Phyrexia plans to accomplish with the Realmbreaker . During New Phyrexia's Invasion of the Multiverse , the World Tree was burned down by Kaldheim's inhabitants to keep it out of Phyrexia's grasp. It is now regrowing, enough to reconnect some of Kaldheim's realms. The World Tree is inspired by Yggdrasil the World Tree of ancient Nordic mythology. Tyrite's name is derived from the Norse God, Tyr . Valla used to be a realm within the World Tree, before splitting off into its plane. Associated cards: Depicted in: Referred to:"}