{"text": "Wurm is a creature type describing large limbless terrestrial reptiles . These wurms have an endoskeleton, reptilian scales or plates, and a saurian head similar to a dragon 's. They may be aligned with any color of Magic , but most are wholly or partially green . Over the years and sets Wurms have evolved in Magic into more of giant Worms . Most wurms are forest dwellers. They are preternaturally hungry and relentless when pursuing their prey. Dominarian Wurms trace their origin to the Elder Dragon War , during which the vastly powerful Elder Dragons that were defeated were stripped of their power, limbs, and wings, thereby becoming the Elder Land Wurms . Plane Shift describes Innistradi wurms as manifestations of green mana. Wurms can be found on many planes. So far, Wurms are known from: Wurms from different planes can have vastly different morphologies, especially in their head and jaw anatomies. A few types of wurms are found in multiple planes. Craw Wurms are so-called for their snakelike neck. They are one of the more common types of wurms. These wurms have more pronounced heads than other wurms, and usually have horns or frills at the back of the head. One was summoned by the Kieryn Elves while fighting against the Calthyn Elves in the White Woods of Corondor . Also, corpses of four such wurms were found at the site of the last great battle of the Ironclaw Orcs . Craw wurms live in forests and have dark green scales that provide camouflage when resting. When they pursue prey, they make a loud crashing sound. This sound echoes off nearby trees, seeming to come from everywhere at once, which confuses and terrifies the prey. Argothian Wurm (Dominaria) Barbtooth Wurm (Dominaria) Boneyard Wurm (Innistrad) Deathcoil Wurm (Dominaria) Endless Wurm (Dominaria) Fallow Wurm (Dominaria) Harvest Wurm (Dominaria) Jungle Wurm (Dominaria) Mungha Wurm (Dominaria) Plated Wurm (Dominaria) Pouncing Wurm (Dominaria) Scaled Wurm (Dominaria) Shivan Wurm (Dominaria) Warping Wurm (Dominaria) Wild Wurm (Rath) Winding Wurm (Dominaria) It is said scaled wurms embody the worst of the Ice Age on Dominaria . They also existed on the plane of Dominaria outside the Ice Age period. A very large-scaled wurm known as Rhindle terrorized Kjeldor during the last few decades of the Ice Age. Scaled wurms have long, sinuous bodies, with an angular head, similar to that of a dragon. The neck is protected by several long, thin horns protruding from the back of the head. Many smaller spikes protrude from the wurm's jaw. Their bodies are protected by bright green scales—it was said that just one of their scales could be used as a roof for a human dwelling. The mouth is protected by a beak-like formation of bone, which allows the wurm to rip its prey apart before eating it. The boneyard wurms of Innistrad feed on corpses wherever they can be found. They are capable of eating meat that would be too rotten for almost anything else to digest; they would rip rotting corpses out of graveyards, strip the body of meat, and leave a pile behind. Boneyard wurms get their name from the fields of excavated bones that they make near graveyards. Physically, the boneyard wurm is long and slender, with an angular, horned head. Their size varied considerably because those that lived near graveyards were far larger than those that had to live off of dead creatures in the wild.\nThe Phantom Wurm (found in Dominaria) is the spirit of a craw wurm, and the Waning Wurm , observed during the Planar Chaos , was a zombified craw wurm that got caught in a time rift . Sandwurms are flat with large scales on top and bottom. Their head resembles that of a crocodile. Sandwurms are adapted to be able to easily bury themselves in the sand or move atop without sinking. Greater Sandwurm (Amonkhet & Ikoria) Saltskitter (Dominaria) Sifter Wurm (Amonkhet) The sandwurms of Amonkhet have wider heads that are upside-down, with the eyes on the bottom. The floor and roof of the mouth are lined with rows of teeth reaching at least as far as the throat. Their only known predator is the Chaos Maw , a hellion. The common Greater Sandwurm is white, and some of them have bioluminescent blue spots on their bellies, possibly an indicator of sexual dimorphism. They bury themselves beneath the desert dunes, lurking in wait for vibrations that indicate prey is nearby. They can go for years without food, though since they do so under dunes of sand, the dunes may provide a substrate. On rare occasions, such as when hungry or mating, these highly territorial sandwurms may meet in a Sandwurm Convergence . They defend their territory from wandering sandwurms by exhausting their food supply, including the birds flying overhead, thereby forcing the hungry invader to move on. The smaller, uncommon Sifter Wurm is iridescent green. When the Hekma was destroyed, its kind invaded the temple of Rhonas and drove the citizens away. Slagwurms burrow underground. They are often protected by armor that covers the upper part of their head and neck. Gravetiller Wurm (Innistrad) Havenwood Wurm (Dominaria) Pathbreaker Wurm (Innistrad) Penumbra Wurm (Dominaria) Plated Slagwurm (Mirrodin) Soul Swallower (Innistrad) The gravetiller wurm is a species that had not been seen on Innistrad before the rise of demons. It has been described as a malevolent, primordial force that came \"as though waking to watch the slaughter [of the Innistrad humans].\" Gravetillers were so-called because they thrived on bodies that had recently died. They would look for fresh graves, tear the bodies out of the ground, and feed on them. Similar to boneyard wurms, gravetillers were far larger in areas with many deaths. The pathbreaker wurm, unlike the gravetiller wurm, did not specifically eat bodies. Pathbreaker wurms were fairly common across Innistrad, often dwelling in forests. Pathbreaker wurms were less malevolent and feared than the other Innistrad wurms. Some inhabitants of the plane learned to ride the wurms, using them as massive weapons against demons and other dark forces. Pathbreaker wurms had heavily armored heads, with no visible eyes. The armor allowed the pathbreaker wurm to act as a living battering ram, and their riders could use them to trample enemies. The soul swallower is arguably Innistrad's most powerful species of wurm. They have soft, purplish bodies that are protected by dark, smooth plates that resemble stone. Soul swallowers have no visible eyes, but they are still able to sense prey. Their teeth are long and flat, which allows them to cut their prey up inside their mouth. The soul swallower's most unique characteristic, however, is the plethora of ethereal arms that constantly reach out of its mouth. These are the spirits of those whom the soul swallower has devoured. They are used to fuel the wurm's insatiable hunger. Soul swallowers will eat as many animals and people as they can, to become more powerful. Upon Alara , the wurms occupy the lower reaches of Jund where they displayed a behavior more akin to dragons than normal.\nAfter the Conflux , the wurms were pressed into the service of Bant as living siege engines. Charnelhoard Wurm Jund's most powerful wurms are known as charnelhoard wurms. These wurms are covered in countless spikes to ward off enemies. A charnelhoard wurm's head is similar to a dragon's with an angular skull and similar placement of the eyes and mouth. Charnelhoard wurms will eat anything they can, and keep a hoard of rotting corpses that they eat whenever they are hungry—this tendency is what earns their name. These wurms are powerful opponents and can grow to a size that is larger than some dragons. Gorger Wurm Another type of Alaran wurm is the gorger wurm. These originated in Jund but appeared all over Alara after the Conflux. Gorger wurms are not as large as charnelhoard wurms and are far more common. They are called gorger wurms because of their huge appetite; the more they eat, the larger and more powerful they become. They have long, thin bodies with a rust-like coloration. Large bone plates protect their heads. They have several rows of small, vestigial legs next to their head. The legs serve little purpose, except to help drag them across the ground. After the Conflux, Bant enlisted gorger wurms to use in battle ( Enlisted Wurm ). Artificial Wurms [ | ] The Henge Guardian is a winged artificial dragon-wurm. Once a powerful siege engine, it was turned loose into the wild where it continues operating. Deathwurms [ | ] Under the Nightmare spell of Ixidor , Phage 's unique constitution made it so that she regurgitated a swarm of beetles , which then became enormous wurms. These deathwurms were the embodiment of each of her murders. Ixidor sent Akroma to battle them but not even the angel was able to stop them. Ixidor was forced to use his unmen to escape, but some of them betrayed him and he was devoured. On the battlefield, Jeska saw that the wurms were wreaking untold havoc, and realized that she had to absorb them back in herself, even though that meant she would become Phage again. Elder land wurms [ | ] Elder Land Wurms are creatures of immense power that are the descendants of the original Elder Dragons . During the Elder Dragon War , the surviving victors of the war went on the spawn the races of the dragons , drakes , and viashino . The losers of the war, the Elder Land Wurms, were stripped of their power and even their limbs. These beasts might have been stripped of most of their power, but they are still fearsome opponents. A thigh bone of one such creature was found – along with four dead Craw Wurms and a Craw Giant Chieftain – at the site of the supposed last battle of the Ironclaw Orcs . Elder Land Wurms have the bodies, heads, and tails of dragons, but their limbs and wings are missing. They have small, vestigial limbs that replaced their wings. Elder Land Wurms often lie dormant; they sleep a lot because their immense bodies require a huge amount of food. Elder Land Wurm Nesting Wurm Grub Wurms [ | ] Grub Wurms are large, grublike wurms with mouths full of teeth. Arrogant Wurm Johtull Wurm Johtull Wurms appeared on Terisiare during the Ice Age . One of them killed Zilgeth of Clan Ruby . Johtull Wurms are huge, but they are not very maneuverable; when attacked by a group of enemies, they can be defeated more easily. The Johtull Wurm is commonly confused with the Arctic Fungusaur . Radial Wurms [ | ] The Reckless Wurm resembles a hellion more so than other wurms do. This wurm was introduced to Dominaria during the time rift in Planar Chaos . Riftwums [ | ] The Ravaging Riftwurm is similar to a craw wurm, but is highly ornamented with bone protrusions along its body and has a very strange lower jaw ornament. Scoria wurms [ | ] Scoria wurms are huge creatures that live in the volcanic rivers under Shiv . The average Scoria wurm has three sets of jaws., each of which has a row of small, sharp teeth. Scoria wurms can produce a loud ululating sound, which is likely because of their multiple sets of jaws. A Scoria wurm's interior glows with a fiery light. It is unknown whether this is because of internal fire, or if the Scoria wurm is bio-luminescent on the inside. The Scoria wurm's body is long, flexible, and sinuous, covered by a layer of dark blue scales. The body has long lines along the side that glow red. Scoria wurms are very strong, but their behavior is unpredictable—while fighting with other creatures, they may flee at random. So far, this erratic behavior has not been identified and remains a mystery. Spined Wurms [ | ] Spined wurms have segmented wormlike bodies and reptilian heads. Spined Wurm Thundering Wurm Whiptail Wurm Tusked wurms [ | ] Tusked wurms are grublike wurms with tusks on their jaws. Barbed-Back Wurm Carrion Wurm Metamorphic Wurm Panglacial Wurm Tempting Wurm Trench Wurm Tunneler Wurm Symbiotic Wurm The trench wurm is so-called because of its use by Yawgmoth: they would devour the land, creating vast fields of trenches to deter enemy forces. They could also eat the ground around enemy command bases and cities, undermining them so they would fall apart. As these wurms do not look typically Phyrexian , but they were nonetheless deployed in the battle at the Caves of Koilos , it is possible that these were transplanted by Yawgmoth from another plane. Water wurms [ | ] These creatures seem very out of place among the other wurms, for they are the blue wurms and are very small compared to the others. Likely, they are just misnamed worms . Water wurms were common in the seas of Dominaria, especially around the time of the Dark Age after the Golgothian Sylex blast. Water wurms (or worms ) are agile swimmers—they are hard to catch and kill while in water. A water wurm's body is dark brown, similar to a typical worm's. Its body is made of many ringlike segments and is somewhat flat. Its mouth is round, with long, thin teeth surrounding it. This indicates that the teeth evolved to grab and puncture prey. The water wurm also has two thin, flexible tendrils on either side of its mouth, which could either be for sensing its environment or grabbing prey. Yavimaya Wurm [ | ] Two varieties of wurm are known as the Yavimaya Wurm . The first is sluglike, with a characteristic Chinese face with a dragon-style mustache. The second, observed only in Shandalar (but summoned from the forests of Yavimaya), resembles a snake. While not studied, this could be due to a faulty summoning across planes. On the world of Eldraine, many wurms have adapted to life among the world's skyscraping beanstalks. These beanstalk wurms sport leafy growths, sustaining themselves on a mixture of natural photosynthesis and a carnivorous diet, and their stomachs are lined with thorns that aid in digesting prey eaten whole. The giants of the Kingdom of Storms often use beanstalk wurms as a first line of defense against those who would ascend the massive beanstalks known as Everstalks to intrude on their realm. Beanstalk wurms lie coiled along the length of an Everstalk with their eyes closed and their stomach flattened against the stalk, appearing to be an enormous vine until an intruder attempts to climb them. The Cowl Prowler prowls the Cowl of Kaladesh. It resembles a giant lamprey. Slagwurms [ | ] Slagwurms are the largest type of wurms on Mirrodin. These creatures lived in the Tangle on Mirrodin . They are known to dig huge tunnels. They compete for nesting ground around the Radix . Slagwurms all have large heads covered in natural armor plating; as a result, they have small, weak eyes. The people of Mirrodin made armor from slagwurm plating. The armor was tough, effective, cheap, and easy to make, as long as the armor of a slagwurm was on hand. Several types of slagwurm exist: the engulfing slagwurm is known for devouring its prey whole and is capable of eating any type of creature. Plated slagwurms are giant creatures—they are even larger than engulfing slagwurms—covered in defensive plates. Their plates can deflect almost any type of attack. The roaring slagwurm is the smallest type of slagwurm on Mirrodin. It is, however, capable of killing many smaller creatures easily. Its roar can disable nearby machines for a short time. During the Phyrexian invasion of Mirrodin , the Phyrexians compleated several types of wurms. At first, they created the wurmcoil engine, a mechanical type of wurm with no living flesh. The wurmcoil engine was equipped with fast-acting toxins that could easily kill most creatures; the engine could also harvest the flesh from its victims, feeding the Phyrexian cause. If the engine was about to be destroyed, it could separate into two parts as a method of escape. One of the segments held the engine's toxins, while the other harvested living matter. As the Phyrexian invasion progressed, Phyrexia started to compleat Mirrodin's living wurms. The Praetor Vorinclex enjoyed compleating living slagwurms; the quilled slagwurm was one of Vorinclex's creations. Vorinclex removed the wurm's teeth to make it a more efficient killer. The wurm would simply swallow its prey whole, rather than chew it up first. The quilled slagwurm was a compleated version of the plated slagwurm; it lost its armor plates, which drastically changed its appearance, and allowed it to move faster, but made it more vulnerable to attacks. The massacre wurm was the first example of this; it was most likely some type of slagwurm at first—possibly a decayed roaring slagwurm, judging by its size—but was improved. The massacre wurm's very presence rotted and drained all life near it. The massacre wurm was one of Phyrexia's most powerful creatures, and one of its best examples of compleation. The wurms of Ravnica most often are found wreaking havoc in the Gruul wilds or have been trained by the Selesnyan Conclave. The Golgari have also been known to raise wurms as zombies . The wurms can travel through solid rock, temporarily rendering stone into a state of liquid by use of subsonic frequencies. The Selesnya Guild uses wurms as living weapons; they cover the wurms' heads in giant metal plates, turning them into battering rams. The siege wurm and armada wurm are both Selesnyan, as is the massive autochthon wurm, one of the largest creatures on Ravnica—second in size only to the worldspine wurm. The autochthon wurm is so long that it was said that it took an entire day to walk from its head to its tail. The Gruul Clans used three types of wurms to wreak havoc: the ruination wurm was a giant creature capable of easily wreaking a building. The streetbreaker worm was slightly smaller than the ruination wurm, but was no less destructive; it would burrow underground, before bursting onto the surface and causing massive destruction. The streetbreaker was more segmented than the ruination wurm, with an angular, draconic head. Finally, the Gruul used the battering wurm. This species was segmented, similar to the streetbreaker, but it was more insect-like; it had small, vestigial legs on some of its segments. Some Izzet enclaves make use of compost wurms to get rid of refuse. The worldspine wurm is the largest species of creature on the entire plane of Ravnica. Worldspines are not associated with any Guild; they are extremely rare and are too powerful to tame. Worldspine wurms, besides being able to pulverize entire districts of Ravnica, are nearly impossible to kill. They can survive being cut into multiple pieces; the pieces can simply grow into more worldspine wurms. The worldspine has a unique physiological feature among wurms on Ravnica: rather than having a two-part mouthpiece, the worldspine has a round mouth ringed with teeth. Each segment has a mouth, so each segment can theoretically consume food if the segment in front of it is removed. The wurms of Zendikar vary widely in size; some of them are smaller than many other wurms, while others are massive. Whiptails are the smallest type of Zendikari wurm. A whiptail has a red, slender body with rows of small ridges on the top; the ridges near the wurm's head are larger than the rest. The whiptail has a set of two primary fangs—for killing its prey—with many other smaller teeth, for gripping prey. The whiptail lives encased in solid stone, usually in the Akoum mountains. Because of this, it is excellent at sensing prey from a long distance. According to Jalun, an Affa sentry, \"Measuring that distance has been...difficult.\" The whiptail is a belligerent creature; it attacks whatever it thinks it can kill. It attacks by bursting out of the ground and using its long tail as a whip to smash the prey against nearby terrain. Another common type of Zendikari wurm is the vastwood gorger. The gorger is a massive species that lives in Oran-Rief, the Vastwood. Gorgers have huge, powerful bodies capable of devouring large creatures whole. They are called gorgers because of their massive appetite; a single gorger can devour large areas with ease. All of the gorger's vital organs are housed in its head. The rest of the wurm's colossal body is a chain of many stomachs that digest the huge amount of food that the gorger consumes. The vastwood gorger's mouth has four mouthpieces surrounding an extended throat. They function as \"arms\" to hold on to the gorger's food while it eats. The mouthpieces surround the throat, which has a secondary mouth, with small teeth. The broodhunter wurm is one of the smaller species of Zendikari wurm. This species has only recently appeared on Zendikar; its appearance coincides with the Eldrazi onslaught. The species aggressively attacks any Eldrazi nearby. The broodhunter has the same type of mouth as the vastwood gorger: four mouthpieces surrounding an extended, external throat. One theory is that the broodhunter is simply a subspecies of the vastwood gorger, created by the Roil to fight the Eldrazi. This would explain how it prioritizes Eldrazi as its main prey. While the broodhunter is smaller than the gorger, it is possible that it evolved that way to increase its stealth, a trait important in hunting Eldrazi. Another evolution of the vastwood gorger is the canopy gorger. This type of wurm has a similar size to the vastwood gorger, but it has adaptions that allow it to live in the treetop canopies of Zendikar. The canopy gorger's body is flatter than the vastwood gorger's, and the mouthpieces around its mouth aren't as long. While the vastwood gorger has a long, interior mouth that protrudes from its head, the canopy gorger's mouth does not extend past its face. The canopy gorger's body is more flexible than the vastwood's, and is more flat—this gives it more surface tension to hold on to the trees in which it lives. Because the canopy gorger's skin has to be more flexible, it is slightly less tough than the vastwood gorger's hide, but it is still capable of resisting a lot of punishment. The pelakka wurm is the pinnacle of the gorger family. It is one of the largest types of wurm on Zendikar—its size is matched only by the novablast wurm. The pelakka wurm has an insatiable appetite and will eat anything it wants, including some of Zendikar's largest creatures. The pelakka wurm's body is shielded by segments of tough yet flexible plating that allow it to move through the forests with ease. Its head is crowned by at least four large eyes that allow it to see at any time of day. Like all other gorger wurms, its mouth is surrounded by a ring of arm-like mouthpieces that grip prey. Its mouth is round and large enough to swallow some creatures whole. The most powerful wurm on Zendikar is the novablast wurm. Some elves consider it to be of mythical power; according to Mul Daya legend, \"the sun was born with its coils.\" Novablast wurms can produce a massive burst of energy, annihilating everything around them. Glowing marks cover some of their hides, and they often appear to glow intensely. The novablast wurm's head looks different from others of the Zendikari wurms. It has a ring of teeth surrounding a long, thin mouth, which also has teeth. Tentacles surround the mouth and are used for grabbing prey, similar to the mouthpieces on gorger species. The novablast wurm's eyes are set on the side of its head so that it can see in many directions at once."}