{"text": "Xantcha was a newt created in the Fourth of the Nine Spheres of Phyrexia . She was designed to live undetected among humans. She resisted Phyrexia's plans for her, instead developing a close relationship with Urza , and was responsible for taking in their companion Ratepe . The Fane of Flesh was where she and several other hundreds of sleeper agents were created. They were to be Phyrexian-controlled spies, not knowing they weren't even human. They were to record their observations and send that knowledge to Phyrexia , where it would eventually be used in the invasion of Dominaria . Overseeing Xantcha's group was the Inner Circle member Gix — a mighty Yawgmoth praetor. Xantcha was sent to the First Sphere, the least dangerous of them all, and was taught how to survive on the plane she would be sent to. However, Xantcha would have what was considered a gift on any other world, but on Phyrexia it was a fatal flaw—she thought for herself. Yawgmoth , the Ineffable, controlled all the sleeper agents, and to have one that was not part of this was very, very dangerous. Xantcha became traitorous to her people and was sentenced to death. She was then transported to a different plane. The planeswalker Urza had tried to get revenge on the Phyrexians for centuries for assimilating his brother , but he could not find their plane . When he saw the seemingly human Xantcha about to be killed by the Phyrexian monstrosities, Urza intervened. He rescued Xantcha from her executioners and, in return, Xantcha told Urza how to get to Phyrexia. On a mighty dragon engine , Urza traveled to Phyrexia with Xantcha. Urza had seriously underestimated the Phyrexian forces. After breaching through the First, Second, Third, and Fourth Spheres, Urza was completely overwhelmed by the Phyrexian forces. His dragon engine collapsed and Urza was under direct attack. Xantcha had gone to the Fane of Flesh and gained her life matrix, a device she called her \"heart.\" Xantcha saw the blood dripping down Urza's face and as Urza was about to collapse, they planeswalked away to safety. The two went to Serra's Realm . There, the planeswalker Serra used her white-mana magic to heal Urza at the risk of her own life. Xantcha slowly recovered with Serra's medicines. Five years later, Urza was physically healed. Phyrexian forces had tracked down Urza to Serra's realm to destroy him for his attack on Phyrexia. Urza and Xantcha planeswalked to Dominaria, escaping the destruction. Urza and Xantcha lived on Dominaria but Urza was going insane from having Yawgmoth reaching into his mind. She found a slave that looked like Mishra (named Ratepe ) and paid for his freedom. She sent him to Urza and together, they began to help Urza become sane once more. All went well until Xantcha detected sleeper agents in two small cities starting a small war. Urza created \"screaming spider\" artifacts which sent very high sound waves that humans couldn't hear but were deafening loud to sleeper agents. As Xantcha started planting these around the sleeper agent-infested cities, she went into a crypt where she discovered the praetor Gix. Gix went to Koilos and waited for Urza. Urza followed the praetor and they fought to the death. At first, it seemed as either could win. Then, Gix was gaining an upper hand in the battle. Xantcha and Ratepe knew what they had to do if Urza was to survive and Dominaria was to stand a slim chance of surviving Phyrexia's invasion—they had to sacrifice themselves, and so they did. The disruption made Gix pause and gave Urza the chance to defeat him. Xantcha and Ratepe may have been killed saving the planeswalker, but they would always be remembered. Urza would later use Xantcha's Phyrexian Heartstone as the personality core for his silver golem Karn . In 4562 AR, Jodah opened the Starfield Orb left by Urza. This orb contained a pocket dimension of the cabin Xantcha and Urza had stayed in on Gulmany . It contained numerous plans of Urza's, a myriad of copies of The Antiquities War , and constructs of Xantcha and Mishra, who greeted Jodah. Though not a planeswalker, Xantcha traveled through the Multiverse as Urza 's companion. Dominaria Moag Phyrexia Serra's Realm Vatraquaz Depicted in: Quoted or referred to:"}