{"text": "Yawgmoth ( Phyrexian : wUDkmoDZ , IPA : [jɒʔgmoʔθ], lit. \"Machine Father\" ), also known as The Ineffable to his servants and referred to as The Lord of the Wastes throughout Dominarian mythology, was the god and perfector of the Phyrexian race. Originally human, in his early life, he was a medical genius of the ancient Thran Empire known for his highly controversial solutions to medical ailments. While still human, Yawgmoth discovered an abandoned, artificial plane created by a deceased planeswalker and seized the opportunity to utilize that mechanical world to his ends. He took control of that plane and became its god, naming the world \" Phyrexia ,\" but his true dream was to return to his home plane of Dominaria and turn its inhabitants into \"perfect beings\" under his rule. As the main antagonist throughout multiple Magic: The Gathering sagas, he is one of the most well-known villains in the game's entire story. Yawgmoth was born in the last century of the ancient Thran Empire, during a highly politicized conflict between the artificer-aligned elite imperialists and the eugenicist-aligned republican rabble. Due to his fascination with the human body and his view that it was a marvelous machine, Yawgmoth became a champion of the eugenicist faction. Unfortunately for him, after the republicans were defeated, all of their eugenicist champions were blamed and exiled along with their followers. In The Thran , he is described as being a tall, muscular (due to past rigorous work), human, with thick, dark black hair that created a natural visor for his face. He is thirty-five years old when first introduced, returning from exile to meet Rebbec at the gates of the Thran capital, Halcyon . During his exile (from ages thirty to thirty-five), Yawgmoth journeyed the globe, visiting many different civilizations in his ruthless, cold-hearted pursuit of knowledge. During this time, he committed many atrocities, of which the following are known: He set the Black Cough upon the dwarves of Oryn Deeps , inciting a workers' rebellion that nearly killed the dwarven king and ended 1,000 years of dwarven rule. He turned the Creeping Mold of Argoth into a virulent plague that ate away the elves there. He also kidnapped their priest Elyssendril Lademmdrith and her healers, ordering the elves to pay ransom for their leader and the cure she had developed for the plague. When the elves paid, he delivered to them only sweetened water and 12 dead healers. He set the White Death upon the minotaurs of Talruum , just to study its effects. He infected the leaders of the cat people nations with rabies, after which they tore each other to pieces. He poisoned the human tribes of Gulatto Meisha . He pithed and vivisected the Bey of the Shivan Viashino . After five years in exile, Yawgmoth was suddenly recalled to the Thran capital of Halcyon, where the people remained unaware of his inhumane actions. A high-profile medical emergency had recently shaken the capital: Glacian , the chief artificer and technological genius of the Thran Empire, had been attacked and stabbed with a powerstone, after which he had caught a strange disease impervious to Thran healing magic. With nowhere else to turn for help, Glacian's wife Rebbec used her influence as chief architect to bring Yawgmoth back, hoping his expertise in eugenics could find a cure. Yawgmoth's medical expertise quickly bore fruit. He discovered that Glacian's disease, which he called phthisis , was caused by extensive exposure to powerstone radiation - the very energy source that powered Thran's advanced civilization. Most of the Untouchables (exiled Thran who lived in the Caves of the Damned , beneath the power stone-producing Mana Rig ) had also caught the disease. Upon hearing this, the man who had stabbed Glacian, Gix , started rallying his fellow Untouchables to rebel and take vengeance upon the Thran. Yawgmoth convinced Halcyon's elders to give him more funding and apprentices to study the disease. The healer Xod gave him the idea to use metals to create a serum against phthisis. When Gix and his supporters came to Halcyon, planning to start a massive rebellion, Yawgmoth managed to quell it by offering free serum to the Untouchables. For his actions, Yawgmoth was made a member of the council of Halcyon and was allowed to make laws to regulate public health. Yawgmoth started sending infected people down into the Caves of the Damned and had healthy Untouchables return to the city, using this to eliminate his enemies from the city. During this time, Rebbec and Yawgmoth started falling in love, although neither of them acted deeply upon it. It was eventually discovered that Yawgmoth was diluting the serum he gave to the Untouchables, claiming a lack of resources. This caused Gix to feel rebellious again, and he started to send Untouchables, both healthy and sick, up to Halcyon. Yawgmoth used this development to attain more funding and complete control over the Halcyte Guard. One day, the planeswalker Dyfed visited Glacian, wanting to meet the genius in real life, and also to learn about his spark, though she said nothing of it. Yawgmoth walked in on the meeting and managed to talk Dyfed into aiding him. Dyfed agreed to find a plane where Yawgmoth could build his paradise. When Gix led another large riot in the city, Yawgmoth was prepared. He made an artifact, based on Glacian's designs, to control all powerstone technology in the city. With it and the Halcyte Guard, he managed to stop the invasion and force Gix into complete obedience. After the city had been rebuilt, Halcyon held a great festival to honor Yawgmoth, but a strange group of delegates appeared shortly before it could commence. They were representatives of the nations Yawgmoth \"experimented on\" during his exile and they came to declare war on all who stood by Yawgmoth. Faced with the threat of a full-scale war with the united nations, the Thran council voted on whether Yawgmoth could stay, but the votes went 50/50. It came down to the last two members of the council; Yawgmoth and Rebbec themselves, voting together to ensure Yawgmoth's safety in the city. He immediately overthrew the council and imprisoned its elders, as well as the delegates. Sometime later, Dyfed opened a permanent portal from Dominaria to Phyrexia , the plane which Yawgmoth wanted to make his paradise. Yawgmoth bound himself to the plane within its core, becoming a god while staying there. He started to bring phthisis patients to Phyrexia, where they were implanted with empty powerstones that drained away their sickness. The patients slowly began to evolve as well, growing longer, thinner, stronger, and faster. Yawgmoth hid the two halves of the powerstone Dyfed cracked to power the portal inside Glacian's wounds. Yawgmoth fared quite well while warring with the alliance of nations against him. Using the Halcyte Guard, soldiers mutated in Phyrexia, and stonechargers , he could overcome any army that stood against him. Even when Dyfed turned on him, he did not give in. When she was stunned at the horror Phyrexia had become, he stabbed her in the back of the head with a powerstone dagger, disabling the planeswalker, hoping to dissect her and learn what she had that enabled her to planeswalk. Rebbec removed the powerstone however, mercy-killing Dyfed. But not all went well for him. He had used the Null Sphere to filter away the deadly gasses left behind by the stonechargers before they reached Halcyon. When the artificers that controlled it sacrificed their own lives to sabotage the Sphere, Halcyon was destroyed, all its inhabitants fleeing to Phyrexia or being eaten away. Yawgmoth had planned to stay in Phyrexia for a while and emerge again when the death cloud had lifted, but Rebbec had finally seen what a monstrosity he was and used the powerstones Yawgmoth had planted in her husband to close the portal between Phyrexia and Dominaria, locking Yawgmoth and his followers out for all eternity. Or so she hoped. Yawgmoth (in the background) after acquiring godhood. For ages, Yawgmoth continued to alter the Thran that had come to Phyrexia while fleeing the fallout of the stonechargers, transforming them into the first true Phyrexians. Using planar portals , the Phyrexians journeyed to many planes which they conquered, while they used its inhabitants as raw material for the Newts , as Phyrexians who had not been augmented were known. But Yawgmoth was not happy, for somehow Rebbec had completely locked him out of Dominaria. Then came the day the archeologist brothers Urza and Mishra disturbed the powerstone sealing the portal while exploring the Caves of the Damned, now known as the Caves of Koilos . Yawgmoth sent Gix , now a fully compleated Phyrexian and a member of his Inner Circle , through the portal as a scout. Gix planned to manipulate the Brothers, who had started a war . Having his minions, the Brotherhood of Gix , infiltrate both sides and eventually replacing Mishra with a Phyrexian, Gix hoped to magnify the war until it had destroyed all civilization on the continent, allowing for a simple infiltration by the Phyrexian Forces built up by Yawgmoth over the centuries. During the war's end, Urza activated the Golgothian Sylex , an artifact so powerful it completely devastated the world of Dominaria . Gix fled back to Phyrexia, telling Yawgmoth of what had happened. Gix's plans to infiltrate Dominarian society via the Sleeper Agent s were approved by the dark god, but the first few attempts failed since all the Agents looked alike. The sudden appearance of many people looking exactly similar had caused panic among the Dominarians, who proceeded to kill any they came across. Gix planned to try again, but by then the Shard of the Twelve Worlds was completed. The Shard had been a side effect of the Sylex Blast: it locked twelve worlds from the other planes of the multiverse, trapping many planeswalkers inside, but also keeping the Phyrexians outside. A furious Yawgmoth had Gix thrown into the 7th Sphere of Phyrexia, where he would be tortured for all eternity. Then Urza, who had died in the blast, but was reborn a planeswalker, attacked Phyrexia. Moments before he activated the Sylex, Urza discovered his brother had been turned into a machine and had gone completely insane, blaming those responsible for turning his brother into a machine for all the wrongs of the Brothers' War. To add more fire to his hate, Urza's eyes had been replaced with the Mightstone and the Weakstone , the two halves of the powerstone that contained Glacian's spirit. Having met the Newt Xantcha , who had been intended as a Sleeper Agent but had been turned into an expendable servant now that the Agents couldn't be deployed, Urza had discovered Phyrexia was responsible and had created a monstrous machine-dragon to attack the plane. He managed to blast a gigantic hole in the plane, all the way down to the 4th Sphere , but then Yawgmoth himself invaded his mind and made him go even more insane. Urza fled and for years he traveled from plane to plane, the Phyrexians always on his heels, for Yawgmoth couldn't let someone who planned to destroy Phyrexia go unpunished. Urza was eventually healed by Serra , but after he left the Phyrexians even invaded her realm and corrupted it. Then Freyalise , desperate to be free from the Shard, cast the World Spell , opening Dominaria to Yawgmoth once again. He released Gix from his torment since he knew more about fighting Urza and infiltrating Dominaria than anyone else, but while Gix was initially successful Urza returned to his homeplane as well. He first destroyed all Sleeper Agents and then killed Gix. In the wake of his latest setback, Yawgmoth set about concocting a different plan: instead of infiltrating Dominaria, he would prepare for a full-blown invasion. He started to amass an army and created the artificial plane of Rath , which he planned to fill with troops and then merge with Dominaria, placing all his forces there in a single moment. Even as he set his new plan into motion, Yawgmoth continued to send troops after Urza, recognizing him as one of the greatest threats to his plans. One of the more successful ones was K'rrik , a Sleeper Agent who tracked down Urza's academy on Tolaria , where mages were trained and artifacts were built to fight Phyrexia. K'rrik succeeded in destroying the place, but Urza sent the silver golem Karn back in time to prevent this. He succeeded, but the time machine overheated and destroyed the academy nonetheless. When Urza returned ten years later he found that the time streams of the island had been twisted. In some places, ten thousand years happened in a single second, in others, it was the other way around. Trapped inside a fast-time bubble, K'rrik had ages to prepare for an attack on Urza, but the planeswalker eventually managed to defeat him with the help of the nature spirit Multani . While the evincars of Rath started to overlay small parts of the plane with Dominaria in preparation for the coming invasion, the artificial plane filled up with beings from Dominaria and other planes on which the Phyrexians could experiment. Among them were the Kor , humans with strange elongated skulls. When the Inner Circle member Croag , who oversaw the progress of the plane, discovered humans with Phyrexian traits in them in Benalia , the truth about the Kor was revealed: Urza had started the Bloodline project , a grand plan to manipulate the breeding patterns of several groups of Dominarians to create perfect warriors to fight Phyrexia. The project resulted in ordinary humans with an affinity for tracking down and fighting Phyrexians, and in the Metathran , genetically engineered warriors with no will of their own, eerily similar to the Phyrexians they were designed to fight. After discovering this, Yawgmoth increased the raids on Dominaria, tracking down the Bloodline results and killing them. Croag devastated the nation of Keld , where the renegade Bloodline researcher Gatha had created humans like Kreig , who were able to severely wound an Inner Circle member. Despite Yawgmoth's efforts, some Bloodline children slipped through the attacks, such as Gerrard , the true heir to Urza's Legacy , a collection of artifacts made for the single purpose of destroying Yawgmoth. The attacks became so frequent at times that they started to play a role in local myths. Stories about the Lord of the Wastes, a machine lord who waged eternal war on Dominaria, started to spread from Benalia to Jamuraa. After many centuries of preparation, Yawgmoth finally launched his full-scale invasion of Dominaria in 4205 AR. Throughout most of the invasion, Yawgmoth remained within the depths of Phyrexia while his minions Crovax and Tsabo Tavoc commanded the Phyrexian armies in battle. Tsabo Tavoc's plagues and shock troops devastated numerous Dominarian nations, while Crovax oversaw the overlay of the plane of Rath onto Dominaria, bringing millions of additional Phyrexian soldiers and monstrosities to assault the beleaguered world. Yet even as Phyrexia wore down Dominaria’s nations, the defenders managed to fight for months on end, delaying Phyrexia’s victory. In the face of continued resistance, Yawgmoth became convinced that his ultimate foe was not Urza, but the living spirit of Rebbec herself, who he believed had somehow survived the destruction of the Thran and ascended to become the Dominarian worldsoul, Gaea . As Dominaria struggled, Yawgmoth sensed Rebbec resisting him even still, determined to shut him out of Dominaria for eternity. Yawgmoth's darkness fills the skies as he returns to Dominaria at last. In the last hours of the war, Yawgmoth finally returned to Dominaria for the first time in 9000 years. He did so in the form of a black, world-spanning death cloud that killed Dominaria's defenders and resurrected them to fight for Phyrexia. But there was still hope for the plane: even as Yawgmoth's black spirit wrapped around the entire world and prepared to crush it in his grasp, Urza and Gerrard hovered high overhead in the skyship Weatherlight , the main part of the Legacy. They punctured the Null Moon itself and collected the white mana it had been gathering there for millennia, ever since the Thran artificers of old had launched it into the sky and caused Yawgmoth's first defeat. Yawgmoth tried to flee back to Phyrexia, but the Stone Druids had activated the volcano under the Stronghold , covering the only remaining portal to Phyrexia in deep magma. Yawgmoth was hurt by the white mana but survived. Seeing the Weatherlight transfigured and wreathed in beaming white mana like a divine being, Yawgmoth no longer recognized it as Urza's skyship but instead perceived it to be the soul of Rebbec, the protector of Dominaria and his opposite. Resolving to possess and destroy Rebbec at last, Yawgmoth summoned a storm of giant black tentacles that erupted from the black clouds and attacked the Weatherlight . Undeterred, Gerrard took out Urza's gemstone eyes - the two halves of the powerstone that had locked out Yawgmoth and contained the spirit of Glacian - and placed them in the cavities in Karn's chest, completing the Legacy. The exact working of the Legacy device is unknown, but it created a sentient light that exploded from the Weatherlight and dissolved Yawgmoth's death-cloud form, killing him at last. 101 years later, the godlike being Karona was looking for other beings like her. She first summoned a \"god\" for each color of magic, and the black one appeared to be Yawgmoth. Later she traveled across the planes and ended up in Phyrexia, devastated by the Nine Titans , but still holding together. There she met a disembodied voice claiming to be Yawgmoth, suggesting that he was still alive and needed her help to rebuild. However, subsequent canon sources have explicitly confirmed Yawgmoth's death, and given Karona's unstable nature, this supposed encounter was likely just a manifestation of her warped psyche. Alternatively, the whispering voice might have been a lingering echo or faded memory of the dead god's former power in Phyrexia. Given Karona's near-omnipotence and unique power to shape reality, it's conceivable that she alone might have been able to resurrect Yawgmoth and restore his broken plane had she truly wished. In any case, she declined to do so, recoiling in horror from Phyrexia and fleeing its shattered husk. Due to Yawgmoth's importance as a character within the storyline, and lack of explicit presence as a card within the game, fans have asked for years about his true appearance. This led to an Ask Wizards question , which incorrectly answered that he's represented in Yawgmoth Demon because this card represents a Yawgmoth demon, not Yawgmoth as a demon; this answer was later removed from the website. (Answer quoted here .) The true appearance of the dark god was finally unveiled on the Dominaria card Yawgmoth's Vile Offering . Yawgmoth received his card, Yawgmoth, Thran Physician , in Modern Horizons ; however, this card represents Yawgmoth as a human in the days of the Thran, rather than the Phyrexian god. An image of Yawgmoth in this form being felled by the Legacy Weapon was also revealed in the Dominaria United worldbuilding video. Though not a planeswalker, Yawgmoth traveled through the Multiverse using the portal to Phyrexia. Dominaria Phyrexia Associated cards: Depicted in: Quoted or referred to:"}