{"text": "Zarel Ewine was the Grand Master of the Arena in the city of Estark on Dominaria , between the Night of Fire and the Time of Troubles . He was a corpulent man, with a bulging stomach and beefy hands. In his youth, he probably had pox. He was dressed in a multihued cape, reflecting all the colors of the rainbow. Zarel, harboring ill will against Cullinarn , convinced Kuthuman to destroy the most powerful House in Kush - Oor-tael , and steal its mana. During the Night of Fire, that House was attacked by the four other Houses and the forces of Kuthuman, who was still the Grand Master of the Arena then. It was that night when Zarel scraped out the left eye of Garth , who was only five at the time, as a cruel leverage with Cullinarn. When Kuthuman powered Kirlen's spell with Oor-tael's mana, obtaining the ability to planeswalk, Zarel became the Master of the Arena. He had the ambition to become a planeswalker as Kuthuman did before. To reach his goal he needed two things: a powerful spell researched by Kirlen which would give him the power of planeswalking, and enough mana to cast it. Since he had been tasked by Kuthuman to gather the mana needed for the planeswalker, Zarel had to gather mana for his personal scheme in secret, and did so by constantly raising taxes in Estark. Thus, in order to keep in check the restless mob, he decided to increase the violence of the Festival of Estark which, from a trial of magical power, became a bloody sport. When Garth, heir of Oor-tael, reappeared in the city twenty years later, Zarel used everything at his disposal to kill him, without success. After the 998th Festival, fearing the imminent return of Garth or Kuthuman, who were fighting on another plane, he decided that the time for his ascension had come, and destroyed the remaining four Houses of Estark , gathering their mana. Having obtained an incredible power, he started blasting away the people of Estark with his spells. Unfortunately for him, Garth, having defeated Kuthuman, returned to Estark and put an end to the evil rule of Zarel, killing him. He was succeeded in his position as Grand Master of the Arena by Varena ."}