{"text": "Tazeem Zendikar , the setting for the original Zendikar block and both its sequels , is an \"adventure-world\" plane with powerful sources of mana , which flows differently there. Its riches in mana and other wealth have made it a destination for Planeswalkers to explore and exploit. This promise is also enough to lure in various local explorers and adventurers. Zendikar's landscape is constantly shifting and changing. This process is called The Roil . It makes settlements very scarce and only a few outposts of civilization are present. The plane consists of seven continents: Akoum , Bala Ged , Guul Draz , Murasa , Ondu , Sejiri , and Tazeem . Bala Ged, Sejiri, and Tazeem were devastated by the Eldrazi, but are now recovering thanks to Nissa Revane 's use of the Lithoform Core . Another geographical feature to be noted is the large, floating polyhedron-shaped stones called hedrons that litter the landscape. For a long while, nobody was sure what they were but their gravity-defying existence hinted at the strange properties of gravity and mana on the plane. These ancient, rune-carved monoliths are strewn across Zendikar. Up to ten miles long, some of these stones drift in the sky; others are buried in the ground, some whole, some broken. Trap-riddled ruins can be found on every continent. Mysterious glyphs hint at truths long forgotten. Unspeakable monsters lurk in the quiet of these hidden monuments of a forgotten past. The ruins still emanate power, and both planeswalkers and local explorers will undergo great peril to reap their rewards. Known locations across the seven continents include: The Teeth of Akoum Affa The Affa Inn The Akoum Expeditionary House The Spikefields The Windblast Gorge or Drake Ravine A small training camp founded by the League of Anowon . Fort Keff The Eye of Ugin Goma Fada Tal Terig Ora Ondar The Khalni Stone Glasspool Ior Glass Haven The Akoum Skyclave Rogah Throughway Akoum's Belt The Pass of Woe Guum Wilds Riverroot The Surrakar Caves Bojuka Bay The Bordermire The Umung River Umungshore The Tangled Vale The Bala Ged Skyclave Malakir Nirkana District Kalastria District Emevera District Urnaav District Ghet District The Hagra Cistern The Pelakka Karst The Hanging Swamp The Free City of Nimana The Guul Draz Skyclave The Murasa Wall The Cliffs of Kazuul and the Kazuul Road Sunder Bay or Sunder Cove The Tumbled Palace Glint Pass , The Cipher in Flames Visimal, the Hidden City The Pillar Plains The Vazi River Thunder Gap The Wall of Omens The Skyfang Mountains or the Shatterskull Mountains Shatterskull Pass Zektar Shrine The Na Plateau The Singing City Raimunza Falls Raimunza Hive The Living Spire The Grindstone Crucible Kazandu The Raimunza River Blackbloom Lake Root caves The Doom Maw The Silent Gap A third cave The Murasa Skyclave The Makindi Trenches The Teetering Peaks or Teeterpeak The Prison of Omnath The Soul Stair Turntimber Mosscrack Graypelt or Greypelt Wolfbriar Agadeem Kabira Kabira Conservatory The Crypt of Agadeem The Crypt Maw Beyeen or the Crown of Talib Mount Valakut Zulaport Boilbasin Jwar The Strand of Jwar The Ondu Skyclave The Serpent's Maw Midnight Pass Ikiral Benthidrix Chill Depths The Sejiri Skyclave Emeria or Em's Realm Halimar The Halimar Sea Caves Sea Gate The Lighthouse Sky Rock Oran-Rief Forest The Umara River The Umara River Gorge The Magosi Waterfall The Magosi Portage The Merfolk Enclave Coralhelm The Lun Bulwark Jade Room Hadatown North Hada Ruins of Ysterid Wren Grotto Cliffhaven , possibly in Ondu. Hedron Field , a non-canon location. Its name refers to the similarity between the shapes of hedrons and baseball diamonds. Goblins, elves, kor, and vampires make up the audience in its stands. The plane is inhabited among others by goblins , elves , merfolk , humans and vampires . It is also the home of the Kor (who have been abducted to other planes from Zendikar). Other races that can be found on Zendikar are angels , ogres , minotaurs , and giants . A reptilian race of questionable sapience, known as the Surrakar , dwelled exclusively on Zendikar but now seems to be extinct. Assorted wildlife, ranging from insects to beasts also dwell on the plane, posing another threat for explorers not to be eaten or killed. Some of them, like the Gomazoa , have adapted to the flying topography. These look just like regular floating rocks. A popular game among adventuring parties and expeditionary houses is the game Conquest . Played with a fifteen-card deck, including Cunning , Foe , Victory , and Power , each card is revealed individually and adventurers take turns sharing true stories related to the shown card. The player with the most impressive story takes the card, and the player with the most cards after the game is the winner. Murasa. Before the imprisonment of the Eldrazi, there were various civilizations on all continents, which worshiped a myriad of \"unrecognizable\" gods. These have been mistaken for Eldrazi ruins, leading to several misconceptions about the latter. Centuries before the arrival of the Eldrazi, the kor built an empire. Driven originally by a desire to see the world united in peace and harmony, this empire quickly grew into an authoritarian state where the Kor imposed their ideals, laws, and structure upon the unwilling peoples of other continents. This imposition bred resistance among their subjects, and as they met with increasing resistance to their rule, they became more and more oppressive and tyrannical. The great capital city of Makindi , which gave its name to this kor empire, was in Ondu . To maintain the empire's hold over the world, kor stoneforgers built seven Skyclaves — military bases, government headquarters, and small cities that ﬂoated in the sky above each continent. Each Skyclave was built around a central power source like a miniature sun, designed as dozens of ﬂoating platforms that could close tightly into a sealed, hollow sphere for defense. As the world endured centuries under the Kor's oppressive rule, the empire's iron grip began to weaken. Over a century, the Skyclaves began to fall until only Emeria, the Sky Ruin remained in the air. Over six thousand years before the Battle for Zendikar, The Three decided to force the Eldrazi into physical form and trap them on a plane, sacrificing that plane for the well-being of the Multiverse. They searched for a plane with lush ecosystems and uniquely dynamic mana — a powerful lure for the Eldrazi's insatiable hunger. They decided on Nahiri's own Zendikar . Sorin Markov lured the Eldrazi to the plane, directing their hunger to that unique mana, Ugin used his invisible breath to combat the Eldrazi and his colorless magic to bind them to the plane, and Nahiri had constructed a massive network of stone hedrons , whose power would form the bars of a planewide prison, forever preventing the Eldrazi from leaving. Ugin arranged the hedrons to direct leylines of energy, which were not to be disrupted . The planeswalkers concentrated the power of their imprisonment spell in a secret location deep inside Zendikar's mountains of Akoum : a subterranean chamber called the Eye of Ugin . To make sure that the imprisonment would not be broken, the three planeswalkers sealed the chamber with a mystical lock: the Eye of Ugin could only be reactivated by the presence of three planeswalker sparks—and the colorless, invisible breath of Ugin, the spirit dragon himself. The planeswalkers' trap worked. Emrakul, Ulamog, and Kozilek manifested in physical form on Zendikar, became confined by the magic of the network of hedrons, and thanks to the magic of the imprisonment spell, sank into harmless dormancy. Their mission was complete, and the planeswalkers disbanded. Sorin and Ugin left the plane, while Nahiri remained to watch over Zendikar and protect the Eldrazi's prison. A few thousand years after the imprisonment of the Eldrazi by The Three , the noxious creative force of Ulamog became an infection that took hold of the people who dared to live in Akoum 's mountains despite the tectonic instability of the region. They became a sort of cult devoted to an imagined deity of the mountains, established a temple near the site of the prison, and began performing rituals inspired by their growing madness. The cultists avoided the notice of the increasingly reclusive Nahiri and over time and multiple generations, their rituals proved effective in loosening the bonds of the Eldrazi prison. When the hedron network was disturbed, their prison proved tenuous, and they came close to breaking free. A small fraction of their power was able to emerge which let loose legions of Eldrazi drones . Zhulodok was among the first wave to awaken and its name was whispered first into the minds of desperate cultists and later screamed from the mouths of panicked victims. Zhulodok razed the land and siphoned mana to fuel the eventual return of the three Titans. It marched across the land seeking anything to satiate its hunger. Mountains were crushed in its wake, splintered and carved out by Zhulodok and the monstrous forces at its back. It is said that a single night of feeding carved out the shape of the Windblast Gorge , once a towering range of mountains. Zhulodok's presence was said to inspire hunger and a thirst that could never be quenched, driving its enemies to consume each other ahead of the advance. This caused a famine so powerful that it even affected Ulamog's followers, though they understood this hunger as his gift, and followed it willingly. By following the path of carnage, the cultists who helped free the Eldrazi saw firsthand the power of consumption, and how to turn flesh and blood into power. Only twelve of them survived the initial wave of spawn emerging from the prison, but those twelve became the first vampire bloodchiefs, the progenitors of the vampire race. Nahiri , who had remained on Zendikar to keep watch, called for aid from Sorin and Ugin. When her beacon went unanswered, alone she identified the disturbance in the hedron network and repaired it, returning the Eldrazi to their slumber. Even after Nahiri slew Zhulodok and sealed the Eldrazi in their hedronic prison again, the vampires would whisper the name of Ulamog's prophet for millennia to come as a curse against Zendikar itself. At some point, Urza visited Zendikar, hoping that the hedrons' magic could stop Phyrexia. He deemed the matrix's power insufficient and so, he abandoned this idea. Hedrons. The meeting of Vol, Nalaar, and Beleren in the Eye of Ugin chamber loosened the bonds that kept the Eldrazi in torpor, and they rose to feed on the life of Zendikar again. Thousands of years ago when the Eldrazi first had awoken, the destruction was vast; the natural world nearly perished. The power of the Eldrazi was unfathomable, and humanoids didn't so much as slow down their progress. It took the return of The Three to put the great Eldrazi to sleep again. Since then, the planet created the Roil to battle the drones and with the new awakening, some humanoids received a mana infusion that enabled them to fight back. Within two years of the release of the Eldrazi, Sea Gate on Tazeem and the entire continents of Sejiri and Bala Ged were overrun. However, the adventurers of Zendikar, even severely outgunned as they were, wouldn't fold to the Eldrazi abominations. Gideon Jura took command, and started gathering allies to take the offensive. Battle-hardened veterans and desperate recruits flocked to his banner. The vampires of Malakir joined in, as well as the Roil -mages of Noyan Dar . Kiora , a Planeswalker native to Zendikar, brought her army of merfolk and colossal sea monsters to the fight. They began an attack on the Eldrazi-controlled Sea Gate, joined soon thereafter by Nissa . The Eldrazi were driven from the city, and Sea Gate's defensive ramparts were rebuilt and fortified. The soldiers of Zendikar celebrated a hard-won victory. Then, Jori En arrived with the news that Ulamog himself was approaching .... The Planeswalkers enacted a bold new plan. While Gideon's troops and Kiora's forces held the city against this fresh assault, Nissa called on the elemental power of the earth to raise sunken hedrons from the ground and move them into a ring around the Eldrazi titan. Jace activated the hedrons' magic, and Ulamog was trapped! Then everything collapsed. Ob Nixilis appeared, having followed Nissa from Bala Ged . Gleaming with joy, he slaughtered the Kor guards and siphoned the power of the hedrons into himself, reigniting his spark . In one final act of vengeance against Zendikar, he destroyed the hedron network and awoke the slumbering Eldrazi titan Kozilek . In quick succession, the Planeswalkers dedicated to stopping the Eldrazi were either defeated or went missing. Beset by the distortions of Kozilek, general Tazri was saved by the protection of her halo. She regrouped with Noyan Dar, the vampire queen Drana and the Kor squad leader Munda , and, inspired by the angel she had killed long ago, took command. Meanwhile, Chandra Nalaar showed up and freed her planeswalker friends. Their concerted attack managed to scare Ob Nixilis away from Zendikar. The four planeswalkers realized that they were helpless against large threats on their own, but that they could stand against just about any force in the Multiverse by working together. Thus they swore an oath to stand together and the Gatewatch was created. Seeing that he could not keep his promise to Ugin to neither harm the Eldrazi nor allowing them to escape from Zendikar, Jace decided to slay the Titans with the Gatewatch's and Kiora's help. After consulting with Nissa, he described the leyline pattern to her that would bind Kozilek and Ulamog to Zendikar, drawing the bulk of the Titans into the plane so that their energy could be dispersed into Zendikar, killing them in the process. To attract them, the remaining forces of Zendikar's defenders would pose as bait. While the plan worked at first, with Gideon keeping the Eldrazi swarms away from the army, Kiora clearing out any other swarms, and Chandra supporting them, once the Eldrazi titans were anchored to Zendikar, their destructive essence threatened to assimilate Zendikar into themselves. Afraid, Kiora tried to persuade Nissa to release the Titans and allow them to flee, but Jace objected. Chandra offered to burn the Titans instead and after preventing Kiora from attacking Nissa, Jace agreed. The pyromancer then connected with the animist, allowing her to channel her pyromantic magic through Zendikar's Ley Lines directly into the Titans. In one brilliant blaze of flame, Ulamog and Kozilek were incinerated and destroyed, leaving only ashes raining from Zendikar's sky. The rebuilding of civilization was lead by General-Commander Tazri . Like an inflammation that persists after the infection is gone, the Roil remains active even after the destruction of the Eldrazi, and it remains one of the greatest hazards to adventurers who brave the wilds of Zendikar. In the wake of the Eldrazi's fall, a plan was needed to rebuild Sea Gate. Unfortunately, the Sea Gate Reconstruction Project found itself with a plan too many. Each of the five expeditionary houses presented its vision for a wonderful new city. Fed up with the houses' infighting, Commander Tazri drafted a plan of her own. The angel Linvala immediately stood behind Tazri's proposal, and the word of an angel swayed even the stingiest expeditionary house. Within a year, the city was restored. Around the same time, an expedition of adventurers ascended through the ruins of Emeria and discovered the remnants of the Skyclave, which the merfolk had once claimed was the castle of their goddess. In the course of their exploration, they triggered the magical defenses of the ancient Skyclave — and awakened the other six. Whatever their ruin and disrepair, all seven Skyclaves rose back into the air and opened. Above every continent, people looked to the sky and saw shattered fragments of cyclopean ruins drifting slowly among the clouds. While the entirety of the ruins took to the skies, broken-off chunks did not necessarily reattach. This resulted in free-floating structures, out of reach of the average adventurer. While Zendikar is rife with talented line-slingers, few were interested in risking their lives to access these obscure ruins—not when the \"accessible\" Skyclaves were filled with treasures of their own. Two guardians returned to Zendikar, but they were at odds on how to restore Zendikar to its former glory. Guilt-ridden Nahiri vowed to negate the Roil, by using ancient kor technology . She didn't care if this would be accomplished at a massive cost of lives. Nissa Revane opposed her. In the end, Nissa Revane prevailed, and restored the soil and wild nature of Zendikar by use of the Lithoform Core . Zendikar was a target in New Phyrexia's Invasion of the Multiverse . The now- compleated planeswalker Nahiri arrived at the Emeria Skyclave and began realigning the plane's hedrons to facilitate Realmbreaker's incursion into the plane. As she worked to transform the Skyclave once more into a weapon of war, the Roil rose to meet her and was defeated until the landscape below shifted to the gray uniformity of bed-rock for miles. Once complete, the Skyclave began its work as a Phyrexian engine, merging stone with metal, latticed flesh across the surface, and pouring rivers of oil into Zendikar's waterways. As Phyrexians scurried into Zendikar, Seagate was defeated once more. A party under the command of Tazri attacked Nahiri in the heart of the transformed Skyclave. Though Nahiri at first gained the upper hand with ease, the fight turned as the angels of New Capenna entered the Multiverse and gave angels everywhere access to Halo . With Linvala's newfound strength and Tazri's halo, the party managed to break Nahiri loose from the reformed Hedron network and knock her from her feet. As they escaped, they witnessed the Skyclave breaking and crashing to the ground with Nahiri still inside. While the invaders were halted by Norn's demise, the terraforming remained, and Zendikar's leylines were badly damaged. Nahiri, now uncompleated and desparked , worked to remove the metal from the Skyclave, wishing to use it to restore the lands, but the loss of her spark meant the scope of her mission was far greater than could be accomplished. Ancient Kor, spoken by Nahiri It has its runic writing system The Graypelt tongue \" Ashaya \" means \"The Awoken World.\" \" Shaya \" means \"Worldwaker.\" The merfolk language, a highly-developed pictographic written language. Uksil , the druidic term for the language of the trees of Turntimber. It is believed that the creaking of the corkscrew-like trees is a secret language, and many have unsuccessfully attempted to understand it. The Faduun of Jwar Isle speak a language unknown to modern scholars. Associated cards: Referred to: Zendikar: In the Teeth of Akoum A Planeswalker's Guide to Zendikar The Art of Magic: The Gathering - Zendikar Zendikar Rising Teaser (Video). Magic: The Gathering . YouTube (August 24, 2020). Zendikar Rising Official Trailer (Video). Magic: The Gathering . YouTube (September 1, 2020). Ari Zirulnik and James Wyatt (September 1, 2020). \" Zendikar: Things Have Changed \". magicthegathering.com . Wizards of the Coast."}