{"text": "Zimone Wola is a female mage -student of Quandrix College at Strixhaven University on Arcavios . Zimone is a brilliant and bright prodigy who entered Strixhaven at a younger age than most. Due to her high level of intellect, she flew through her studies in school, passing endless tests of magical study that were way beyond her years. She has recently chosen her college, now becoming a second-year Quandrix mage student much to the delight of her professors, who are keen for the talented whizz to attend their classes. While part of Quandrix, she remains friends with two girls she met in her first year; one who has chosen Prismari and the other who will be attending Silverquill . Zimone wears patterned uniforms like the rest of Quandrix; it is layered and complex, reflecting what she loves. Her goal is to crack the Vorzani Conjecture; a famous and unsolved magical theorem that students and professors at Quandrix have been trying to figure out for decades. Zimone can often be found inside the great Biblioplex – finding books to help solve the theorem. Her mind is her most powerful weapon which enables her intellectual expansion. Her physical magic is shown as fractals and mathematical interpretations of nature. Intellect runs in her family – her grandmother was once a Quandrix professor but due to unclear circumstances, she has not been seen at Strixhaven University for many years. Even though Zimone is smart, sometimes she can feel uncertain. She struggles to deal with unknown mysteries, particularly ones relating to her own family. Her time at Strixhaven will help her figure out who she is, but it will be the challenges she faces that will allow her to decide who she wants to be. Zimone was raised by two fathers, Zihir and Dipo. They avoid talking about Zimone's grandmother Nimiroti . Unbeknownst to her parents, Nimiroti was sending Zimone little birthday notes and packages filled with blue/green ribbons. Over the years the number of ribbons increased in a Fibonacci sequence . Zimone plaited the ribbons into the braid. When she was admitted to Strixhaven, the Deans spoke highly of her grandmother but didn't tell her what happened to Nimiroti either. Zimone discovered that one of the last things her grandmother did was check out a book titled The Vorzani Conjecture: Extended Reading on Fractal Theory . The book covers the unsolved Vorzani Conjecture, which holds the key to unlocking the very essence of the universe; a boundless infiniteness . Once Dean Kianne found out that Zimone had been reading this book, she blamed Dean Imbraham for negatively influencing her, and wanted Zimone to stop. A scribbled note in the book mentioning her ribbons told Zimone to find \"living books\". She found Codie , who finally told her exactly what had happened to her grandmother: Nimiroti had solved the Vorzani Conjecture. Afterward, the sinister mages known as the Oriq captured her. Nimiroti had to cast a memory loss spell on herself to erase her knowledge of the Conjecture from her mind, so the Oriq would have no use for her. The Oriq let her go, but Nimiroti's mind was confused and she left Strixhaven shortly after. Because Zimone was close to solving the Vorzani Conjecture herself, she was also captured by the Oriq. Extus Narr knew about the packages Nimiroti had been sending to Zimone and wanted to use her knowledge to \"control time and space.\" The Oriq argued that Strixhaven is controlling access to magic on Arcavios and that the world would be better off without it. Extus also claimed that the story Codie had told her about Nimiroti was incorrect - that instead Nimiroti was driven mad by the conjecture and the Oriq tried to help her. Zimone rejected his advances. But when Dean Kianne and Zimone's friends came to the rescue, Zimone saved Extus and claimed that he was just about to let her go. In the process, she demonstrated that she had mastered time and space, and thus had solved the Vorzani Conjecture. When Zimone came back to Strixhaven, word got out about her getting caught by the Oriq and stopping the fight. People began to believe she was in league with the Oriq, and even her friends distanced themselves from her. Dean Imbraham and Kianne were also suspicious. Zimone eventually found Nimiroti at a sanctuary for people damaged by magic. Nimiroti's mind is no longer what it was, and she has lucid and nonlucid days. When New Phyrexia's Invasion of the Multiverse started, the Phyrexians quickly burned through the defenses of Strixhaven. Professor Vess tasked a small group of surviving students - Zimone, Rootha Squallheart , Quintorius Kand , Dina and Killian Lu - to search for the Invocation of the Founders in the Biblioplex. The group found it and with a representative from each school they could activate it, but the compleated Nassari distracted Rootha enough that Quint could only try to make up her contribution with raw magic and lifeforce. The result was not entirely successful, and in the process, Quint's spark ignited and he planeswalked away. Though the invocation managed to repel the main wave of attackers, Zimone broke her leg and Quint was missing. Though Zimone and Dina had been friends before, they'd never collaborated on a cross-college project. Under pressure of certain death, they blended their magics together and found to their delight that the intersection of Quandrix mathematics and Witherbloom biology led to new interdisciplinary magics never before seen. Using mathematical theorems, Zimone enhances Dina's plant growths, allowing the two of them to deal exponentially more damage than they otherwise would have apart. Zimone appears in the trailer for Strixhaven: School of Mages . Depicted in: Quoted or referred to:"}