{"text": "Zomaj Hauc was a demented Izzet magelord from Ravnica , who schemed for world domination. Zomaj Hauc was \"300, 400 years\" old. He had been one of the fortunate Izzet to receive the touch of the Firemind , an extrasensory link with Niv-Mizzet's omniscience. With his delusions of grandeur and increasingly erratic behavior, Crix eventually concluded that Hauc suffered from what was known as “firemadness.” Hauc's brilliance and obsession with himself were rivaled perhaps only by his guildmaster, Niv-Mizzet . He hatched a scheme that, if it worked, would have devastated an enormous piece of the known world. He first exploded a bomb above the plague-ridden \" Utvara Reclamation Zone \" that was supposed to kill all life while leaving the buildings so its Orzhov owners could start redeveloping it. The machine killed all the local Gruul with an implosion but didn't explode. Instead, it created a strange fold in space called the Schism that started sucking up all the ghosts of those who died in Utvara. Twelve years after the Decamillennial , he was still hiding his real plans. He worked diligently; exploiting his servants every way he could so that he could bring what he thought would bring the City to his knees, even Niv-Mizzet. His plan involved three dragon eggs he had uncovered years before. Ravnican dragons, in truly ancient times, had been immense and god -like, warring and devastating to nearly as great an extent as the Elder Dragons of Dominaria . In modern times, the only remaining dragons are a few feeble remnants in the form of drakes , and of course the leader of the League himself. Hauc heated the eggs for years, hoping to hatch them and then take over their minds, gaining control of the demigods , thus enabling him to smite the Firemind and raze the City, letting him rule from the ashes. Were it not for Agrus Kos , his Orzhov Pivlic , Izzet League courier Crix and Gruul chieftain Vor Golozar , he may very well have done so. When the baroness Teysa Karlov claimed her inheritance and moved to Utvara, it spurred Hauc into accelerating his plot. He managed to hatch and enslave an enormous blue dragon hatchling. However, Teysa replicated Zomaj's spell and gained control over an albino hatchling. Teysa and  Golozar then rode this dragon, followed by Kos and Crix in an Izzet observation sphere. During the midair fight, Hauc was flung into the side of a cliff and died as the albino dragon mortally wounded the blue one. Both dragons were killed as they simultaneously flew into a mizzium outcrop.  Although the group had ended the threat of Zomaj Hauc, Kos was killed in the process."}